arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
#define P9SELC                                             (HWREG8(0x40004C96))  /* Port 9 Complement Select */
#define P10SELC                                            (HWREG8(0x40004C97))  /* Port 10 Complement Select */
#define P9IES                                              (HWREG8(0x40004C98))  /* Port 9 Interrupt Edge Select */
#define P10IES                                             (HWREG8(0x40004C99))  /* Port 10 Interrupt Edge Select */
#define P9IE                                               (HWREG8(0x40004C9A))  /* Port 9 Interrupt Enable */
#define P10IE                                              (HWREG8(0x40004C9B))  /* Port 10 Interrupt Enable */
#define P9IFG                                              (HWREG8(0x40004C9C))  /* Port 9 Interrupt Flag */
#define P10IFG                                             (HWREG8(0x40004C9D))  /* Port 10 Interrupt Flag */

/* Register offsets from DIO_BASE address */
#define OFS_PAIN                                           (0x0000)              /* Port A Input */
#define OFS_PAOUT                                          (0x0002)              /* Port A Output */
#define OFS_PADIR                                          (0x0004)              /* Port A Direction */
#define OFS_PAREN                                          (0x0006)              /* Port A Resistor Enable */
#define OFS_PADS                                           (0x0008)              /* Port A Drive Strength */
#define OFS_PASEL0                                         (0x000a)              /* Port A Select 0 */
#define OFS_PASEL1                                         (0x000c)              /* Port A Select 1 */
#define OFS_P1IV                                           (0x000e)              /* Port 1 Interrupt Vector Register */
#define OFS_PASELC                                         (0x0016)              /* Port A Complement Select */
#define OFS_PAIES                                          (0x0018)              /* Port A Interrupt Edge Select */
#define OFS_PAIE                                           (0x001a)              /* Port A Interrupt Enable */
#define OFS_PAIFG                                          (0x001c)              /* Port A Interrupt Flag */
#define OFS_P2IV                                           (0x001e)              /* Port 2 Interrupt Vector Register */
#define OFS_PBIN                                           (0x0020)              /* Port B Input */
#define OFS_PBOUT                                          (0x0022)              /* Port B Output */
#define OFS_PBDIR                                          (0x0024)              /* Port B Direction */
#define OFS_PBREN                                          (0x0026)              /* Port B Resistor Enable */
#define OFS_PBDS                                           (0x0028)              /* Port B Drive Strength */
#define OFS_PBSEL0                                         (0x002a)              /* Port B Select 0 */
#define OFS_PBSEL1                                         (0x002c)              /* Port B Select 1 */
#define OFS_P3IV                                           (0x002e)              /* Port 3 Interrupt Vector Register */
#define OFS_PBSELC                                         (0x0036)              /* Port B Complement Select */
#define OFS_PBIES                                          (0x0038)              /* Port B Interrupt Edge Select */
#define OFS_PBIE                                           (0x003a)              /* Port B Interrupt Enable */
#define OFS_PBIFG                                          (0x003c)              /* Port B Interrupt Flag */
#define OFS_P4IV                                           (0x003e)              /* Port 4 Interrupt Vector Register */
#define OFS_PCIN                                           (0x0040)              /* Port C Input */
#define OFS_PCOUT                                          (0x0042)              /* Port C Output */
#define OFS_PCDIR                                          (0x0044)              /* Port C Direction */
#define OFS_PCREN                                          (0x0046)              /* Port C Resistor Enable */
#define OFS_PCDS                                           (0x0048)              /* Port C Drive Strength */
#define OFS_PCSEL0                                         (0x004a)              /* Port C Select 0 */
#define OFS_PCSEL1                                         (0x004c)              /* Port C Select 1 */
#define OFS_P5IV                                           (0x004e)              /* Port 5 Interrupt Vector Register */
#define OFS_PCSELC                                         (0x0056)              /* Port C Complement Select */
#define OFS_PCIES                                          (0x0058)              /* Port C Interrupt Edge Select */
#define OFS_PCIE                                           (0x005a)              /* Port C Interrupt Enable */
#define OFS_PCIFG                                          (0x005c)              /* Port C Interrupt Flag */
#define OFS_P6IV                                           (0x005e)              /* Port 6 Interrupt Vector Register */
#define OFS_PDIN                                           (0x0060)              /* Port D Input */
#define OFS_PDOUT                                          (0x0062)              /* Port D Output */
#define OFS_PDDIR                                          (0x0064)              /* Port D Direction */
#define OFS_PDREN                                          (0x0066)              /* Port D Resistor Enable */
#define OFS_PDDS                                           (0x0068)              /* Port D Drive Strength */
#define OFS_PDSEL0                                         (0x006a)              /* Port D Select 0 */
#define OFS_PDSEL1                                         (0x006c)              /* Port D Select 1 */
#define OFS_P7IV                                           (0x006e)              /* Port 7 Interrupt Vector Register */
#define OFS_PDSELC                                         (0x0076)              /* Port D Complement Select */
#define OFS_PDIES                                          (0x0078)              /* Port D Interrupt Edge Select */
#define OFS_PDIE                                           (0x007a)              /* Port D Interrupt Enable */
#define OFS_PDIFG                                          (0x007c)              /* Port D Interrupt Flag */
#define OFS_P8IV                                           (0x007e)              /* Port 8 Interrupt Vector Register */
#define OFS_PEIN                                           (0x0080)              /* Port E Input */
#define OFS_PEOUT                                          (0x0082)              /* Port E Output */
#define OFS_PEDIR                                          (0x0084)              /* Port E Direction */
#define OFS_PEREN                                          (0x0086)              /* Port E Resistor Enable */
#define OFS_PEDS                                           (0x0088)              /* Port E Drive Strength */
#define OFS_PESEL0                                         (0x008a)              /* Port E Select 0 */
#define OFS_PESEL1                                         (0x008c)              /* Port E Select 1 */
#define OFS_P9IV                                           (0x008e)              /* Port 9 Interrupt Vector Register */
#define OFS_PESELC                                         (0x0096)              /* Port E Complement Select */
#define OFS_PEIES                                          (0x0098)              /* Port E Interrupt Edge Select */
#define OFS_PEIE                                           (0x009a)              /* Port E Interrupt Enable */
#define OFS_PEIFG                                          (0x009c)              /* Port E Interrupt Flag */
#define OFS_P10IV                                          (0x009e)              /* Port 10 Interrupt Vector Register */
#define OFS_PJIN                                           (0x0120)              /* Port J Input */
#define OFS_PJOUT                                          (0x0122)              /* Port J Output */
#define OFS_PJDIR                                          (0x0124)              /* Port J Direction */
#define OFS_PJREN                                          (0x0126)              /* Port J Resistor Enable */
#define OFS_PJDS                                           (0x0128)              /* Port J Drive Strength */
#define OFS_PJSEL0                                         (0x012a)              /* Port J Select 0 */
#define OFS_PJSEL1                                         (0x012c)              /* Port J Select 1 */
#define OFS_PJSELC                                         (0x0136)              /* Port J Complement Select */
#define OFS_P1IN                                           (0x0000)              /* Port 1 Input */
#define OFS_P2IN                                           (0x0000)              /* Port 2 Input */
#define OFS_P2OUT                                          (0x0002)              /* Port 2 Output */
#define OFS_P1OUT                                          (0x0002)              /* Port 1 Output */
#define OFS_P1DIR                                          (0x0004)              /* Port 1 Direction */
#define OFS_P2DIR                                          (0x0004)              /* Port 2 Direction */
#define OFS_P1REN                                          (0x0006)              /* Port 1 Resistor Enable */
#define OFS_P2REN                                          (0x0006)              /* Port 2 Resistor Enable */
#define OFS_P1DS                                           (0x0008)              /* Port 1 Drive Strength */
#define OFS_P2DS                                           (0x0008)              /* Port 2 Drive Strength */
#define OFS_P1SEL0                                         (0x000a)              /* Port 1 Select 0 */
#define OFS_P2SEL0                                         (0x000a)              /* Port 2 Select 0 */
#define OFS_P1SEL1                                         (0x000c)              /* Port 1 Select 1 */
#define OFS_P2SEL1                                         (0x000c)              /* Port 2 Select 1 */
#define OFS_P1SELC                                         (0x0016)              /* Port 1 Complement Select */
#define OFS_P2SELC                                         (0x0016)              /* Port 2 Complement Select */
#define OFS_P1IES                                          (0x0018)              /* Port 1 Interrupt Edge Select */
#define OFS_P2IES                                          (0x0018)              /* Port 2 Interrupt Edge Select */
#define OFS_P1IE                                           (0x001a)              /* Port 1 Interrupt Enable */
#define OFS_P2IE                                           (0x001a)              /* Port 2 Interrupt Enable */
#define OFS_P1IFG                                          (0x001c)              /* Port 1 Interrupt Flag */
#define OFS_P2IFG                                          (0x001c)              /* Port 2 Interrupt Flag */
#define OFS_P3IN                                           (0x0020)              /* Port 3 Input */
#define OFS_P4IN                                           (0x0020)              /* Port 4 Input */
#define OFS_P3OUT                                          (0x0022)              /* Port 3 Output */
#define OFS_P4OUT                                          (0x0022)              /* Port 4 Output */
#define OFS_P3DIR                                          (0x0024)              /* Port 3 Direction */
#define OFS_P4DIR                                          (0x0024)              /* Port 4 Direction */
#define OFS_P3REN                                          (0x0026)              /* Port 3 Resistor Enable */
#define OFS_P4REN                                          (0x0026)              /* Port 4 Resistor Enable */
#define OFS_P3DS                                           (0x0028)              /* Port 3 Drive Strength */
#define OFS_P4DS                                           (0x0028)              /* Port 4 Drive Strength */
#define OFS_P4SEL0                                         (0x002a)              /* Port 4 Select 0 */
#define OFS_P3SEL0                                         (0x002a)              /* Port 3 Select 0 */
#define OFS_P3SEL1                                         (0x002c)              /* Port 3 Select 1 */
#define OFS_P4SEL1                                         (0x002c)              /* Port 4 Select 1 */
#define OFS_P3SELC                                         (0x0036)              /* Port 3 Complement Select */
#define OFS_P4SELC                                         (0x0036)              /* Port 4 Complement Select */
#define OFS_P3IES                                          (0x0038)              /* Port 3 Interrupt Edge Select */
#define OFS_P4IES                                          (0x0038)              /* Port 4 Interrupt Edge Select */
#define OFS_P3IE                                           (0x003a)              /* Port 3 Interrupt Enable */
#define OFS_P4IE                                           (0x003a)              /* Port 4 Interrupt Enable */
#define OFS_P3IFG                                          (0x003c)              /* Port 3 Interrupt Flag */
#define OFS_P4IFG                                          (0x003c)              /* Port 4 Interrupt Flag */
#define OFS_P5IN                                           (0x0040)              /* Port 5 Input */
#define OFS_P6IN                                           (0x0040)              /* Port 6 Input */
#define OFS_P5OUT                                          (0x0042)              /* Port 5 Output */
#define OFS_P6OUT                                          (0x0042)              /* Port 6 Output */
#define OFS_P5DIR                                          (0x0044)              /* Port 5 Direction */
#define OFS_P6DIR                                          (0x0044)              /* Port 6 Direction */
#define OFS_P5REN                                          (0x0046)              /* Port 5 Resistor Enable */
#define OFS_P6REN                                          (0x0046)              /* Port 6 Resistor Enable */
#define OFS_P5DS                                           (0x0048)              /* Port 5 Drive Strength */
#define OFS_P6DS                                           (0x0048)              /* Port 6 Drive Strength */
#define OFS_P5SEL0                                         (0x004a)              /* Port 5 Select 0 */
#define OFS_P6SEL0                                         (0x004a)              /* Port 6 Select 0 */
#define OFS_P5SEL1                                         (0x004c)              /* Port 5 Select 1 */
#define OFS_P6SEL1                                         (0x004c)              /* Port 6 Select 1 */
#define OFS_P5SELC                                         (0x0056)              /* Port 5 Complement Select */
#define OFS_P6SELC                                         (0x0056)              /* Port 6 Complement Select */
#define OFS_P5IES                                          (0x0058)              /* Port 5 Interrupt Edge Select */
#define OFS_P6IES                                          (0x0058)              /* Port 6 Interrupt Edge Select */
#define OFS_P5IE                                           (0x005a)              /* Port 5 Interrupt Enable */
#define OFS_P6IE                                           (0x005a)              /* Port 6 Interrupt Enable */
#define OFS_P5IFG                                          (0x005c)              /* Port 5 Interrupt Flag */
#define OFS_P6IFG                                          (0x005c)              /* Port 6 Interrupt Flag */
#define OFS_P7IN                                           (0x0060)              /* Port 7 Input */
#define OFS_P8IN                                           (0x0060)              /* Port 8 Input */
#define OFS_P7OUT                                          (0x0062)              /* Port 7 Output */
#define OFS_P8OUT                                          (0x0062)              /* Port 8 Output */
#define OFS_P7DIR                                          (0x0064)              /* Port 7 Direction */
#define OFS_P8DIR                                          (0x0064)              /* Port 8 Direction */
#define OFS_P7REN                                          (0x0066)              /* Port 7 Resistor Enable */
#define OFS_P8REN                                          (0x0066)              /* Port 8 Resistor Enable */
#define OFS_P7DS                                           (0x0068)              /* Port 7 Drive Strength */
#define OFS_P8DS                                           (0x0068)              /* Port 8 Drive Strength */
#define OFS_P7SEL0                                         (0x006a)              /* Port 7 Select 0 */
#define OFS_P8SEL0                                         (0x006a)              /* Port 8 Select 0 */
#define OFS_P7SEL1                                         (0x006c)              /* Port 7 Select 1 */
#define OFS_P8SEL1                                         (0x006c)              /* Port 8 Select 1 */
#define OFS_P7SELC                                         (0x0076)              /* Port 7 Complement Select */
#define OFS_P8SELC                                         (0x0076)              /* Port 8 Complement Select */
#define OFS_P7IES                                          (0x0078)              /* Port 7 Interrupt Edge Select */
#define OFS_P8IES                                          (0x0078)              /* Port 8 Interrupt Edge Select */
#define OFS_P7IE                                           (0x007a)              /* Port 7 Interrupt Enable */
#define OFS_P8IE                                           (0x007a)              /* Port 8 Interrupt Enable */
#define OFS_P7IFG                                          (0x007c)              /* Port 7 Interrupt Flag */
#define OFS_P8IFG                                          (0x007c)              /* Port 8 Interrupt Flag */
#define OFS_P9IN                                           (0x0080)              /* Port 9 Input */
#define OFS_P10IN                                          (0x0080)              /* Port 10 Input */
#define OFS_P9OUT                                          (0x0082)              /* Port 9 Output */
#define OFS_P10OUT                                         (0x0082)              /* Port 10 Output */
#define OFS_P9DIR                                          (0x0084)              /* Port 9 Direction */
#define OFS_P10DIR                                         (0x0084)              /* Port 10 Direction */
#define OFS_P9REN                                          (0x0086)              /* Port 9 Resistor Enable */
#define OFS_P10REN                                         (0x0086)              /* Port 10 Resistor Enable */
#define OFS_P9DS                                           (0x0088)              /* Port 9 Drive Strength */
#define OFS_P10DS                                          (0x0088)              /* Port 10 Drive Strength */
#define OFS_P9SEL0                                         (0x008a)              /* Port 9 Select 0 */
#define OFS_P10SEL0                                        (0x008a)              /* Port 10 Select 0 */
#define OFS_P9SEL1                                         (0x008c)              /* Port 9 Select 1 */
#define OFS_P10SEL1                                        (0x008c)              /* Port 10 Select 1 */
#define OFS_P9SELC                                         (0x0096)              /* Port 9 Complement Select */
#define OFS_P10SELC                                        (0x0096)              /* Port 10 Complement Select */
#define OFS_P9IES                                          (0x0098)              /* Port 9 Interrupt Edge Select */
#define OFS_P10IES                                         (0x0098)              /* Port 10 Interrupt Edge Select */
#define OFS_P9IE                                           (0x009a)              /* Port 9 Interrupt Enable */
#define OFS_P10IE                                          (0x009a)              /* Port 10 Interrupt Enable */
#define OFS_P9IFG                                          (0x009c)              /* Port 9 Interrupt Flag */
#define OFS_P10IFG                                         (0x009c)              /* Port 10 Interrupt Flag */


