arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
#define RTCCTL0_L                                          (HWREG8_L(RTCCTL0))   /* RTCCTL0 Register */
#define RTCCTL0_H                                          (HWREG8_H(RTCCTL0))   /* RTCCTL0 Register */
#define RTCCTL1                                            (HWREG8_L(RTCCTL13))  /* RTCCTL13 Register */
#define RTCCTL13_L                                         (HWREG8_L(RTCCTL13))  /* RTCCTL13 Register */
#define RTCCTL3                                            (HWREG8_H(RTCCTL13))  /* RTCCTL13 Register */
#define RTCCTL13_H                                         (HWREG8_H(RTCCTL13))  /* RTCCTL13 Register */
#define RTCOCAL_L                                          (HWREG8_L(RTCOCAL))   /* RTCOCAL Register */
#define RTCOCAL_H                                          (HWREG8_H(RTCOCAL))   /* RTCOCAL Register */
#define RTCTCMP_L                                          (HWREG8_L(RTCTCMP))   /* RTCTCMP Register */
#define RTCTCMP_H                                          (HWREG8_H(RTCTCMP))   /* RTCTCMP Register */
#define RTCPS0CTL_L                                        (HWREG8_L(RTCPS0CTL)) /* Real-Time Clock Prescale Timer 0 Control Register */
#define RTCPS0CTL_H                                        (HWREG8_H(RTCPS0CTL)) /* Real-Time Clock Prescale Timer 0 Control Register */
#define RTCPS1CTL_L                                        (HWREG8_L(RTCPS1CTL)) /* Real-Time Clock Prescale Timer 1 Control Register */
#define RTCPS1CTL_H                                        (HWREG8_H(RTCPS1CTL)) /* Real-Time Clock Prescale Timer 1 Control Register */
#define RTCPS0                                             (HWREG8_L(RTCPS))     /* Real-Time Clock Prescale Timer Counter Register */
#define RTCPS_L                                            (HWREG8_L(RTCPS))     /* Real-Time Clock Prescale Timer Counter Register */
#define RTCPS1                                             (HWREG8_H(RTCPS))     /* Real-Time Clock Prescale Timer Counter Register */
#define RTCPS_H                                            (HWREG8_H(RTCPS))     /* Real-Time Clock Prescale Timer Counter Register */
#define RTCSEC                                             (HWREG8_L(RTCTIM0))   /* Real-Time Clock Seconds */
#define RTCTIM0_L                                          (HWREG8_L(RTCTIM0))   /* Real-Time Clock Seconds */
#define RTCMIN                                             (HWREG8_H(RTCTIM0))   /* Real-Time Clock Minutes */
#define RTCTIM0_H                                          (HWREG8_H(RTCTIM0))   /* Real-Time Clock Minutes */
#define RTCHOUR                                            (HWREG8_L(RTCTIM1))   /* Real-Time Clock Hour */
#define RTCTIM1_L                                          (HWREG8_L(RTCTIM1))   /* Real-Time Clock Hour */
#define RTCDOW                                             (HWREG8_H(RTCTIM1))   /* Real-Time Clock Day of Week */
#define RTCTIM1_H                                          (HWREG8_H(RTCTIM1))   /* Real-Time Clock Day of Week */
#define RTCDAY                                             (HWREG8_L(RTCDATE))   /* Real-Time Clock Day of Month */
#define RTCDATE_L                                          (HWREG8_L(RTCDATE))   /* Real-Time Clock Day of Month */
#define RTCMON                                             (HWREG8_H(RTCDATE))   /* Real-Time Clock Month */
#define RTCDATE_H                                          (HWREG8_H(RTCDATE))   /* Real-Time Clock Month */
#define RTCAMIN                                            (HWREG8_L(RTCAMINHR)) /* Real-Time Clock Minutes Alarm */
#define RTCAMINHR_L                                        (HWREG8_L(RTCAMINHR)) /* Real-Time Clock Minutes Alarm */
#define RTCAHOUR                                           (HWREG8_H(RTCAMINHR)) /* Real-Time Clock Hours Alarm */
#define RTCAMINHR_H                                        (HWREG8_H(RTCAMINHR)) /* Real-Time Clock Hours Alarm */
#define RTCADOW                                            (HWREG8_L(RTCADOWDAY))/* Real-Time Clock Day of Week Alarm */
#define RTCADOWDAY_L                                       (HWREG8_L(RTCADOWDAY))/* Real-Time Clock Day of Week Alarm */
#define RTCADAY                                            (HWREG8_H(RTCADOWDAY))/* Real-Time Clock Day of Month Alarm */
#define RTCADOWDAY_H                                       (HWREG8_H(RTCADOWDAY))/* Real-Time Clock Day of Month Alarm */

//*****************************************************************************
// SCB Registers
//*****************************************************************************
#define SCB_CPUID                                          (HWREG32(0xE000ED00)) /* CPUID Base Register */
#define SCB_ICSR                                           (HWREG32(0xE000ED04)) /* Interrupt Control State Register */
#define SCB_VTOR                                           (HWREG32(0xE000ED08)) /* Vector Table Offset Register */
#define SCB_AIRCR                                          (HWREG32(0xE000ED0C)) /* Application Interrupt/Reset Control Register */
#define SCB_SCR                                            (HWREG32(0xE000ED10)) /* System Control Register */
#define SCB_CCR                                            (HWREG32(0xE000ED14)) /* Configuration Control Register */
#define SCB_SHPR1                                          (HWREG32(0xE000ED18)) /* System Handlers 4-7 Priority Register */
#define SCB_SHPR2                                          (HWREG32(0xE000ED1C)) /* System Handlers 8-11 Priority Register */
#define SCB_SHPR3                                          (HWREG32(0xE000ED20)) /* System Handlers 12-15 Priority Register */
#define SCB_SHCSR                                          (HWREG32(0xE000ED24)) /* System Handler Control and State Register */
#define SCB_CFSR                                           (HWREG32(0xE000ED28)) /* Configurable Fault Status Registers */
#define SCB_HFSR                                           (HWREG32(0xE000ED2C)) /* Hard Fault Status Register */
#define SCB_DFSR                                           (HWREG32(0xE000ED30)) /* Debug Fault Status Register */
#define SCB_MMFAR                                          (HWREG32(0xE000ED34)) /* Mem Manage Fault Address Register */
#define SCB_BFAR                                           (HWREG32(0xE000ED38)) /* Bus Fault Address Register */
#define SCB_AFSR                                           (HWREG32(0xE000ED3C)) /* Auxiliary Fault Status Register */
#define SCB_PFR0                                           (HWREG32(0xE000ED40)) /* Processor Feature register0 */
#define SCB_PFR1                                           (HWREG32(0xE000ED44)) /* Processor Feature register1 */
#define SCB_DFR0                                           (HWREG32(0xE000ED48)) /* Debug Feature register0 */
#define SCB_AFR0                                           (HWREG32(0xE000ED4C)) /* Auxiliary Feature register0 */
#define SCB_MMFR0                                          (HWREG32(0xE000ED50)) /* Memory Model Feature register0 */
#define SCB_MMFR1                                          (HWREG32(0xE000ED54)) /* Memory Model Feature register1 */
#define SCB_MMFR2                                          (HWREG32(0xE000ED58)) /* Memory Model Feature register2 */
#define SCB_MMFR3                                          (HWREG32(0xE000ED5C)) /* Memory Model Feature register3 */
#define SCB_ISAR0                                          (HWREG32(0xE000ED60)) /* ISA Feature register0 */
#define SCB_ISAR1                                          (HWREG32(0xE000ED64)) /* ISA Feature register1 */
#define SCB_ISAR2                                          (HWREG32(0xE000ED68)) /* ISA Feature register2 */
#define SCB_ISAR3                                          (HWREG32(0xE000ED6C)) /* ISA Feature register3 */
#define SCB_ISAR4                                          (HWREG32(0xE000ED70)) /* ISA Feature register4 */
#define SCB_CPACR                                          (HWREG32(0xE000ED88)) /* Coprocessor Access Control Register */

/* Register offsets from SCB_BASE address */
#define OFS_SCB_CPUID                                      (0x00000D00)          /* CPUID Base Register */
#define OFS_SCB_ICSR                                       (0x00000D04)          /* Interrupt Control State Register */
#define OFS_SCB_VTOR                                       (0x00000D08)          /* Vector Table Offset Register */
#define OFS_SCB_AIRCR                                      (0x00000D0C)          /* Application Interrupt/Reset Control Register */
#define OFS_SCB_SCR                                        (0x00000D10)          /* System Control Register */
#define OFS_SCB_CCR                                        (0x00000D14)          /* Configuration Control Register */
#define OFS_SCB_SHPR1                                      (0x00000D18)          /* System Handlers 4-7 Priority Register */
#define OFS_SCB_SHPR2                                      (0x00000D1C)          /* System Handlers 8-11 Priority Register */
#define OFS_SCB_SHPR3                                      (0x00000D20)          /* System Handlers 12-15 Priority Register */
#define OFS_SCB_SHCSR                                      (0x00000D24)          /* System Handler Control and State Register */
#define OFS_SCB_CFSR                                       (0x00000D28)          /* Configurable Fault Status Registers */
#define OFS_SCB_HFSR                                       (0x00000D2C)          /* Hard Fault Status Register */
#define OFS_SCB_DFSR                                       (0x00000D30)          /* Debug Fault Status Register */
#define OFS_SCB_MMFAR                                      (0x00000D34)          /* Mem Manage Fault Address Register */
#define OFS_SCB_BFAR                                       (0x00000D38)          /* Bus Fault Address Register */
#define OFS_SCB_AFSR                                       (0x00000D3C)          /* Auxiliary Fault Status Register */
#define OFS_SCB_PFR0                                       (0x00000D40)          /* Processor Feature register0 */
#define OFS_SCB_PFR1                                       (0x00000D44)          /* Processor Feature register1 */
#define OFS_SCB_DFR0                                       (0x00000D48)          /* Debug Feature register0 */
#define OFS_SCB_AFR0                                       (0x00000D4C)          /* Auxiliary Feature register0 */
#define OFS_SCB_MMFR0                                      (0x00000D50)          /* Memory Model Feature register0 */
#define OFS_SCB_MMFR1                                      (0x00000D54)          /* Memory Model Feature register1 */
#define OFS_SCB_MMFR2                                      (0x00000D58)          /* Memory Model Feature register2 */
#define OFS_SCB_MMFR3                                      (0x00000D5C)          /* Memory Model Feature register3 */
#define OFS_SCB_ISAR0                                      (0x00000D60)          /* ISA Feature register0 */
#define OFS_SCB_ISAR1                                      (0x00000D64)          /* ISA Feature register1 */
#define OFS_SCB_ISAR2                                      (0x00000D68)          /* ISA Feature register2 */
#define OFS_SCB_ISAR3                                      (0x00000D6C)          /* ISA Feature register3 */
#define OFS_SCB_ISAR4                                      (0x00000D70)          /* ISA Feature register4 */
#define OFS_SCB_CPACR                                      (0x00000D88)          /* Coprocessor Access Control Register */


//*****************************************************************************
// SCnSCB Registers
//*****************************************************************************
#define SCnSCB_ICTR                                        (HWREG32(0xE000E004)) /* Interrupt Control Type Register */
#define SCnSCB_ACTLR                                       (HWREG32(0xE000E008)) /* Auxiliary Control Register */

/* Register offsets from SCnSCB_BASE address */
#define OFS_SCnSCB_ICTR                                    (0x00000004)          /* Interrupt Control Type Register */
#define OFS_SCnSCB_ACTLR                                   (0x00000008)          /* Auxiliary Control Register */


//*****************************************************************************
// SYSCTL Registers
//*****************************************************************************
#define SYSCTL_REBOOT_CTL                                  (HWREG32(0xE0043000)) /* Reboot Control Register */
#define SYSCTL_NMI_CTLSTAT                                 (HWREG32(0xE0043004)) /* NMI Control and Status Register */
#define SYSCTL_WDTRESET_CTL                                (HWREG32(0xE0043008)) /* Watchdog Reset Control Register */
#define SYSCTL_PERIHALT_CTL                                (HWREG32(0xE004300C)) /* Peripheral Halt Control Register */
#define SYSCTL_SRAM_SIZE                                   (HWREG32(0xE0043010)) /* SRAM Size Register */
#define SYSCTL_SRAM_BANKEN                                 (HWREG32(0xE0043014)) /* SRAM Bank Enable Register */
#define SYSCTL_SRAM_BANKRET                                (HWREG32(0xE0043018)) /* SRAM Bank Retention Control Register */
#define SYSCTL_FLASH_SIZE                                  (HWREG32(0xE0043020)) /* Flash Size Register */
#define SYSCTL_DIO_GLTFLT_CTL                              (HWREG32(0xE0043030)) /* Digital I/O Glitch Filter Control Register */
#define SYSCTL_SECDATA_UNLOCK                              (HWREG32(0xE0043040)) /* IP Protected Secure Zone Data Access Unlock Register */
#define SYSCTL_MASTER_UNLOCK                               (HWREG32(0xE0044000)) /* Master Unlock Register */
#define SYSCTL_BOOTOVER_REQ0                               (HWREG32(0xE0044004)) /* Boot Override Request Register */
#define SYSCTL_BOOTOVER_REQ1                               (HWREG32(0xE0044008)) /* Boot Override Request Register */
#define SYSCTL_BOOTOVER_ACK                                (HWREG32(0xE004400C)) /* Boot Override Acknowledge Register */
#define SYSCTL_RESET_REQ                                   (HWREG32(0xE0044010)) /* Reset Request Register */
#define SYSCTL_RESET_STATOVER                              (HWREG32(0xE0044014)) /* Reset Status and Override Register */
#define SYSCTL_SYSTEM_STAT                                 (HWREG32(0xE0044020)) /* System Status Register */

/* Register offsets from SYSCTL_BASE address */
#define OFS_SYSCTL_REBOOT_CTL                              (0x00000000)          /* Reboot Control Register */
#define OFS_SYSCTL_NMI_CTLSTAT                             (0x00000004)          /* NMI Control and Status Register */
#define OFS_SYSCTL_WDTRESET_CTL                            (0x00000008)          /* Watchdog Reset Control Register */
#define OFS_SYSCTL_PERIHALT_CTL                            (0x0000000c)          /* Peripheral Halt Control Register */
#define OFS_SYSCTL_SRAM_SIZE                               (0x00000010)          /* SRAM Size Register */
#define OFS_SYSCTL_SRAM_BANKEN                             (0x00000014)          /* SRAM Bank Enable Register */
#define OFS_SYSCTL_SRAM_BANKRET                            (0x00000018)          /* SRAM Bank Retention Control Register */
#define OFS_SYSCTL_FLASH_SIZE                              (0x00000020)          /* Flash Size Register */
#define OFS_SYSCTL_DIO_GLTFLT_CTL                          (0x00000030)          /* Digital I/O Glitch Filter Control Register */
#define OFS_SYSCTL_SECDATA_UNLOCK                          (0x00000040)          /* IP Protected Secure Zone Data Access Unlock Register */
#define OFS_SYSCTL_MASTER_UNLOCK                           (0x00001000)          /* Master Unlock Register */
#define OFS_SYSCTL_BOOTOVER_REQ0                           (0x00001004)          /* Boot Override Request Register */
#define OFS_SYSCTL_BOOTOVER_REQ1                           (0x00001008)          /* Boot Override Request Register */
#define OFS_SYSCTL_BOOTOVER_ACK                            (0x0000100c)          /* Boot Override Acknowledge Register */
#define OFS_SYSCTL_RESET_REQ                               (0x00001010)          /* Reset Request Register */
#define OFS_SYSCTL_RESET_STATOVER                          (0x00001014)          /* Reset Status and Override Register */
#define OFS_SYSCTL_SYSTEM_STAT                             (0x00001020)          /* System Status Register */


//*****************************************************************************
// SYSTICK Registers
//*****************************************************************************
#define SYSTICK_STCSR                                      (HWREG32(0xE000E010)) /* SysTick Control and Status Register */
#define SYSTICK_STRVR                                      (HWREG32(0xE000E014)) /* SysTick Reload Value Register */
#define SYSTICK_STCVR                                      (HWREG32(0xE000E018)) /* SysTick Current Value Register */
#define SYSTICK_STCR                                       (HWREG32(0xE000E01C)) /* SysTick Calibration Value Register */

