arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL25;
  union {    /* ADC14MCTL26 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL26 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL26;
  union {    /* ADC14MCTL27 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL27 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL27;
  union {    /* ADC14MCTL28 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL28 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL28;
  union {    /* ADC14MCTL29 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL29 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL29;
  union {    /* ADC14MCTL30 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL30 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL30;
  union {    /* ADC14MCTL31 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL31 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL31;
  union {    /* ADC14MEM0 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM0 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM0;
  union {    /* ADC14MEM1 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM1 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM1;
  union {    /* ADC14MEM2 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM2 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM2;
  union {    /* ADC14MEM3 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM3 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM3;
  union {    /* ADC14MEM4 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM4 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM4;
  union {    /* ADC14MEM5 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM5 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM5;
  union {    /* ADC14MEM6 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM6 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM6;
  union {    /* ADC14MEM7 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM7 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM7;
  union {    /* ADC14MEM8 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM8 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM8;
  union {    /* ADC14MEM9 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM9 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM9;
  union {    /* ADC14MEM10 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM10 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM10;
  union {    /* ADC14MEM11 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM11 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM11;
  union {    /* ADC14MEM12 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM12 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM12;
  union {    /* ADC14MEM13 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM13 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM13;
  union {    /* ADC14MEM14 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM14 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM14;
  union {    /* ADC14MEM15 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM15 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM15;
  union {    /* ADC14MEM16 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM16 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM16;
  union {    /* ADC14MEM17 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM17 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM17;
  union {    /* ADC14MEM18 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM18 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM18;
  union {    /* ADC14MEM19 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM19 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM19;
  union {    /* ADC14MEM20 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM20 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM20;
  union {    /* ADC14MEM21 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM21 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM21;
  union {    /* ADC14MEM22 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM22 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM22;
  union {    /* ADC14MEM23 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM23 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM23;
  union {    /* ADC14MEM24 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM24 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM24;
  union {    /* ADC14MEM25 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM25 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM25;
  union {    /* ADC14MEM26 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM26 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM26;
  union {    /* ADC14MEM27 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM27 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM27;
  union {    /* ADC14MEM28 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM28 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM28;
  union {    /* ADC14MEM29 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM29 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM29;
  union {    /* ADC14MEM30 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM30 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM30;
  union {    /* ADC14MEM31 Register */
    __IO uint32_t r;
    struct { /* ADC14MEM31 Bits */
      __IO uint32_t bCONVRES            	:	16;  /* Conversion Result */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMEM31;
  uint8_t  RESERVED0[36];
  union {    /* ADC14IER0 Register */
    __IO uint32_t r;
    struct { /* ADC14IER0 Bits */
      __IO uint32_t bIE0                	:	1;  /* Interrupt enable */
      __IO uint32_t bIE1                	:	1;  /* Interrupt enable */
      __IO uint32_t bIE2                	:	1;  /* Interrupt enable */
      __IO uint32_t bIE3                	:	1;  /* Interrupt enable */
      __IO uint32_t bIE4                	:	1;  /* Interrupt enable */
      __IO uint32_t bIE5                	:	1;  /* Interrupt enable */
      __IO uint32_t bIE6                	:	1;  /* Interrupt enable */
      __IO uint32_t bIE7                	:	1;  /* Interrupt enable */
      __IO uint32_t bIE8                	:	1;  /* Interrupt enable */
      __IO uint32_t bIE9                	:	1;  /* Interrupt enable */
      __IO uint32_t bIE10               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE11               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE12               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE13               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE14               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE15               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE16               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE17               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE18               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE19               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE20               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE21               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE22               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE23               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE24               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE25               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE26               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE27               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE28               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE29               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE30               	:	1;  /* Interrupt enable */
      __IO uint32_t bIE31               	:	1;  /* Interrupt enable */
    } b;
  } rIER0;
  union {    /* ADC14IER1 Register */
    __IO uint32_t r;
    struct { /* ADC14IER1 Bits */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint32_t bINIE               	:	1;  /* Interrupt enable for ADC14MEMx within comparator window */
      __IO uint32_t bLOIE               	:	1;  /* Interrupt enable for ADC14MEMx below comparator window */
      __IO uint32_t bHIIE               	:	1;  /* Interrupt enable for ADC14MEMx above comparator window */
      __IO uint32_t bOVIE               	:	1;  /* ADC14MEMx overflow-interrupt enable */
      __IO uint32_t bTOVIE              	:	1;  /* ADC14 conversion-time-overflow interrupt enable */
      __IO uint32_t bRDYIE              	:	1;  /* ADC14 local buffered reference ready interrupt enable */
      __I  uint32_t bRESERVED1          	:	25;  /* Reserved */
    } b;
  } rIER1;
  union {    /* ADC14IFGR0 Register */
    __I uint32_t r;
    struct { /* ADC14IFGR0 Bits */
      __I  uint32_t bIFG0               	:	1;  /* ADC14MEM0 interrupt flag */
      __I  uint32_t bIFG1               	:	1;  /* ADC14MEM1 interrupt flag */
      __I  uint32_t bIFG2               	:	1;  /* ADC14MEM2 interrupt flag */
      __I  uint32_t bIFG3               	:	1;  /* ADC14MEM3 interrupt flag */
      __I  uint32_t bIFG4               	:	1;  /* ADC14MEM4 interrupt flag */
      __I  uint32_t bIFG5               	:	1;  /* ADC14MEM5 interrupt flag */
      __I  uint32_t bIFG6               	:	1;  /* ADC14MEM6 interrupt flag */
      __I  uint32_t bIFG7               	:	1;  /* ADC14MEM7 interrupt flag */
      __I  uint32_t bIFG8               	:	1;  /* ADC14MEM8 interrupt flag */
      __I  uint32_t bIFG9               	:	1;  /* ADC14MEM9 interrupt flag */
      __I  uint32_t bIFG10              	:	1;  /* ADC14MEM10 interrupt flag */
      __I  uint32_t bIFG11              	:	1;  /* ADC14MEM11 interrupt flag */
      __I  uint32_t bIFG12              	:	1;  /* ADC14MEM12 interrupt flag */
      __I  uint32_t bIFG13              	:	1;  /* ADC14MEM13 interrupt flag */
      __I  uint32_t bIFG14              	:	1;  /* ADC14MEM14 interrupt flag */
      __I  uint32_t bIFG15              	:	1;  /* ADC14MEM15 interrupt flag */
      __I  uint32_t bIFG16              	:	1;  /* ADC14MEM16 interrupt flag */
      __I  uint32_t bIFG17              	:	1;  /* ADC14MEM17 interrupt flag */
      __I  uint32_t bIFG18              	:	1;  /* ADC14MEM18 interrupt flag */
      __I  uint32_t bIFG19              	:	1;  /* ADC14MEM19 interrupt flag */
      __I  uint32_t bIFG20              	:	1;  /* ADC14MEM20 interrupt flag */
      __I  uint32_t bIFG21              	:	1;  /* ADC14MEM21 interrupt flag */
      __I  uint32_t bIFG22              	:	1;  /* ADC14MEM22 interrupt flag */
      __I  uint32_t bIFG23              	:	1;  /* ADC14MEM23 interrupt flag */
      __I  uint32_t bIFG24              	:	1;  /* ADC14MEM24 interrupt flag */
      __I  uint32_t bIFG25              	:	1;  /* ADC14MEM25 interrupt flag */
      __I  uint32_t bIFG26              	:	1;  /* ADC14MEM26 interrupt flag */
      __I  uint32_t bIFG27              	:	1;  /* ADC14MEM27 interrupt flag */
      __I  uint32_t bIFG28              	:	1;  /* ADC14MEM28 interrupt flag */
      __I  uint32_t bIFG29              	:	1;  /* ADC14MEM29 interrupt flag */
      __I  uint32_t bIFG30              	:	1;  /* ADC14MEM30 interrupt flag */
      __I  uint32_t bIFG31              	:	1;  /* ADC14MEM31 interrupt flag */
    } b;
  } rIFGR0;
  union {    /* ADC14IFGR1 Register */
    __I uint32_t r;
    struct { /* ADC14IFGR1 Bits */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __I  uint32_t bINIFG              	:	1;  /* Interrupt flag for ADC14MEMx within comparator window */
      __I  uint32_t bLOIFG              	:	1;  /* Interrupt flag for ADC14MEMx below comparator window */
      __I  uint32_t bHIIFG              	:	1;  /* Interrupt flag for ADC14MEMx above comparator window */
      __I  uint32_t bOVIFG              	:	1;  /* ADC14MEMx overflow interrupt flag */
      __I  uint32_t bTOVIFG             	:	1;  /* ADC14 conversion time overflow interrupt flag */
      __I  uint32_t bRDYIFG             	:	1;  /* ADC14 local buffered reference ready interrupt flag */
      __I  uint32_t bRESERVED1          	:	25;  /* Reserved */
    } b;
  } rIFGR1;
  union {    /* ADC14CLRIFGR0 Register */
    __O uint32_t r;
    struct { /* ADC14CLRIFGR0 Bits */
      __O  uint32_t bCLRIFG0            	:	1;  /* clear ADC14IFG0 */
      __O  uint32_t bCLRIFG1            	:	1;  /* clear ADC14IFG1 */
      __O  uint32_t bCLRIFG2            	:	1;  /* clear ADC14IFG2 */
      __O  uint32_t bCLRIFG3            	:	1;  /* clear ADC14IFG3 */
      __O  uint32_t bCLRIFG4            	:	1;  /* clear ADC14IFG4 */
      __O  uint32_t bCLRIFG5            	:	1;  /* clear ADC14IFG5 */
      __O  uint32_t bCLRIFG6            	:	1;  /* clear ADC14IFG6 */
      __O  uint32_t bCLRIFG7            	:	1;  /* clear ADC14IFG7 */
      __O  uint32_t bCLRIFG8            	:	1;  /* clear ADC14IFG8 */
      __O  uint32_t bCLRIFG9            	:	1;  /* clear ADC14IFG9 */
      __O  uint32_t bCLRIFG10           	:	1;  /* clear ADC14IFG10 */
      __O  uint32_t bCLRIFG11           	:	1;  /* clear ADC14IFG11 */
      __O  uint32_t bCLRIFG12           	:	1;  /* clear ADC14IFG12 */
      __O  uint32_t bCLRIFG13           	:	1;  /* clear ADC14IFG13 */
      __O  uint32_t bCLRIFG14           	:	1;  /* clear ADC14IFG14 */
      __O  uint32_t bCLRIFG15           	:	1;  /* clear ADC14IFG15 */
      __O  uint32_t bCLRIFG16           	:	1;  /* clear ADC14IFG16 */
      __O  uint32_t bCLRIFG17           	:	1;  /* clear ADC14IFG17 */
      __O  uint32_t bCLRIFG18           	:	1;  /* clear ADC14IFG18 */
      __O  uint32_t bCLRIFG19           	:	1;  /* clear ADC14IFG19 */
      __O  uint32_t bCLRIFG20           	:	1;  /* clear ADC14IFG20 */
      __O  uint32_t bCLRIFG21           	:	1;  /* clear ADC14IFG21 */
      __O  uint32_t bCLRIFG22           	:	1;  /* clear ADC14IFG22 */
      __O  uint32_t bCLRIFG23           	:	1;  /* clear ADC14IFG23 */
      __O  uint32_t bCLRIFG24           	:	1;  /* clear ADC14IFG24 */
      __O  uint32_t bCLRIFG25           	:	1;  /* clear ADC14IFG25 */
      __O  uint32_t bCLRIFG26           	:	1;  /* clear ADC14IFG26 */
      __O  uint32_t bCLRIFG27           	:	1;  /* clear ADC14IFG27 */
      __O  uint32_t bCLRIFG28           	:	1;  /* clear ADC14IFG28 */
      __O  uint32_t bCLRIFG29           	:	1;  /* clear ADC14IFG29 */
      __O  uint32_t bCLRIFG30           	:	1;  /* clear ADC14IFG30 */
      __O  uint32_t bCLRIFG31           	:	1;  /* clear ADC14IFG31 */
    } b;
  } rCLRIFGR0;
  union {    /* ADC14CLRIFGR1 Register */
    __IO uint32_t r;
    struct { /* ADC14CLRIFGR1 Bits */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __O  uint32_t bCLRINIFG           	:	1;  /* clear ADC14INIFG */
      __O  uint32_t bCLRLOIFG           	:	1;  /* clear ADC14LOIFG */
      __O  uint32_t bCLRHIIFG           	:	1;  /* clear ADC14HIIFG */
      __O  uint32_t bCLROVIFG           	:	1;  /* clear ADC14OVIFG */
      __O  uint32_t bCLRTOVIFG          	:	1;  /* clear ADC14TOVIFG */
      __O  uint32_t bCLRRDYIFG          	:	1;  /* clear ADC14RDYIFG */
      __I  uint32_t bRESERVED1          	:	25;  /* Reserved */
    } b;
  } rCLRIFGR1;
  __IO uint32_t rIV; /* Interrupt Vector Register */
} ADC14_Type;


