arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// AES256 Registers
//*****************************************************************************
typedef struct {
  union {    /* AESACTL0 Register */
    __IO uint16_t r;
    struct { /* AESACTL0 Bits */
      __IO uint16_t bOP                 	:	2;  /* AES operation */
      __IO uint16_t bKL                 	:	2;  /* AES key length */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bCM                 	:	2;  /* AES cipher mode select */
      __IO uint16_t bSWRST              	:	1;  /* AES software reset */
      __IO uint16_t bRDYIFG             	:	1;  /* AES ready interrupt flag */
      __I  uint16_t bRESERVED1          	:	2;  /* Reserved */
      __IO uint16_t bERRFG              	:	1;  /* AES error flag */
      __IO uint16_t bRDYIE              	:	1;  /* AES ready interrupt enable */
      __I  uint16_t bRESERVED2          	:	2;  /* Reserved */
      __IO uint16_t bCMEN               	:	1;  /* AES cipher mode enable */
    } b;
  } rCTL0;
  union {    /* AESACTL1 Register */
    __IO uint16_t r;
    struct { /* AESACTL1 Bits */
      __IO uint16_t bBLKCNT             	:	8;  /* Cipher Block Counter */
      __I  uint16_t bRESERVED0          	:	8;  /* Reserved */
    } b;
  } rCTL1;
  union {    /* AESASTAT Register */
    __IO uint16_t r;
    struct { /* AESASTAT Bits */
      __IO uint16_t bBUSY               	:	1;  /* AES accelerator module busy */
      __IO uint16_t bKEYWR              	:	1;  /* All 16 bytes written to AESAKEY */
      __IO uint16_t bDINWR              	:	1;  /* All 16 bytes written to AESADIN, AESAXDIN or AESAXIN */
      __I  uint16_t bDOUTRD             	:	1;  /* All 16 bytes read from AESADOUT */
      __I  uint16_t bKEYCNT             	:	4;  /* Bytes written via AESAKEY for AESKLx=00, half-words written via AESAKEY */
      __I  uint16_t bDINCNT             	:	4;  /* Bytes written via AESADIN, AESAXDIN or AESAXIN */
      __I  uint16_t bDOUTCNT            	:	4;  /* Bytes read via AESADOUT */
    } b;
  } rSTAT;
  union {    /* AESAKEY Register */
    __O uint16_t r;
    struct { /* AESAKEY Bits */
      __O  uint16_t bKEY0               	:	8;  /* AES key byte n when AESAKEY is written as half-word */
      __O  uint16_t bKEY1               	:	8;  /* AES key byte n+1 when AESAKEY is written as half-word */
    } b;
  } rKEY;
  union {    /* AESADIN Register */
    __O uint16_t r;
    struct { /* AESADIN Bits */
      __O  uint16_t bDIN0               	:	8;  /* AES data in byte n when AESADIN is written as half-word */
      __O  uint16_t bDIN1               	:	8;  /* AES data in byte n+1 when AESADIN is written as half-word */
    } b;
  } rDIN;
  union {    /* AESADOUT Register */
    __O uint16_t r;
    struct { /* AESADOUT Bits */
      __O  uint16_t bDOUT0              	:	8;  /* AES data out byte n when AESADOUT is read as half-word */
      __O  uint16_t bDOUT1              	:	8;  /* AES data out byte n+1 when AESADOUT is read as half-word */
    } b;
  } rDOUT;
  union {    /* AESAXDIN Register */
    __O uint16_t r;
    struct { /* AESAXDIN Bits */
      __O  uint16_t bXDIN0              	:	8;  /* AES data in byte n when AESAXDIN is written as half-word */
      __O  uint16_t bXDIN1              	:	8;  /* AES data in byte n+1 when AESAXDIN is written as half-word */
    } b;
  } rXDIN;
  union {    /* AESAXIN Register */
    __O uint16_t r;
    struct { /* AESAXIN Bits */
      __O  uint16_t bXIN0               	:	8;  /* AES data in byte n when AESAXIN is written as half-word */
      __O  uint16_t bXIN1               	:	8;  /* AES data in byte n+1 when AESAXIN is written as half-word */
    } b;
  } rXIN;
} AES256_Type;


//*****************************************************************************
// CAPTIO0 Registers
//*****************************************************************************
typedef struct {
  uint8_t  RESERVED0[14];
  union {    /* CAPTIO0CTL Register */
    __IO uint16_t r;
    struct { /* CAPTIO0CTL Bits */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bPISEL              	:	3;  /* Capacitive Touch IO pin select */
      __IO uint16_t bPOSEL              	:	4;  /* Capacitive Touch IO port select */
      __IO uint16_t bEN                 	:	1;  /* Capacitive Touch IO enable */
      __I  uint16_t bSTATE              	:	1;  /* Capacitive Touch IO state */
      __I  uint16_t bRESERVED1          	:	6;  /* Reserved */
    } b;
  } rCTL;
} CAPTIO0_Type;


//*****************************************************************************
// CAPTIO1 Registers
//*****************************************************************************
typedef struct {
  uint8_t  RESERVED0[14];
  union {    /* CAPTIO1CTL Register */
    __IO uint16_t r;
    struct { /* CAPTIO1CTL Bits */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bPISEL              	:	3;  /* Capacitive Touch IO pin select */
      __IO uint16_t bPOSEL              	:	4;  /* Capacitive Touch IO port select */
      __IO uint16_t bEN                 	:	1;  /* Capacitive Touch IO enable */
      __I  uint16_t bSTATE              	:	1;  /* Capacitive Touch IO state */
      __I  uint16_t bRESERVED1          	:	6;  /* Reserved */
    } b;
  } rCTL;
} CAPTIO1_Type;


//*****************************************************************************
// COMP_E0 Registers
//*****************************************************************************
typedef struct {
  union {    /* CE0CTL0 Register */
    __IO uint16_t r;
    struct { /* CE0CTL0 Bits */
      __IO uint16_t bIPSEL              	:	4;  /* Channel input selected for the V+ terminal */
      __I  uint16_t bRESERVED0          	:	3;  /* Reserved */
      __IO uint16_t bIPEN               	:	1;  /* Channel input enable for the V+ terminal */
      __IO uint16_t bIMSEL              	:	4;  /* Channel input selected for the - terminal */
      __I  uint16_t bRESERVED1          	:	3;  /* Reserved */
      __IO uint16_t bIMEN               	:	1;  /* Channel input enable for the - terminal */
    } b;
  } rCTL0;
  union {    /* CE0CTL1 Register */
    __IO uint16_t r;
    struct { /* CE0CTL1 Bits */
      __IO uint16_t bOUT                	:	1;  /* Comparator output value */
      __IO uint16_t bOUTPOL             	:	1;  /* Comparator output polarity */
      __IO uint16_t bF                  	:	1;  /* Comparator output filter */
      __IO uint16_t bIES                	:	1;  /* Interrupt edge select for CEIIFG and CEIFG */
      __IO uint16_t bSHORT              	:	1;  /* Input short */
      __IO uint16_t bEX                 	:	1;  /* Exchange */
      __IO uint16_t bFDLY               	:	2;  /* Filter delay */
      __IO uint16_t bPWRMD              	:	2;  /* Power Mode */
      __IO uint16_t bON                 	:	1;  /* Comparator On */
      __IO uint16_t bMRVL               	:	1;  /* This bit is valid of CEMRVS is set to 1 */
      __IO uint16_t bMRVS               	:	1;  /*  */
      __I  uint16_t bRESERVED0          	:	3;  /* Reserved */
    } b;
  } rCTL1;
  union {    /* CE0CTL2 Register */
    __IO uint16_t r;
    struct { /* CE0CTL2 Bits */
      __IO uint16_t bREF0               	:	5;  /* Reference resistor tap 0 */
      __IO uint16_t bRSEL               	:	1;  /* Reference select */
      __IO uint16_t bRS                 	:	2;  /* Reference source */
      __IO uint16_t bREF1               	:	5;  /* Reference resistor tap 1 */
      __IO uint16_t bREFL               	:	2;  /* Reference voltage level */
      __IO uint16_t bREFACC             	:	1;  /* Reference accuracy */
    } b;
  } rCTL2;
  union {    /* CE0CTL3 Register */
    __IO uint16_t r;
    struct { /* CE0CTL3 Bits */
      __IO uint16_t bPD0                	:	1;  /* Port disable */
      __IO uint16_t bPD1                	:	1;  /* Port disable */
      __IO uint16_t bPD2                	:	1;  /* Port disable */
      __IO uint16_t bPD3                	:	1;  /* Port disable */
      __IO uint16_t bPD4                	:	1;  /* Port disable */
      __IO uint16_t bPD5                	:	1;  /* Port disable */
      __IO uint16_t bPD6                	:	1;  /* Port disable */
      __IO uint16_t bPD7                	:	1;  /* Port disable */
      __IO uint16_t bPD8                	:	1;  /* Port disable */
      __IO uint16_t bPD9                	:	1;  /* Port disable */
      __IO uint16_t bPD10               	:	1;  /* Port disable */
      __IO uint16_t bPD11               	:	1;  /* Port disable */
      __IO uint16_t bPD12               	:	1;  /* Port disable */
      __IO uint16_t bPD13               	:	1;  /* Port disable */
      __IO uint16_t bPD14               	:	1;  /* Port disable */
      __IO uint16_t bPD15               	:	1;  /* Port disable */
    } b;
  } rCTL3;
  uint8_t  RESERVED0[4];
  union {    /* CE0INT Register */
    __IO uint16_t r;
    struct { /* CE0INT Bits */
      __IO uint16_t bIFG                	:	1;  /* Comparator output interrupt flag */
      __IO uint16_t bIIFG               	:	1;  /* Comparator output inverted interrupt flag */
      __I  uint16_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint16_t bRDYIFG             	:	1;  /* Comparator ready interrupt flag */
      __I  uint16_t bRESERVED1          	:	3;  /* Reserved */
      __IO uint16_t bIE                 	:	1;  /* Comparator output interrupt enable */
      __IO uint16_t bIIE                	:	1;  /* Comparator output interrupt enable inverted polarity */
      __I  uint16_t bRESERVED2          	:	2;  /* Reserved */
      __IO uint16_t bRDYIE              	:	1;  /* Comparator ready interrupt enable */
      __I  uint16_t bRESERVED3          	:	3;  /* Reserved */
    } b;
  } rINT;
  __I uint16_t rIV; /* Comparator Interrupt Vector Word Register */
} COMP_E0_Type;


//*****************************************************************************
// COMP_E1 Registers
//*****************************************************************************
typedef struct {
  union {    /* CE1CTL0 Register */
    __IO uint16_t r;
    struct { /* CE1CTL0 Bits */
      __IO uint16_t bIPSEL              	:	4;  /* Channel input selected for the V+ terminal */
      __I  uint16_t bRESERVED0          	:	3;  /* Reserved */
      __IO uint16_t bIPEN               	:	1;  /* Channel input enable for the V+ terminal */
      __IO uint16_t bIMSEL              	:	4;  /* Channel input selected for the - terminal */
      __I  uint16_t bRESERVED1          	:	3;  /* Reserved */
      __IO uint16_t bIMEN               	:	1;  /* Channel input enable for the - terminal */
    } b;
  } rCTL0;
  union {    /* CE1CTL1 Register */
    __IO uint16_t r;
    struct { /* CE1CTL1 Bits */
      __IO uint16_t bOUT                	:	1;  /* Comparator output value */
      __IO uint16_t bOUTPOL             	:	1;  /* Comparator output polarity */
      __IO uint16_t bF                  	:	1;  /* Comparator output filter */
      __IO uint16_t bIES                	:	1;  /* Interrupt edge select for CEIIFG and CEIFG */
      __IO uint16_t bSHORT              	:	1;  /* Input short */
      __IO uint16_t bEX                 	:	1;  /* Exchange */
      __IO uint16_t bFDLY               	:	2;  /* Filter delay */
      __IO uint16_t bPWRMD              	:	2;  /* Power Mode */
      __IO uint16_t bON                 	:	1;  /* Comparator On */
      __IO uint16_t bMRVL               	:	1;  /* This bit is valid of CEMRVS is set to 1 */
      __IO uint16_t bMRVS               	:	1;  /*  */
      __I  uint16_t bRESERVED0          	:	3;  /* Reserved */
    } b;
  } rCTL1;
  union {    /* CE1CTL2 Register */
    __IO uint16_t r;
    struct { /* CE1CTL2 Bits */
      __IO uint16_t bREF0               	:	5;  /* Reference resistor tap 0 */
      __IO uint16_t bRSEL               	:	1;  /* Reference select */
      __IO uint16_t bRS                 	:	2;  /* Reference source */
      __IO uint16_t bREF1               	:	5;  /* Reference resistor tap 1 */
      __IO uint16_t bREFL               	:	2;  /* Reference voltage level */
      __IO uint16_t bREFACC             	:	1;  /* Reference accuracy */
    } b;
  } rCTL2;
  union {    /* CE1CTL3 Register */
    __IO uint16_t r;
    struct { /* CE1CTL3 Bits */
      __IO uint16_t bPD0                	:	1;  /* Port disable */
      __IO uint16_t bPD1                	:	1;  /* Port disable */
      __IO uint16_t bPD2                	:	1;  /* Port disable */
      __IO uint16_t bPD3                	:	1;  /* Port disable */
      __IO uint16_t bPD4                	:	1;  /* Port disable */
      __IO uint16_t bPD5                	:	1;  /* Port disable */
      __IO uint16_t bPD6                	:	1;  /* Port disable */
      __IO uint16_t bPD7                	:	1;  /* Port disable */
      __IO uint16_t bPD8                	:	1;  /* Port disable */
      __IO uint16_t bPD9                	:	1;  /* Port disable */
      __IO uint16_t bPD10               	:	1;  /* Port disable */
      __IO uint16_t bPD11               	:	1;  /* Port disable */
      __IO uint16_t bPD12               	:	1;  /* Port disable */
      __IO uint16_t bPD13               	:	1;  /* Port disable */
      __IO uint16_t bPD14               	:	1;  /* Port disable */
      __IO uint16_t bPD15               	:	1;  /* Port disable */
    } b;
  } rCTL3;
  uint8_t  RESERVED0[4];
  union {    /* CE1INT Register */
    __IO uint16_t r;
    struct { /* CE1INT Bits */
      __IO uint16_t bIFG                	:	1;  /* Comparator output interrupt flag */
      __IO uint16_t bIIFG               	:	1;  /* Comparator output inverted interrupt flag */
      __I  uint16_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint16_t bRDYIFG             	:	1;  /* Comparator ready interrupt flag */
      __I  uint16_t bRESERVED1          	:	3;  /* Reserved */
      __IO uint16_t bIE                 	:	1;  /* Comparator output interrupt enable */
      __IO uint16_t bIIE                	:	1;  /* Comparator output interrupt enable inverted polarity */
      __I  uint16_t bRESERVED2          	:	2;  /* Reserved */
      __IO uint16_t bRDYIE              	:	1;  /* Comparator ready interrupt enable */
      __I  uint16_t bRESERVED3          	:	3;  /* Reserved */
    } b;
  } rINT;
  __I uint16_t rIV; /* Comparator Interrupt Vector Word Register */
} COMP_E1_Type;


//*****************************************************************************
// CRC32 Registers
//*****************************************************************************
typedef struct {
  __IO uint16_t rCRC32DI; /* Data Input for CRC32 Signature Computation */
  uint8_t  RESERVED0[2];
  __IO uint16_t rCRC32DIRB; /* Data In Reverse for CRC32 Computation */
  uint8_t  RESERVED1[2];
  __IO uint16_t rCRC32INIRES_LO; /* CRC32 Initialization and Result, lower 16 bits */
  __IO uint16_t rCRC32INIRES_HI; /* CRC32 Initialization and Result, upper 16 bits */
  __IO uint16_t rCRC32RESR_LO; /* CRC32 Result Reverse, lower 16 bits */
  __IO uint16_t rCRC32RESR_HI; /* CRC32 Result Reverse, Upper 16 bits */
  __IO uint16_t rCRC16DI; /* Data Input for CRC16 computation */
  uint8_t  RESERVED2[2];
  __IO uint16_t rCRC16DIRB; /* CRC16 Data In Reverse */
  uint8_t  RESERVED3[2];
  __IO uint16_t rCRC16INIRES; /* CRC16 Initialization and Result register */
  uint8_t  RESERVED4[4];
  __IO uint16_t rCRC16RESR; /* CRC16 Result Reverse */
} CRC32_Type;


