arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// DIO Registers
//*****************************************************************************
typedef struct {
  union {    /* PAIN Register */
    __I uint16_t r;
    struct { /* PAIN Bits */
      __I  uint16_t bP1IN               	:	8;  /* Port 1 Input */
      __I  uint16_t bP2IN               	:	8;  /* Port 2 Input */
    } b;
  } rPAIN;
  union {    /* PAOUT Register */
    __IO uint16_t r;
    struct { /* PAOUT Bits */
      __IO uint16_t bP1OUT              	:	8;  /* Port 1 Output */
      __IO uint16_t bP2OUT              	:	8;  /* Port 2 Output */
    } b;
  } rPAOUT;
  union {    /* PADIR Register */
    __IO uint16_t r;
    struct { /* PADIR Bits */
      __IO uint16_t bP1DIR              	:	8;  /* Port 1 Direction */
      __IO uint16_t bP2DIR              	:	8;  /* Port 2 Direction */
    } b;
  } rPADIR;
  union {    /* PAREN Register */
    __IO uint16_t r;
    struct { /* PAREN Bits */
      __IO uint16_t bP1REN              	:	8;  /* Port 1 Resistor Enable */
      __IO uint16_t bP2REN              	:	8;  /* Port 2 Resistor Enable */
    } b;
  } rPAREN;
  union {    /* PADS Register */
    __IO uint16_t r;
    struct { /* PADS Bits */
      __IO uint16_t bP1DS               	:	8;  /* Port 1 Drive Strength */
      __IO uint16_t bP2DS               	:	8;  /* Port 2 Drive Strength */
    } b;
  } rPADS;
  union {    /* PASEL0 Register */
    __IO uint16_t r;
    struct { /* PASEL0 Bits */
      __IO uint16_t bP1SEL0             	:	8;  /* Port 1 Select 0 */
      __IO uint16_t bP2SEL0             	:	8;  /* Port 2 Select 0 */
    } b;
  } rPASEL0;
  union {    /* PASEL1 Register */
    __IO uint16_t r;
    struct { /* PASEL1 Bits */
      __IO uint16_t bP1SEL1             	:	8;  /* Port 1 Select 1 */
      __IO uint16_t bP2SEL1             	:	8;  /* Port 2 Select 1 */
    } b;
  } rPASEL1;
  union {    /* P1IV Register */
    __I uint16_t r;
    struct { /* P1IV Bits */
      __I  uint16_t bP1IV               	:	5;  /* Port 1 interrupt vector value */
      __I  uint16_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rP1IV;
  uint8_t  RESERVED0[6];
  union {    /* PASELC Register */
    __IO uint16_t r;
    struct { /* PASELC Bits */
      __IO uint16_t bP1SELC             	:	8;  /* Port 1 Complement Select */
      __IO uint16_t bP2SELC             	:	8;  /* Port 2 Complement Select */
    } b;
  } rPASELC;
  union {    /* PAIES Register */
    __IO uint16_t r;
    struct { /* PAIES Bits */
      __IO uint16_t bP1IES              	:	8;  /* Port 1 Interrupt Edge Select */
      __IO uint16_t bP2IES              	:	8;  /* Port 2 Interrupt Edge Select */
    } b;
  } rPAIES;
  union {    /* PAIE Register */
    __IO uint16_t r;
    struct { /* PAIE Bits */
      __IO uint16_t bP1IE               	:	8;  /* Port 1 Interrupt Enable */
      __IO uint16_t bP2IE               	:	8;  /* Port 2 Interrupt Enable */
    } b;
  } rPAIE;
  union {    /* PAIFG Register */
    __IO uint16_t r;
    struct { /* PAIFG Bits */
      __IO uint16_t bP1IFG              	:	8;  /* Port 1 Interrupt Flag */
      __IO uint16_t bP2IFG              	:	8;  /* Port 2 Interrupt Flag */
    } b;
  } rPAIFG;
  union {    /* P2IV Register */
    __I uint16_t r;
    struct { /* P2IV Bits */
      __I  uint16_t bP2IV               	:	5;  /* Port 2 interrupt vector value */
      __I  uint16_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rP2IV;
  union {    /* PBIN Register */
    __I uint16_t r;
    struct { /* PBIN Bits */
      __I  uint16_t bP3IN               	:	8;  /* Port 3 Input */
      __I  uint16_t bP4IN               	:	8;  /* Port 4 Input */
    } b;
  } rPBIN;
  union {    /* PBOUT Register */
    __IO uint16_t r;
    struct { /* PBOUT Bits */
      __IO uint16_t bP3OUT              	:	8;  /* Port 3 Output */
      __IO uint16_t bP4OUT              	:	8;  /* Port 4 Output */
    } b;
  } rPBOUT;
  union {    /* PBDIR Register */
    __IO uint16_t r;
    struct { /* PBDIR Bits */
      __IO uint16_t bP3DIR              	:	8;  /* Port 3 Direction */
      __IO uint16_t bP4DIR              	:	8;  /* Port 4 Direction */
    } b;
  } rPBDIR;
  union {    /* PBREN Register */
    __IO uint16_t r;
    struct { /* PBREN Bits */
      __IO uint16_t bP3REN              	:	8;  /* Port 3 Resistor Enable */
      __IO uint16_t bP4REN              	:	8;  /* Port 4 Resistor Enable */
    } b;
  } rPBREN;
  union {    /* PBDS Register */
    __IO uint16_t r;
    struct { /* PBDS Bits */
      __IO uint16_t bP3DS               	:	8;  /* Port 3 Drive Strength */
      __IO uint16_t bP4DS               	:	8;  /* Port 4 Drive Strength */
    } b;
  } rPBDS;
  union {    /* PBSEL0 Register */
    __IO uint16_t r;
    struct { /* PBSEL0 Bits */
      __IO uint16_t bP3SEL0             	:	8;  /* Port 3 Select 0 */
      __IO uint16_t bP4SEL0             	:	8;  /* Port 4 Select 0 */
    } b;
  } rPBSEL0;
  union {    /* PBSEL1 Register */
    __IO uint16_t r;
    struct { /* PBSEL1 Bits */
      __IO uint16_t bP3SEL1             	:	8;  /* Port 3 Select 1 */
      __IO uint16_t bP4SEL1             	:	8;  /* Port 4 Select 1 */
    } b;
  } rPBSEL1;
  union {    /* P3IV Register */
    __I uint16_t r;
    struct { /* P3IV Bits */
      __I  uint16_t bP3IV               	:	5;  /* Port 3 interrupt vector value */
      __I  uint16_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rP3IV;
  uint8_t  RESERVED1[6];
  union {    /* PBSELC Register */
    __IO uint16_t r;
    struct { /* PBSELC Bits */
      __IO uint16_t bP3SELC             	:	8;  /* Port 3 Complement Select */
      __IO uint16_t bP4SELC             	:	8;  /* Port 4 Complement Select */
    } b;
  } rPBSELC;
  union {    /* PBIES Register */
    __IO uint16_t r;
    struct { /* PBIES Bits */
      __IO uint16_t bP3IES              	:	8;  /* Port 3 Interrupt Edge Select */
      __IO uint16_t bP4IES              	:	8;  /* Port 4 Interrupt Edge Select */
    } b;
  } rPBIES;
  union {    /* PBIE Register */
    __IO uint16_t r;
    struct { /* PBIE Bits */
      __IO uint16_t bP3IE               	:	8;  /* Port 3 Interrupt Enable */
      __IO uint16_t bP4IE               	:	8;  /* Port 4 Interrupt Enable */
    } b;
  } rPBIE;
  union {    /* PBIFG Register */
    __IO uint16_t r;
    struct { /* PBIFG Bits */
      __IO uint16_t bP3IFG              	:	8;  /* Port 3 Interrupt Flag */
      __IO uint16_t bP4IFG              	:	8;  /* Port 4 Interrupt Flag */
    } b;
  } rPBIFG;
  union {    /* P4IV Register */
    __I uint16_t r;
    struct { /* P4IV Bits */
      __I  uint16_t bP4IV               	:	5;  /* Port 4 interrupt vector value */
      __I  uint16_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rP4IV;
  union {    /* PCIN Register */
    __I uint16_t r;
    struct { /* PCIN Bits */
      __I  uint16_t bP5IN               	:	8;  /* Port 5 Input */
      __I  uint16_t bP6IN               	:	8;  /* Port 6 Input */
    } b;
  } rPCIN;
  union {    /* PCOUT Register */
    __IO uint16_t r;
    struct { /* PCOUT Bits */
      __IO uint16_t bP5OUT              	:	8;  /* Port 5 Output */
      __IO uint16_t bP6OUT              	:	8;  /* Port 6 Output */
    } b;
  } rPCOUT;
  union {    /* PCDIR Register */
    __IO uint16_t r;
    struct { /* PCDIR Bits */
      __IO uint16_t bP5DIR              	:	8;  /* Port 5 Direction */
      __IO uint16_t bP6DIR              	:	8;  /* Port 6 Direction */
    } b;
  } rPCDIR;
  union {    /* PCREN Register */
    __IO uint16_t r;
    struct { /* PCREN Bits */
      __IO uint16_t bP5REN              	:	8;  /* Port 5 Resistor Enable */
      __IO uint16_t bP6REN              	:	8;  /* Port 6 Resistor Enable */
    } b;
  } rPCREN;
  union {    /* PCDS Register */
    __IO uint16_t r;
    struct { /* PCDS Bits */
      __IO uint16_t bP5DS               	:	8;  /* Port 5 Drive Strength */
      __IO uint16_t bP6DS               	:	8;  /* Port 6 Drive Strength */
    } b;
  } rPCDS;
  union {    /* PCSEL0 Register */
    __IO uint16_t r;
    struct { /* PCSEL0 Bits */
      __IO uint16_t bP5SEL0             	:	8;  /* Port 5 Select 0 */
      __IO uint16_t bP6SEL0             	:	8;  /* Port 6 Select 0 */
    } b;
  } rPCSEL0;
  union {    /* PCSEL1 Register */
    __IO uint16_t r;
    struct { /* PCSEL1 Bits */
      __IO uint16_t bP5SEL1             	:	8;  /* Port 5 Select 1 */
      __IO uint16_t bP6SEL1             	:	8;  /* Port 6 Select 1 */
    } b;
  } rPCSEL1;
  union {    /* P5IV Register */
    __I uint16_t r;
    struct { /* P5IV Bits */
      __I  uint16_t bP5IV               	:	5;  /* Port 5 interrupt vector value */
      __I  uint16_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rP5IV;
  uint8_t  RESERVED2[6];
  union {    /* PCSELC Register */
    __IO uint16_t r;
    struct { /* PCSELC Bits */
      __IO uint16_t bP5SELC             	:	8;  /* Port 5 Complement Select */
      __IO uint16_t bP6SELC             	:	8;  /* Port 6 Complement Select */
    } b;
  } rPCSELC;
  union {    /* PCIES Register */
    __IO uint16_t r;
    struct { /* PCIES Bits */
      __IO uint16_t bP5IES              	:	8;  /* Port 5 Interrupt Edge Select */
      __IO uint16_t bP6IES              	:	8;  /* Port 6 Interrupt Edge Select */
    } b;
  } rPCIES;
  union {    /* PCIE Register */
    __IO uint16_t r;
    struct { /* PCIE Bits */
      __IO uint16_t bP5IE               	:	8;  /* Port 5 Interrupt Enable */
      __IO uint16_t bP6IE               	:	8;  /* Port 6 Interrupt Enable */
    } b;
  } rPCIE;
  union {    /* PCIFG Register */
    __IO uint16_t r;
    struct { /* PCIFG Bits */
      __IO uint16_t bP5IFG              	:	8;  /* Port 5 Interrupt Flag */
      __IO uint16_t bP6IFG              	:	8;  /* Port 6 Interrupt Flag */
    } b;
  } rPCIFG;
  union {    /* P6IV Register */
    __I uint16_t r;
    struct { /* P6IV Bits */
      __I  uint16_t bP6IV               	:	5;  /* Port 6 interrupt vector value */
      __I  uint16_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rP6IV;
  union {    /* PDIN Register */
    __I uint16_t r;
    struct { /* PDIN Bits */
      __I  uint16_t bP7IN               	:	8;  /* Port 7 Input */
      __I  uint16_t bP8IN               	:	8;  /* Port 8 Input */
    } b;
  } rPDIN;
  union {    /* PDOUT Register */
    __IO uint16_t r;
    struct { /* PDOUT Bits */
      __IO uint16_t bP7OUT              	:	8;  /* Port 7 Output */
      __IO uint16_t bP8OUT              	:	8;  /* Port 8 Output */
    } b;
  } rPDOUT;
  union {    /* PDDIR Register */
    __IO uint16_t r;
    struct { /* PDDIR Bits */
      __IO uint16_t bP7DIR              	:	8;  /* Port 7 Direction */
      __IO uint16_t bP8DIR              	:	8;  /* Port 8 Direction */
    } b;
  } rPDDIR;
  union {    /* PDREN Register */
    __IO uint16_t r;
    struct { /* PDREN Bits */
      __IO uint16_t bP7REN              	:	8;  /* Port 7 Resistor Enable */
      __IO uint16_t bP8REN              	:	8;  /* Port 8 Resistor Enable */
    } b;
  } rPDREN;
  union {    /* PDDS Register */
    __IO uint16_t r;
    struct { /* PDDS Bits */
      __IO uint16_t bP7DS               	:	8;  /* Port 7 Drive Strength */
      __IO uint16_t bP8DS               	:	8;  /* Port 8 Drive Strength */
    } b;
  } rPDDS;
  union {    /* PDSEL0 Register */
    __IO uint16_t r;
    struct { /* PDSEL0 Bits */
      __IO uint16_t bP7SEL0             	:	8;  /* Port 7 Select 0 */
      __IO uint16_t bP8SEL0             	:	8;  /* Port 8 Select 0 */
    } b;
  } rPDSEL0;
  union {    /* PDSEL1 Register */
    __IO uint16_t r;
    struct { /* PDSEL1 Bits */
      __IO uint16_t bP7SEL1             	:	8;  /* Port 7 Select 1 */
      __IO uint16_t bP8SEL1             	:	8;  /* Port 8 Select 1 */
    } b;
  } rPDSEL1;
  union {    /* P7IV Register */
    __I uint16_t r;
    struct { /* P7IV Bits */
      __I  uint16_t bP7IV               	:	5;  /* Port 7 interrupt vector value */
      __I  uint16_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rP7IV;
  uint8_t  RESERVED3[6];
  union {    /* PDSELC Register */
    __IO uint16_t r;
    struct { /* PDSELC Bits */
      __IO uint16_t bP7SELC             	:	8;  /* Port 7 Complement Select */
      __IO uint16_t bP8SELC             	:	8;  /* Port 8 Complement Select */
    } b;
  } rPDSELC;
  union {    /* PDIES Register */
    __IO uint16_t r;
    struct { /* PDIES Bits */
      __IO uint16_t bP7IES              	:	8;  /* Port 7 Interrupt Edge Select */
      __IO uint16_t bP8IES              	:	8;  /* Port 8 Interrupt Edge Select */
    } b;
  } rPDIES;
  union {    /* PDIE Register */
    __IO uint16_t r;
    struct { /* PDIE Bits */
      __IO uint16_t bP7IE               	:	8;  /* Port 7 Interrupt Enable */
      __IO uint16_t bP8IE               	:	8;  /* Port 8 Interrupt Enable */
    } b;
  } rPDIE;
  union {    /* PDIFG Register */
    __IO uint16_t r;
    struct { /* PDIFG Bits */
      __IO uint16_t bP7IFG              	:	8;  /* Port 7 Interrupt Flag */
      __IO uint16_t bP8IFG              	:	8;  /* Port 8 Interrupt Flag */
    } b;
  } rPDIFG;
  union {    /* P8IV Register */
    __I uint16_t r;
    struct { /* P8IV Bits */
      __I  uint16_t bP8IV               	:	5;  /* Port 8 interrupt vector value */
      __I  uint16_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rP8IV;
  union {    /* PEIN Register */
    __I uint16_t r;
    struct { /* PEIN Bits */
      __I  uint16_t bP9IN               	:	8;  /* Port 9 Input */
      __I  uint16_t bP10IN              	:	8;  /* Port 10 Input */
    } b;
  } rPEIN;
  union {    /* PEOUT Register */
    __IO uint16_t r;
    struct { /* PEOUT Bits */
      __IO uint16_t bP9OUT              	:	8;  /* Port 9 Output */
      __IO uint16_t bP10OUT             	:	8;  /* Port 10 Output */
    } b;
  } rPEOUT;
  union {    /* PEDIR Register */
    __IO uint16_t r;
    struct { /* PEDIR Bits */
      __IO uint16_t bP9DIR              	:	8;  /* Port 9 Direction */
      __IO uint16_t bP10DIR             	:	8;  /* Port 10 Direction */
    } b;
  } rPEDIR;
  union {    /* PEREN Register */
    __IO uint16_t r;
    struct { /* PEREN Bits */
      __IO uint16_t bP9REN              	:	8;  /* Port 9 Resistor Enable */
      __IO uint16_t bP10REN             	:	8;  /* Port 10 Resistor Enable */
    } b;
  } rPEREN;
  union {    /* PEDS Register */
    __IO uint16_t r;
    struct { /* PEDS Bits */
      __IO uint16_t bP9DS               	:	8;  /* Port 9 Drive Strength */
      __IO uint16_t bP10DS              	:	8;  /* Port 10 Drive Strength */
    } b;
  } rPEDS;
  union {    /* PESEL0 Register */
    __IO uint16_t r;
    struct { /* PESEL0 Bits */
      __IO uint16_t bP9SEL0             	:	8;  /* Port 9 Select 0 */
      __IO uint16_t bP10SEL0            	:	8;  /* Port 10 Select 0 */
    } b;
  } rPESEL0;
  union {    /* PESEL1 Register */
    __IO uint16_t r;
    struct { /* PESEL1 Bits */
      __IO uint16_t bP9SEL1             	:	8;  /* Port 9 Select 1 */
      __IO uint16_t bP10SEL1            	:	8;  /* Port 10 Select 1 */
    } b;
  } rPESEL1;
  union {    /* P9IV Register */
    __I uint16_t r;
    struct { /* P9IV Bits */
      __I  uint16_t bP9IV               	:	5;  /* Port 9 interrupt vector value */
      __I  uint16_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rP9IV;
  uint8_t  RESERVED4[6];
  union {    /* PESELC Register */
    __IO uint16_t r;
    struct { /* PESELC Bits */
      __IO uint16_t bP9SELC             	:	8;  /* Port 9 Complement Select */
      __IO uint16_t bP10SELC            	:	8;  /* Port 10 Complement Select */
    } b;
  } rPESELC;
  union {    /* PEIES Register */
    __IO uint16_t r;
    struct { /* PEIES Bits */
      __IO uint16_t bP9IES              	:	8;  /* Port 9 Interrupt Edge Select */
      __IO uint16_t bP10IES             	:	8;  /* Port 10 Interrupt Edge Select */
    } b;
  } rPEIES;
  union {    /* PEIE Register */
    __IO uint16_t r;
    struct { /* PEIE Bits */
      __IO uint16_t bP9IE               	:	8;  /* Port 9 Interrupt Enable */
      __IO uint16_t bP10IE              	:	8;  /* Port 10 Interrupt Enable */
    } b;
  } rPEIE;
  union {    /* PEIFG Register */
    __IO uint16_t r;
    struct { /* PEIFG Bits */
      __IO uint16_t bP9IFG              	:	8;  /* Port 9 Interrupt Flag */
      __IO uint16_t bP10IFG             	:	8;  /* Port 10 Interrupt Flag */
    } b;
  } rPEIFG;
  union {    /* P10IV Register */
    __I uint16_t r;
    struct { /* P10IV Bits */
      __I  uint16_t bP10IV              	:	5;  /* Port 10 interrupt vector value */
      __I  uint16_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rP10IV;
  uint8_t  RESERVED5[128];
  __I uint16_t rPJIN; /* Port J Input */
  __IO uint16_t rPJOUT; /* Port J Output */
  __IO uint16_t rPJDIR; /* Port J Direction */
  __IO uint16_t rPJREN; /* Port J Resistor Enable */
  __IO uint16_t rPJDS; /* Port J Drive Strength */
  __IO uint16_t rPJSEL0; /* Port J Select 0 */
  __IO uint16_t rPJSEL1; /* Port J Select 1 */
  uint8_t  RESERVED6[8];
  __IO uint16_t rPJSELC; /* Port J Complement Select */
} DIO_Type;


