arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// DMA Registers
//*****************************************************************************
typedef struct {
  union {    /* DMA_DEVICE_CFG Register */
    __I uint32_t r;
    struct { /* DMA_DEVICE_CFG Bits */
      __I  uint32_t bNUM_DMA_CHANNELS   	:	8;  /* Number of DMA channels available */
      __I  uint32_t bNUM_SRC_PER_CHANNEL	:	8;  /* Number of DMA sources per channel */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rDEVICE_CFG;
  union {    /* DMA_SW_CHTRIG Register */
    __IO uint32_t r;
    struct { /* DMA_SW_CHTRIG Bits */
      __IO uint32_t bCH0                	:	1;  /* Write 1, triggers DMA_CHANNEL0 */
      __IO uint32_t bCH1                	:	1;  /* Write 1, triggers DMA_CHANNEL1 */
      __IO uint32_t bCH2                	:	1;  /* Write 1, triggers DMA_CHANNEL2 */
      __IO uint32_t bCH3                	:	1;  /* Write 1, triggers DMA_CHANNEL3 */
      __IO uint32_t bCH4                	:	1;  /* Write 1, triggers DMA_CHANNEL4 */
      __IO uint32_t bCH5                	:	1;  /* Write 1, triggers DMA_CHANNEL5 */
      __IO uint32_t bCH6                	:	1;  /* Write 1, triggers DMA_CHANNEL6 */
      __IO uint32_t bCH7                	:	1;  /* Write 1, triggers DMA_CHANNEL7 */
      __IO uint32_t bCH8                	:	1;  /* Write 1, triggers DMA_CHANNEL8 */
      __IO uint32_t bCH9                	:	1;  /* Write 1, triggers DMA_CHANNEL9 */
      __IO uint32_t bCH10               	:	1;  /* Write 1, triggers DMA_CHANNEL10 */
      __IO uint32_t bCH11               	:	1;  /* Write 1, triggers DMA_CHANNEL11 */
      __IO uint32_t bCH12               	:	1;  /* Write 1, triggers DMA_CHANNEL12 */
      __IO uint32_t bCH13               	:	1;  /* Write 1, triggers DMA_CHANNEL13 */
      __IO uint32_t bCH14               	:	1;  /* Write 1, triggers DMA_CHANNEL14 */
      __IO uint32_t bCH15               	:	1;  /* Write 1, triggers DMA_CHANNEL15 */
      __IO uint32_t bCH16               	:	1;  /* Write 1, triggers DMA_CHANNEL16 */
      __IO uint32_t bCH17               	:	1;  /* Write 1, triggers DMA_CHANNEL17 */
      __IO uint32_t bCH18               	:	1;  /* Write 1, triggers DMA_CHANNEL18 */
      __IO uint32_t bCH19               	:	1;  /* Write 1, triggers DMA_CHANNEL19 */
      __IO uint32_t bCH20               	:	1;  /* Write 1, triggers DMA_CHANNEL20 */
      __IO uint32_t bCH21               	:	1;  /* Write 1, triggers DMA_CHANNEL21 */
      __IO uint32_t bCH22               	:	1;  /* Write 1, triggers DMA_CHANNEL22 */
      __IO uint32_t bCH23               	:	1;  /* Write 1, triggers DMA_CHANNEL23 */
      __IO uint32_t bCH24               	:	1;  /* Write 1, triggers DMA_CHANNEL24 */
      __IO uint32_t bCH25               	:	1;  /* Write 1, triggers DMA_CHANNEL25 */
      __IO uint32_t bCH26               	:	1;  /* Write 1, triggers DMA_CHANNEL26 */
      __IO uint32_t bCH27               	:	1;  /* Write 1, triggers DMA_CHANNEL27 */
      __IO uint32_t bCH28               	:	1;  /* Write 1, triggers DMA_CHANNEL28 */
      __IO uint32_t bCH29               	:	1;  /* Write 1, triggers DMA_CHANNEL29 */
      __IO uint32_t bCH30               	:	1;  /* Write 1, triggers DMA_CHANNEL30 */
      __IO uint32_t bCH31               	:	1;  /* Write 1, triggers DMA_CHANNEL31 */
    } b;
  } rSW_CHTRIG;
  uint8_t  RESERVED0[8];
  union {    /* DMA_CH0_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH0_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH0_SRCCFG;
  union {    /* DMA_CH1_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH1_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH1_SRCCFG;
  union {    /* DMA_CH2_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH2_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH2_SRCCFG;
  union {    /* DMA_CH3_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH3_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH3_SRCCFG;
  union {    /* DMA_CH4_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH4_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH4_SRCCFG;
  union {    /* DMA_CH5_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH5_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH5_SRCCFG;
  union {    /* DMA_CH6_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH6_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH6_SRCCFG;
  union {    /* DMA_CH7_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH7_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH7_SRCCFG;
  union {    /* DMA_CH8_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH8_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH8_SRCCFG;
  union {    /* DMA_CH9_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH9_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH9_SRCCFG;
  union {    /* DMA_CH10_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH10_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH10_SRCCFG;
  union {    /* DMA_CH11_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH11_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH11_SRCCFG;
  union {    /* DMA_CH12_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH12_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH12_SRCCFG;
  union {    /* DMA_CH13_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH13_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH13_SRCCFG;
  union {    /* DMA_CH14_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH14_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH14_SRCCFG;
  union {    /* DMA_CH15_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH15_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH15_SRCCFG;
  union {    /* DMA_CH16_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH16_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH16_SRCCFG;
  union {    /* DMA_CH17_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH17_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH17_SRCCFG;
  union {    /* DMA_CH18_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH18_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH18_SRCCFG;
  union {    /* DMA_CH19_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH19_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH19_SRCCFG;
  union {    /* DMA_CH20_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH20_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH20_SRCCFG;
  union {    /* DMA_CH21_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH21_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH21_SRCCFG;
  union {    /* DMA_CH22_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH22_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH22_SRCCFG;
  union {    /* DMA_CH23_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH23_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH23_SRCCFG;
  union {    /* DMA_CH24_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH24_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH24_SRCCFG;
  union {    /* DMA_CH25_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH25_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH25_SRCCFG;
  union {    /* DMA_CH26_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH26_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH26_SRCCFG;
  union {    /* DMA_CH27_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH27_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH27_SRCCFG;
  union {    /* DMA_CH28_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH28_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH28_SRCCFG;
  union {    /* DMA_CH29_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH29_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH29_SRCCFG;
  union {    /* DMA_CH30_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH30_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH30_SRCCFG;
  union {    /* DMA_CH31_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_CH31_SRCCFG Bits */
      __IO uint32_t bDMA_SRC            	:	8;  /* Device level DMA source mapping to channel input */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rCH31_SRCCFG;
  uint8_t  RESERVED1[112];
  union {    /* DMA_INT1_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_INT1_SRCCFG Bits */
      __IO uint32_t bINT_SRC            	:	5;  /* Controls which channel's completion event is mapped as a source of this Interrupt */
      __IO uint32_t bEN                 	:	1;  /* Enables DMA_INT1 mapping */
      __I  uint32_t bRESERVED0          	:	26;  /* Reserved */
    } b;
  } rINT1_SRCCFG;
  union {    /* DMA_INT2_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_INT2_SRCCFG Bits */
      __IO uint32_t bINT_SRC            	:	5;  /* Controls which channel's completion event is mapped as a source of this Interrupt */
      __IO uint32_t bEN                 	:	1;  /* Enables DMA_INT2 mapping */
      __I  uint32_t bRESERVED0          	:	26;  /* Reserved */
    } b;
  } rINT2_SRCCFG;
  union {    /* DMA_INT3_SRCCFG Register */
    __IO uint32_t r;
    struct { /* DMA_INT3_SRCCFG Bits */
      __IO uint32_t bINT_SRC            	:	5;  /* Controls which channel's completion event is mapped as a source of this Interrupt */
      __IO uint32_t bEN                 	:	1;  /* Enables DMA_INT3 mapping */
      __I  uint32_t bRESERVED0          	:	26;  /* Reserved */
    } b;
  } rINT3_SRCCFG;
  uint8_t  RESERVED2[4];
  union {    /* DMA_INT0_SRCFLG Register */
    __I uint32_t r;
    struct { /* DMA_INT0_SRCFLG Bits */
      __I  uint32_t bCH0                	:	1;  /* Channel 0 was the source of DMA_INT0 */
      __I  uint32_t bCH1                	:	1;  /* Channel 1 was the source of DMA_INT0 */
      __I  uint32_t bCH2                	:	1;  /* Channel 2 was the source of DMA_INT0 */
      __I  uint32_t bCH3                	:	1;  /* Channel 3 was the source of DMA_INT0 */
      __I  uint32_t bCH4                	:	1;  /* Channel 4 was the source of DMA_INT0 */
      __I  uint32_t bCH5                	:	1;  /* Channel 5 was the source of DMA_INT0 */
      __I  uint32_t bCH6                	:	1;  /* Channel 6 was the source of DMA_INT0 */
      __I  uint32_t bCH7                	:	1;  /* Channel 7 was the source of DMA_INT0 */
      __I  uint32_t bCH8                	:	1;  /* Channel 8 was the source of DMA_INT0 */
      __I  uint32_t bCH9                	:	1;  /* Channel 9 was the source of DMA_INT0 */
      __I  uint32_t bCH10               	:	1;  /* Channel 10 was the source of DMA_INT0 */
      __I  uint32_t bCH11               	:	1;  /* Channel 11 was the source of DMA_INT0 */
      __I  uint32_t bCH12               	:	1;  /* Channel 12 was the source of DMA_INT0 */
      __I  uint32_t bCH13               	:	1;  /* Channel 13 was the source of DMA_INT0 */
      __I  uint32_t bCH14               	:	1;  /* Channel 14 was the source of DMA_INT0 */
      __I  uint32_t bCH15               	:	1;  /* Channel 15 was the source of DMA_INT0 */
      __I  uint32_t bCH16               	:	1;  /* Channel 16 was the source of DMA_INT0 */
      __I  uint32_t bCH17               	:	1;  /* Channel 17 was the source of DMA_INT0 */
      __I  uint32_t bCH18               	:	1;  /* Channel 18 was the source of DMA_INT0 */
      __I  uint32_t bCH19               	:	1;  /* Channel 19 was the source of DMA_INT0 */
      __I  uint32_t bCH20               	:	1;  /* Channel 20 was the source of DMA_INT0 */
      __I  uint32_t bCH21               	:	1;  /* Channel 21 was the source of DMA_INT0 */
      __I  uint32_t bCH22               	:	1;  /* Channel 22 was the source of DMA_INT0 */
      __I  uint32_t bCH23               	:	1;  /* Channel 23 was the source of DMA_INT0 */
      __I  uint32_t bCH24               	:	1;  /* Channel 24 was the source of DMA_INT0 */
      __I  uint32_t bCH25               	:	1;  /* Channel 25 was the source of DMA_INT0 */
      __I  uint32_t bCH26               	:	1;  /* Channel 26 was the source of DMA_INT0 */
      __I  uint32_t bCH27               	:	1;  /* Channel 27 was the source of DMA_INT0 */
      __I  uint32_t bCH28               	:	1;  /* Channel 28 was the source of DMA_INT0 */
      __I  uint32_t bCH29               	:	1;  /* Channel 29 was the source of DMA_INT0 */
      __I  uint32_t bCH30               	:	1;  /* Channel 30 was the source of DMA_INT0 */
      __I  uint32_t bCH31               	:	1;  /* Channel 31 was the source of DMA_INT0 */
    } b;
  } rINT0_SRCFLG;
  union {    /* DMA_INT0_CLRFLG Register */
    __O uint32_t r;
    struct { /* DMA_INT0_CLRFLG Bits */
      __O  uint32_t bCH0                	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH1                	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH2                	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH3                	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH4                	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH5                	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH6                	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH7                	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH8                	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH9                	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH10               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH11               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH12               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH13               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH14               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH15               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH16               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH17               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH18               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH19               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH20               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH21               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH22               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH23               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH24               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH25               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH26               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH27               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH28               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH29               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH30               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
      __O  uint32_t bCH31               	:	1;  /* Clear corresponding DMA_INT0_SRCFLG_REG */
    } b;
  } rINT0_CLRFLG;
  uint8_t  RESERVED3[3816];
  union {    /* DMA_STAT Register */
    __I uint32_t r;
    struct { /* DMA_STAT Bits */
      __I  uint32_t bMASTEN             	:	1;  /*  */
      __I  uint32_t bRESERVED0          	:	3;  /* Reserved */
      __I  uint32_t b                   	:	4;  /*  */
      __I  uint32_t bRESERVED1          	:	8;  /* Reserved */
      __I  uint32_t bRESERVED2          	:	7;  /* Reserved */
    } b;
  } rSTAT;
  union {    /* DMA_CFG Register */
    __O uint32_t r;
    struct { /* DMA_CFG Bits */
      __O  uint32_t b                   	:	1;  /*  */
      __O  uint32_t bRESERVED0          	:	4;  /* Reserved */
      __O  uint32_t bRESERVED1          	:	24;  /* Reserved */
    } b;
  } rCFG;
  union {    /* DMA_CTLBASE Register */
    __IO uint32_t r;
    struct { /* DMA_CTLBASE Bits */
      __I  uint32_t bRESERVED0          	:	5;  /* Reserved */
      __IO uint32_t b                   	:	27;  /*  */
    } b;
  } rCTLBASE;
  __I uint32_t rATLBASE; /* Channel Alternate Control Data Base Pointer Register */
  __I uint32_t rWAITSTAT; /* Channel Wait on Request Status Register */
  __O uint32_t rSWREQ; /* Channel Software Request Register */
  __IO uint32_t rUSEBURSTSET; /* Channel Useburst Set Register */
  __O uint32_t rUSEBURSTCLR; /* Channel Useburst Clear Register */
  __IO uint32_t rREQMASKSET; /* Channel Request Mask Set Register */
  __O uint32_t rREQMASKCLR; /* Channel Request Mask Clear Register */
  __IO uint32_t rENASET; /* Channel Enable Set Register */
  __O uint32_t rENACLR; /* Channel Enable Clear Register */
  __IO uint32_t rALTSET; /* Channel Primary-Alternate Set Register */
  __O uint32_t rALTCLR; /* Channel Primary-Alternate Clear Register */
  __IO uint32_t rPRIOSET; /* Channel Priority Set Register */
  __O uint32_t rPRIOCLR; /* Channel Priority Clear Register */
  uint8_t  RESERVED4[12];
  union {    /* DMA_ERRCLR Register */
    __IO uint32_t r;
    struct { /* DMA_ERRCLR Bits */
      __IO uint32_t b                   	:	1;  /*  */
      __I  uint32_t bRESERVED0          	:	31;  /* Reserved */
    } b;
  } rERRCLR;
} DMA_Type;


