arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// EUSCI_A3 Registers
//*****************************************************************************
typedef struct {
  union {    /* UCA3CTLW0 Register */
    __IO uint16_t r;
    struct { /* UCA3CTLW0 Bits */
      __IO uint16_t bSWRST              	:	1;  /* Software reset enable */
      __IO uint16_t bTXBRK              	:	1;  /* Transmit break */
      __IO uint16_t bTXADDR             	:	1;  /* Transmit address */
      __IO uint16_t bDORM               	:	1;  /* Dormant */
      __IO uint16_t bBRKIE              	:	1;  /* Receive break character interrupt enable */
      __IO uint16_t bRXEIE              	:	1;  /* Receive erroneous-character interrupt enable */
      __IO uint16_t bSSEL               	:	2;  /* eUSCI_A clock source select */
      __IO uint16_t bSYNC               	:	1;  /* Synchronous mode enable */
      __IO uint16_t bMODE               	:	2;  /* eUSCI_A mode */
      __IO uint16_t bSPB                	:	1;  /* Stop bit select */
      __IO uint16_t b7BIT               	:	1;  /* Character length */
      __IO uint16_t bMSB                	:	1;  /* MSB first select */
      __IO uint16_t bPAR                	:	1;  /* Parity select */
      __IO uint16_t bPEN                	:	1;  /* Parity enable */
    } b;
    struct { /* UCA3CTLW0_SPI Bits */
      __IO uint16_t bSWRST              	:	1;  /* Software reset enable */
      __IO uint16_t bSTEM               	:	1;  /* STE mode select in master mode. */
      __I  uint16_t bRESERVED           	:	4;  /* Reserved */
      __IO uint16_t bSSEL               	:	2;  /* eUSCI_A clock source select */
      __IO uint16_t bSYNC               	:	1;  /* Synchronous mode enable */
      __IO uint16_t bMODE               	:	2;  /* eUSCI mode */
      __IO uint16_t bMST                	:	1;  /* Master mode select */
      __IO uint16_t b7BIT               	:	1;  /* Character length */
      __IO uint16_t bMSB                	:	1;  /* MSB first select */
      __IO uint16_t bCKPL               	:	1;  /* Clock polarity select */
      __IO uint16_t bCKPH               	:	1;  /* Clock phase select */
    } a;
  } rCTLW0;
  union {    /* UCA3CTLW1 Register */
    __IO uint16_t r;
    struct { /* UCA3CTLW1 Bits */
      __IO uint16_t bGLIT               	:	2;  /* Deglitch time */
      __I  uint16_t bRESERVED0          	:	14;  /* Reserved */
    } b;
  } rCTLW1;
  uint8_t  RESERVED0[2];
  __IO uint16_t rBRW; /* eUSCI_Ax Baud Rate Control Word Register */
  union {    /* UCA3MCTLW Register */
    __IO uint16_t r;
    struct { /* UCA3MCTLW Bits */
      __IO uint16_t bOS16               	:	1;  /* Oversampling mode enabled */
      __I  uint16_t bRESERVED0          	:	3;  /* Reserved */
      __IO uint16_t bBRF                	:	4;  /* First modulation stage select */
      __IO uint16_t bBRS                	:	8;  /* Second modulation stage select */
    } b;
  } rMCTLW;
  union {    /* UCA3STATW Register */
    __IO uint16_t r;
    struct { /* UCA3STATW Bits */
      __I  uint16_t bBUSY               	:	1;  /* eUSCI_A busy */
      __IO uint16_t bADDR_IDLE          	:	1;  /* Address received / Idle line detected */
      __IO uint16_t bRXERR              	:	1;  /* Receive error flag */
      __IO uint16_t bBRK                	:	1;  /* Break detect flag */
      __IO uint16_t bPE                 	:	1;  /*  */
      __IO uint16_t bOE                 	:	1;  /* Overrun error flag */
      __IO uint16_t bFE                 	:	1;  /* Framing error flag */
      __IO uint16_t bLISTEN             	:	1;  /* Listen enable */
      __I  uint16_t bRESERVED0          	:	8;  /* Reserved */
    } b;
    struct { /* UCA3STATW_SPI Bits */
      __I  uint16_t bBUSY               	:	1;  /* eUSCI_A busy */
      __IO uint16_t bRESERVED           	:	4;  /* Reserved */
      __IO uint16_t bOE                 	:	1;  /* Overrun error flag */
      __IO uint16_t bFE                 	:	1;  /* Framing error flag */
      __IO uint16_t bLISTEN             	:	1;  /* Listen enable */
    } a;
  } rSTATW;
  union {    /* UCA3RXBUF Register */
    __I uint16_t r;
    struct { /* UCA3RXBUF Bits */
      __I  uint16_t bRXBUF              	:	8;  /* Receive data buffer */
      __I  uint16_t bRESERVED0          	:	8;  /* Reserved */
    } b;
    struct { /* UCA3RXBUF_SPI Bits */
      __I  uint16_t bRXBUF              	:	8;  /* Receive data buffer */
      __I  uint16_t bRESERVED           	:	8;  /* Reserved */
    } a;
  } rRXBUF;
  union {    /* UCA3TXBUF Register */
    __IO uint16_t r;
    struct { /* UCA3TXBUF Bits */
      __IO uint16_t bTXBUF              	:	8;  /* Transmit data buffer */
      __I  uint16_t bRESERVED0          	:	8;  /* Reserved */
    } b;
    struct { /* UCA3TXBUF_SPI Bits */
      __IO uint16_t bTXBUF              	:	8;  /* Transmit data buffer */
      __I  uint16_t bRESERVED           	:	8;  /* Reserved */
    } a;
  } rTXBUF;
  union {    /* UCA3ABCTL Register */
    __IO uint16_t r;
    struct { /* UCA3ABCTL Bits */
      __IO uint16_t bABDEN              	:	1;  /* Automatic baud-rate detect enable */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bBTOE               	:	1;  /* Break time out error */
      __IO uint16_t bSTOE               	:	1;  /* Synch field time out error */
      __IO uint16_t bDELIM              	:	2;  /* Break/synch delimiter length */
      __I  uint16_t bRESERVED1          	:	10;  /* Reserved */
    } b;
  } rABCTL;
  union {    /* UCA3IRCTL Register */
    __IO uint16_t r;
    struct { /* UCA3IRCTL Bits */
      __IO uint16_t bIREN               	:	1;  /* IrDA encoder/decoder enable */
      __IO uint16_t bIRTXCLK            	:	1;  /* IrDA transmit pulse clock select */
      __IO uint16_t bIRTXPL             	:	6;  /* Transmit pulse length */
      __IO uint16_t bIRRXFE             	:	1;  /* IrDA receive filter enabled */
      __IO uint16_t bIRRXPL             	:	1;  /* IrDA receive input UCAxRXD polarity */
      __IO uint16_t bIRRXFL             	:	4;  /* Receive filter length */
    } b;
  } rIRCTL;
  uint8_t  RESERVED1[6];
  union {    /* UCA3IE Register */
    __IO uint16_t r;
    struct { /* UCA3IE Bits */
      __IO uint16_t bRXIE               	:	1;  /* Receive interrupt enable */
      __IO uint16_t bTXIE               	:	1;  /* Transmit interrupt enable */
      __IO uint16_t bSTTIE              	:	1;  /* Start bit interrupt enable */
      __IO uint16_t bTXCPTIE            	:	1;  /* Transmit complete interrupt enable */
      __I  uint16_t bRESERVED0          	:	12;  /* Reserved */
    } b;
    struct { /* UCA3IE_SPI Bits */
      __IO uint16_t bRXIE               	:	1;  /* Receive interrupt enable */
      __IO uint16_t bTXIE               	:	1;  /* Transmit interrupt enable */
      __I  uint16_t bRESERVED           	:	14;  /* Reserved */
    } a;
  } rIE;
  union {    /* UCA3IFG Register */
    __IO uint16_t r;
    struct { /* UCA3IFG Bits */
      __IO uint16_t bRXIFG              	:	1;  /* Receive interrupt flag */
      __IO uint16_t bTXIFG              	:	1;  /* Transmit interrupt flag */
      __IO uint16_t bSTTIFG             	:	1;  /* Start bit interrupt flag */
      __IO uint16_t bTXCPTIFG           	:	1;  /* Transmit ready interrupt enable */
      __I  uint16_t bRESERVED0          	:	12;  /* Reserved */
    } b;
    struct { /* UCA3IFG_SPI Bits */
      __IO uint16_t bRXIFG              	:	1;  /* Receive interrupt flag */
      __IO uint16_t bTXIFG              	:	1;  /* Transmit interrupt flag */
      __I  uint16_t bRESERVED           	:	14;  /* Reserved */
    } a;
  } rIFG;
  __I uint16_t rIV; /* eUSCI_Ax Interrupt Vector Register */
} EUSCI_A3_Type;


//*****************************************************************************
// EUSCI_B0 Registers
//*****************************************************************************
typedef struct {
  union {    /* UCB0CTLW0 Register */
    __IO uint16_t r;
    struct { /* UCB0CTLW0 Bits */
      __IO uint16_t bSWRST              	:	1;  /* Software reset enable */
      __IO uint16_t bTXSTT              	:	1;  /* Transmit START condition in master mode */
      __IO uint16_t bTXSTP              	:	1;  /* Transmit STOP condition in master mode */
      __IO uint16_t bTXNACK             	:	1;  /* Transmit a NACK */
      __IO uint16_t bTR                 	:	1;  /* Transmitter/receiver */
      __IO uint16_t bTXACK              	:	1;  /* Transmit ACK condition in slave mode */
      __IO uint16_t bSSEL               	:	2;  /* eUSCI_B clock source select */
      __IO uint16_t bSYNC               	:	1;  /* Synchronous mode enable */
      __IO uint16_t bMODE               	:	2;  /* eUSCI_B mode */
      __IO uint16_t bMST                	:	1;  /* Master mode select */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bMM                 	:	1;  /* Multi-master environment select */
      __IO uint16_t bSLA10              	:	1;  /* Slave addressing mode select */
      __IO uint16_t bA10                	:	1;  /* Own addressing mode select */
    } b;
    struct { /* UCB0CTLW0_SPI Bits */
      __IO uint16_t bSWRST              	:	1;  /* Software reset enable */
      __IO uint16_t bSTEM               	:	1;  /* STE mode select in master mode. */
      __I  uint16_t bRESERVED           	:	4;  /* Reserved */
      __IO uint16_t bSSEL               	:	2;  /* eUSCI_B clock source select */
      __IO uint16_t bSYNC               	:	1;  /* Synchronous mode enable */
      __IO uint16_t bMODE               	:	2;  /* eUSCI mode */
      __IO uint16_t bMST                	:	1;  /* Master mode select */
      __IO uint16_t b7BIT               	:	1;  /* Character length */
      __IO uint16_t bMSB                	:	1;  /* MSB first select */
      __IO uint16_t bCKPL               	:	1;  /* Clock polarity select */
      __IO uint16_t bCKPH               	:	1;  /* Clock phase select */
    } a;
  } rCTLW0;
  union {    /* UCB0CTLW1 Register */
    __IO uint16_t r;
    struct { /* UCB0CTLW1 Bits */
      __IO uint16_t bGLIT               	:	2;  /* Deglitch time */
      __IO uint16_t bASTP               	:	2;  /* Automatic STOP condition generation */
      __IO uint16_t bSWACK              	:	1;  /* SW or HW ACK control */
      __IO uint16_t bSTPNACK            	:	1;  /* ACK all master bytes */
      __IO uint16_t bCLTO               	:	2;  /* Clock low timeout select */
      __IO uint16_t bETXINT             	:	1;  /* Early UCTXIFG0 */
      __I  uint16_t bRESERVED0          	:	7;  /* Reserved */
    } b;
  } rCTLW1;
  uint8_t  RESERVED0[2];
  __IO uint16_t rBRW; /* eUSCI_Bx Baud Rate Control Word Register */
  union {    /* UCB0STATW Register */
    __IO uint16_t r;
    struct { /* UCB0STATW Bits */
      __I  uint16_t bRESERVED1          	:	4;  /* Reserved */
      __I  uint16_t bBBUSY              	:	1;  /* Bus busy */
      __I  uint16_t bGC                 	:	1;  /* General call address received */
      __I  uint16_t bSCLLOW             	:	1;  /* SCL low */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __I  uint16_t bBCNT               	:	8;  /* Hardware byte counter value */
    } b;
    struct { /* UCB0STATW_SPI Bits */
      __I  uint16_t bBUSY               	:	1;  /* eUSCI_B busy */
      __IO uint16_t bRESERVED           	:	4;  /* Reserved */
      __IO uint16_t bOE                 	:	1;  /* Overrun error flag */
      __IO uint16_t bFE                 	:	1;  /* Framing error flag */
      __IO uint16_t bLISTEN             	:	1;  /* Listen enable */
    } a;
  } rSTATW;
  union {    /* UCB0TBCNT Register */
    __IO uint16_t r;
    struct { /* UCB0TBCNT Bits */
      __IO uint16_t bTBCNT              	:	8;  /* Byte counter threshold value */
      __I  uint16_t bRESERVED0          	:	8;  /* Reserved */
    } b;
  } rTBCNT;
  union {    /* UCB0RXBUF Register */
    __I uint16_t r;
    struct { /* UCB0RXBUF Bits */
      __I  uint16_t bRXBUF              	:	8;  /* Receive data buffer */
      __I  uint16_t bRESERVED0          	:	8;  /* Reserved */
    } b;
    struct { /* UCB0RXBUF_SPI Bits */
      __I  uint16_t bRXBUF              	:	8;  /* Receive data buffer */
      __I  uint16_t bRESERVED           	:	8;  /* Reserved */
    } a;
  } rRXBUF;
  union {    /* UCB0TXBUF Register */
    __IO uint16_t r;
    struct { /* UCB0TXBUF Bits */
      __IO uint16_t bTXBUF              	:	8;  /* Transmit data buffer */
      __I  uint16_t bRESERVED0          	:	8;  /* Reserved */
    } b;
    struct { /* UCB0TXBUF_SPI Bits */
      __IO uint16_t bTXBUF              	:	8;  /* Transmit data buffer */
      __I  uint16_t bRESERVED           	:	8;  /* Reserved */
    } a;
  } rTXBUF;
  uint8_t  RESERVED1[4];
  union {    /* UCB0I2COA0 Register */
    __IO uint16_t r;
    struct { /* UCB0I2COA0 Bits */
      __IO uint16_t bI2COA0             	:	10;  /* I2C own address */
      __IO uint16_t bOAEN               	:	1;  /* Own Address enable register */
      __I  uint16_t bRESERVED0          	:	4;  /* Reserved */
      __IO uint16_t bGCEN               	:	1;  /* General call response enable */
    } b;
  } rI2COA0;
  union {    /* UCB0I2COA1 Register */
    __IO uint16_t r;
    struct { /* UCB0I2COA1 Bits */
      __IO uint16_t bI2COA1             	:	10;  /* I2C own address */
      __IO uint16_t bOAEN               	:	1;  /* Own Address enable register */
      __I  uint16_t bRESERVED0          	:	5;  /* Reserved */
    } b;
  } rI2COA1;
  union {    /* UCB0I2COA2 Register */
    __IO uint16_t r;
    struct { /* UCB0I2COA2 Bits */
      __IO uint16_t bI2COA2             	:	10;  /* I2C own address */
      __IO uint16_t bOAEN               	:	1;  /* Own Address enable register */
      __I  uint16_t bRESERVED0          	:	5;  /* Reserved */
    } b;
  } rI2COA2;
  union {    /* UCB0I2COA3 Register */
    __IO uint16_t r;
    struct { /* UCB0I2COA3 Bits */
      __IO uint16_t bI2COA3             	:	10;  /* I2C own address */
      __IO uint16_t bOAEN               	:	1;  /* Own Address enable register */
      __I  uint16_t bRESERVED0          	:	5;  /* Reserved */
    } b;
  } rI2COA3;
  union {    /* UCB0ADDRX Register */
    __I uint16_t r;
    struct { /* UCB0ADDRX Bits */
      __I  uint16_t bADDRX              	:	10;  /* Received Address Register */
      __I  uint16_t bRESERVED0          	:	6;  /* Reserved */
    } b;
  } rADDRX;
  union {    /* UCB0ADDMASK Register */
    __IO uint16_t r;
    struct { /* UCB0ADDMASK Bits */
      __IO uint16_t bADDMASK            	:	10;  /*  */
      __I  uint16_t bRESERVED0          	:	6;  /* Reserved */
    } b;
  } rADDMASK;
  union {    /* UCB0I2CSA Register */
    __IO uint16_t r;
    struct { /* UCB0I2CSA Bits */
      __IO uint16_t bI2CSA              	:	10;  /* I2C slave address */
      __I  uint16_t bRESERVED0          	:	6;  /* Reserved */
    } b;
  } rI2CSA;
  uint8_t  RESERVED2[8];
  union {    /* UCB0IE Register */
    __IO uint16_t r;
    struct { /* UCB0IE Bits */
      __IO uint16_t bRXIE0              	:	1;  /* Receive interrupt enable 0 */
      __IO uint16_t bTXIE0              	:	1;  /* Transmit interrupt enable 0 */
      __IO uint16_t bSTTIE              	:	1;  /* START condition interrupt enable */
      __IO uint16_t bSTPIE              	:	1;  /* STOP condition interrupt enable */
      __IO uint16_t bALIE               	:	1;  /* Arbitration lost interrupt enable */
      __IO uint16_t bNACKIE             	:	1;  /* Not-acknowledge interrupt enable */
      __IO uint16_t bBCNTIE             	:	1;  /* Byte counter interrupt enable */
      __IO uint16_t bCLTOIE             	:	1;  /* Clock low timeout interrupt enable */
      __IO uint16_t bRXIE1              	:	1;  /* Receive interrupt enable 1 */
      __IO uint16_t bTXIE1              	:	1;  /* Transmit interrupt enable 1 */
      __IO uint16_t bRXIE2              	:	1;  /* Receive interrupt enable 2 */
      __IO uint16_t bTXIE2              	:	1;  /* Transmit interrupt enable 2 */
      __IO uint16_t bRXIE3              	:	1;  /* Receive interrupt enable 3 */
      __IO uint16_t bTXIE3              	:	1;  /* Transmit interrupt enable 3 */
      __IO uint16_t bBIT9IE             	:	1;  /* Bit position 9 interrupt enable */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
    } b;
    struct { /* UCB0IE_SPI Bits */
      __IO uint16_t bRXIE               	:	1;  /* Receive interrupt enable */
      __IO uint16_t bTXIE               	:	1;  /* Transmit interrupt enable */
      __I  uint16_t bRESERVED           	:	14;  /* Reserved */
    } a;
  } rIE;
  union {    /* UCB0IFG Register */
    __IO uint16_t r;
    struct { /* UCB0IFG Bits */
      __IO uint16_t bRXIFG0             	:	1;  /* eUSCI_B receive interrupt flag 0 */
      __IO uint16_t bTXIFG0             	:	1;  /* eUSCI_B transmit interrupt flag 0 */
      __IO uint16_t bSTTIFG             	:	1;  /* START condition interrupt flag */
      __IO uint16_t bSTPIFG             	:	1;  /* STOP condition interrupt flag */
      __IO uint16_t bALIFG              	:	1;  /* Arbitration lost interrupt flag */
      __IO uint16_t bNACKIFG            	:	1;  /* Not-acknowledge received interrupt flag */
      __IO uint16_t bBCNTIFG            	:	1;  /* Byte counter interrupt flag */
      __IO uint16_t bCLTOIFG            	:	1;  /* Clock low timeout interrupt flag */
      __IO uint16_t bRXIFG1             	:	1;  /* eUSCI_B receive interrupt flag 1 */
      __IO uint16_t bTXIFG1             	:	1;  /* eUSCI_B transmit interrupt flag 1 */
      __IO uint16_t bRXIFG2             	:	1;  /* eUSCI_B receive interrupt flag 2 */
      __IO uint16_t bTXIFG2             	:	1;  /* eUSCI_B transmit interrupt flag 2 */
      __IO uint16_t bRXIFG3             	:	1;  /* eUSCI_B receive interrupt flag 3 */
      __IO uint16_t bTXIFG3             	:	1;  /* eUSCI_B transmit interrupt flag 3 */
      __IO uint16_t bBIT9IFG            	:	1;  /* Bit position 9 interrupt flag */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
    } b;
    struct { /* UCB0IFG_SPI Bits */
      __IO uint16_t bRXIFG              	:	1;  /* Receive interrupt flag */
      __IO uint16_t bTXIFG              	:	1;  /* Transmit interrupt flag */
      __I  uint16_t bRESERVED           	:	14;  /* Reserved */
    } a;
  } rIFG;
  __I uint16_t rIV; /* eUSCI_Bx Interrupt Vector Register */
} EUSCI_B0_Type;


