arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// AES256 Bits
//*****************************************************************************
/* AESACTL0[AESOP] Bits */
#define AESOP0                                             (0x0001)              /* AESOP Bit 0 */
#define AESOP1                                             (0x0002)              /* AESOP Bit 1 */
/* AESACTL0[AESOP] Bits */
#define AESOP_OFS                                          ( 0)                  /* AESOPx Offset */
#define AESOP_M                                            (0x0003)              /* AES operation */
//#define AESOP0                                             (0x0001)              /* AES operation */
//#define AESOP1                                             (0x0002)              /* AES operation */
#define AESOP_0                                            (0x0000)              /* Encryption */
#define AESOP_1                                            (0x0001)              /* Decryption. The provided key is the same key used for encryption */
#define AESOP_2                                            (0x0002)              /* Generate first round key required for decryption */
#define AESOP_3                                            (0x0003)              /* Decryption. The provided key is the first round key required for decryption */
/* AESACTL0[AESKL] Bits */
#define AESKL0                                             (0x0004)              /* AESKL Bit 0 */
#define AESKL1                                             (0x0008)              /* AESKL Bit 1 */
/* AESACTL0[AESKL] Bits */
#define AESKL_OFS                                          ( 2)                  /* AESKLx Offset */
#define AESKL_M                                            (0x000c)              /* AES key length */
//#define AESKL0                                             (0x0004)              /* AES key length */
//#define AESKL1                                             (0x0008)              /* AES key length */
#define AESKL_0                                            (0x0000)              /* AES128. The key size is 128 bit */
#define AESKL_1                                            (0x0004)              /* AES192. The key size is 192 bit. */
#define AESKL_2                                            (0x0008)              /* AES256. The key size is 256 bit */
#define AESKL__128BIT                                      (0x0000)              /* AES128. The key size is 128 bit */
#define AESKL__192BIT                                      (0x0004)              /* AES192. The key size is 192 bit. */
#define AESKL__256BIT                                      (0x0008)              /* AES256. The key size is 256 bit */
/* AESACTL0[AESCM] Bits */
#define AESCM0                                             (0x0020)              /* AESCM Bit 0 */
#define AESCM1                                             (0x0040)              /* AESCM Bit 1 */
/* AESACTL0[AESCM] Bits */
#define AESCM_OFS                                          ( 5)                  /* AESCMx Offset */
#define AESCM_M                                            (0x0060)              /* AES cipher mode select */
//#define AESCM0                                             (0x0020)              /* AES cipher mode select */
//#define AESCM1                                             (0x0040)              /* AES cipher mode select */
#define AESCM_0                                            (0x0000)              /* ECB */
#define AESCM_1                                            (0x0020)              /* CBC */
#define AESCM_2                                            (0x0040)              /* OFB */
#define AESCM_3                                            (0x0060)              /* CFB */
#define AESCM__ECB                                         (0x0000)              /* ECB */
#define AESCM__CBC                                         (0x0020)              /* CBC */
#define AESCM__OFB                                         (0x0040)              /* OFB */
#define AESCM__CFB                                         (0x0060)              /* CFB */
/* AESACTL0[AESSWRST] Bits */
#define AESSWRST_OFS                                       ( 7)                  /* AESSWRST Offset */
#define AESSWRST                                           (0x0080)              /* AES software reset */
/* AESACTL0[AESRDYIFG] Bits */
#define AESRDYIFG_OFS                                      ( 8)                  /* AESRDYIFG Offset */
#define AESRDYIFG                                          (0x0100)              /* AES ready interrupt flag */
/* AESACTL0[AESERRFG] Bits */
#define AESERRFG_OFS                                       (11)                  /* AESERRFG Offset */
#define AESERRFG                                           (0x0800)              /* AES error flag */
/* AESACTL0[AESRDYIE] Bits */
#define AESRDYIE_OFS                                       (12)                  /* AESRDYIE Offset */
#define AESRDYIE                                           (0x1000)              /* AES ready interrupt enable */
/* AESACTL0[AESCMEN] Bits */
#define AESCMEN_OFS                                        (15)                  /* AESCMEN Offset */
#define AESCMEN                                            (0x8000)              /* AES cipher mode enable */
/* AESACTL1[AESBLKCNT] Bits */
#define AESBLKCNT0                                         (0x0001)              /* AESBLKCNT Bit 0 */
#define AESBLKCNT1                                         (0x0002)              /* AESBLKCNT Bit 1 */
#define AESBLKCNT2                                         (0x0004)              /* AESBLKCNT Bit 2 */
#define AESBLKCNT3                                         (0x0008)              /* AESBLKCNT Bit 3 */
#define AESBLKCNT4                                         (0x0010)              /* AESBLKCNT Bit 4 */
#define AESBLKCNT5                                         (0x0020)              /* AESBLKCNT Bit 5 */
#define AESBLKCNT6                                         (0x0040)              /* AESBLKCNT Bit 6 */
#define AESBLKCNT7                                         (0x0080)              /* AESBLKCNT Bit 7 */
/* AESACTL1[AESBLKCNT] Bits */
#define AESBLKCNT_OFS                                      ( 0)                  /* AESBLKCNTx Offset */
#define AESBLKCNT_M                                        (0x00ff)              /* Cipher Block Counter */
/* AESASTAT[AESBUSY] Bits */
#define AESBUSY_OFS                                        ( 0)                  /* AESBUSY Offset */
#define AESBUSY                                            (0x0001)              /* AES accelerator module busy */
/* AESASTAT[AESKEYWR] Bits */
#define AESKEYWR_OFS                                       ( 1)                  /* AESKEYWR Offset */
#define AESKEYWR                                           (0x0002)              /* All 16 bytes written to AESAKEY */
/* AESASTAT[AESDINWR] Bits */
#define AESDINWR_OFS                                       ( 2)                  /* AESDINWR Offset */
#define AESDINWR                                           (0x0004)              /* All 16 bytes written to AESADIN, AESAXDIN or AESAXIN */
/* AESASTAT[AESDOUTRD] Bits */
#define AESDOUTRD_OFS                                      ( 3)                  /* AESDOUTRD Offset */
#define AESDOUTRD                                          (0x0008)              /* All 16 bytes read from AESADOUT */
/* AESASTAT[AESKEYCNT] Bits */
#define AESKEYCNT0                                         (0x0010)              /* AESKEYCNT Bit 0 */
#define AESKEYCNT1                                         (0x0020)              /* AESKEYCNT Bit 1 */
#define AESKEYCNT2                                         (0x0040)              /* AESKEYCNT Bit 2 */
#define AESKEYCNT3                                         (0x0080)              /* AESKEYCNT Bit 3 */
/* AESASTAT[AESKEYCNT] Bits */
#define AESKEYCNT_OFS                                      ( 4)                  /* AESKEYCNTx Offset */
#define AESKEYCNT_M                                        (0x00f0)              /* Bytes written via AESAKEY for AESKLx=00, half-words written via AESAKEY */
/* AESASTAT[AESDINCNT] Bits */
#define AESDINCNT0                                         (0x0100)              /* AESDINCNT Bit 0 */
#define AESDINCNT1                                         (0x0200)              /* AESDINCNT Bit 1 */
#define AESDINCNT2                                         (0x0400)              /* AESDINCNT Bit 2 */
#define AESDINCNT3                                         (0x0800)              /* AESDINCNT Bit 3 */
/* AESASTAT[AESDINCNT] Bits */
#define AESDINCNT_OFS                                      ( 8)                  /* AESDINCNTx Offset */
#define AESDINCNT_M                                        (0x0f00)              /* Bytes written via AESADIN, AESAXDIN or AESAXIN */
/* AESASTAT[AESDOUTCNT] Bits */
#define AESDOUTCNT0                                        (0x1000)              /* AESDOUTCNT Bit 0 */
#define AESDOUTCNT1                                        (0x2000)              /* AESDOUTCNT Bit 1 */
#define AESDOUTCNT2                                        (0x4000)              /* AESDOUTCNT Bit 2 */
#define AESDOUTCNT3                                        (0x8000)              /* AESDOUTCNT Bit 3 */
/* AESASTAT[AESDOUTCNT] Bits */
#define AESDOUTCNT_OFS                                     (12)                  /* AESDOUTCNTx Offset */
#define AESDOUTCNT_M                                       (0xf000)              /* Bytes read via AESADOUT */
/* AESAKEY[AESKEY0] Bits */
#define AESKEY00                                           (0x0001)              /* AESKEY0 Bit 0 */
#define AESKEY01                                           (0x0002)              /* AESKEY0 Bit 1 */
#define AESKEY02                                           (0x0004)              /* AESKEY0 Bit 2 */
#define AESKEY03                                           (0x0008)              /* AESKEY0 Bit 3 */
#define AESKEY04                                           (0x0010)              /* AESKEY0 Bit 4 */
#define AESKEY05                                           (0x0020)              /* AESKEY0 Bit 5 */
#define AESKEY06                                           (0x0040)              /* AESKEY0 Bit 6 */
#define AESKEY07                                           (0x0080)              /* AESKEY0 Bit 7 */
/* AESAKEY[AESKEY0] Bits */
#define AESKEY0_OFS                                        ( 0)                  /* AESKEY0x Offset */
#define AESKEY0_M                                          (0x00ff)              /* AES key byte n when AESAKEY is written as half-word */
/* AESAKEY[AESKEY1] Bits */
#define AESKEY10                                           (0x0100)              /* AESKEY1 Bit 0 */
#define AESKEY11                                           (0x0200)              /* AESKEY1 Bit 1 */
#define AESKEY12                                           (0x0400)              /* AESKEY1 Bit 2 */
#define AESKEY13                                           (0x0800)              /* AESKEY1 Bit 3 */
#define AESKEY14                                           (0x1000)              /* AESKEY1 Bit 4 */
#define AESKEY15                                           (0x2000)              /* AESKEY1 Bit 5 */
#define AESKEY16                                           (0x4000)              /* AESKEY1 Bit 6 */
#define AESKEY17                                           (0x8000)              /* AESKEY1 Bit 7 */
/* AESAKEY[AESKEY1] Bits */
#define AESKEY1_OFS                                        ( 8)                  /* AESKEY1x Offset */
#define AESKEY1_M                                          (0xff00)              /* AES key byte n+1 when AESAKEY is written as half-word */
/* AESADIN[AESDIN0] Bits */
#define AESDIN00                                           (0x0001)              /* AESDIN0 Bit 0 */
#define AESDIN01                                           (0x0002)              /* AESDIN0 Bit 1 */
#define AESDIN02                                           (0x0004)              /* AESDIN0 Bit 2 */
#define AESDIN03                                           (0x0008)              /* AESDIN0 Bit 3 */
#define AESDIN04                                           (0x0010)              /* AESDIN0 Bit 4 */
#define AESDIN05                                           (0x0020)              /* AESDIN0 Bit 5 */
#define AESDIN06                                           (0x0040)              /* AESDIN0 Bit 6 */
#define AESDIN07                                           (0x0080)              /* AESDIN0 Bit 7 */
/* AESADIN[AESDIN0] Bits */
#define AESDIN0_OFS                                        ( 0)                  /* AESDIN0x Offset */
#define AESDIN0_M                                          (0x00ff)              /* AES data in byte n when AESADIN is written as half-word */
/* AESADIN[AESDIN1] Bits */
#define AESDIN10                                           (0x0100)              /* AESDIN1 Bit 0 */
#define AESDIN11                                           (0x0200)              /* AESDIN1 Bit 1 */
#define AESDIN12                                           (0x0400)              /* AESDIN1 Bit 2 */
#define AESDIN13                                           (0x0800)              /* AESDIN1 Bit 3 */
#define AESDIN14                                           (0x1000)              /* AESDIN1 Bit 4 */
#define AESDIN15                                           (0x2000)              /* AESDIN1 Bit 5 */
#define AESDIN16                                           (0x4000)              /* AESDIN1 Bit 6 */
#define AESDIN17                                           (0x8000)              /* AESDIN1 Bit 7 */
/* AESADIN[AESDIN1] Bits */
#define AESDIN1_OFS                                        ( 8)                  /* AESDIN1x Offset */
#define AESDIN1_M                                          (0xff00)              /* AES data in byte n+1 when AESADIN is written as half-word */
/* AESADOUT[AESDOUT0] Bits */
#define AESDOUT00                                          (0x0001)              /* AESDOUT0 Bit 0 */
#define AESDOUT01                                          (0x0002)              /* AESDOUT0 Bit 1 */
#define AESDOUT02                                          (0x0004)              /* AESDOUT0 Bit 2 */
#define AESDOUT03                                          (0x0008)              /* AESDOUT0 Bit 3 */
#define AESDOUT04                                          (0x0010)              /* AESDOUT0 Bit 4 */
#define AESDOUT05                                          (0x0020)              /* AESDOUT0 Bit 5 */
#define AESDOUT06                                          (0x0040)              /* AESDOUT0 Bit 6 */
#define AESDOUT07                                          (0x0080)              /* AESDOUT0 Bit 7 */
/* AESADOUT[AESDOUT0] Bits */
#define AESDOUT0_OFS                                       ( 0)                  /* AESDOUT0x Offset */
#define AESDOUT0_M                                         (0x00ff)              /* AES data out byte n when AESADOUT is read as half-word */
/* AESADOUT[AESDOUT1] Bits */
#define AESDOUT10                                          (0x0100)              /* AESDOUT1 Bit 0 */
#define AESDOUT11                                          (0x0200)              /* AESDOUT1 Bit 1 */
#define AESDOUT12                                          (0x0400)              /* AESDOUT1 Bit 2 */
#define AESDOUT13                                          (0x0800)              /* AESDOUT1 Bit 3 */
#define AESDOUT14                                          (0x1000)              /* AESDOUT1 Bit 4 */
#define AESDOUT15                                          (0x2000)              /* AESDOUT1 Bit 5 */
#define AESDOUT16                                          (0x4000)              /* AESDOUT1 Bit 6 */
#define AESDOUT17                                          (0x8000)              /* AESDOUT1 Bit 7 */
/* AESADOUT[AESDOUT1] Bits */
#define AESDOUT1_OFS                                       ( 8)                  /* AESDOUT1x Offset */
#define AESDOUT1_M                                         (0xff00)              /* AES data out byte n+1 when AESADOUT is read as half-word */
/* AESAXDIN[AESXDIN0] Bits */
#define AESXDIN00                                          (0x0001)              /* AESXDIN0 Bit 0 */
#define AESXDIN01                                          (0x0002)              /* AESXDIN0 Bit 1 */
#define AESXDIN02                                          (0x0004)              /* AESXDIN0 Bit 2 */
#define AESXDIN03                                          (0x0008)              /* AESXDIN0 Bit 3 */
#define AESXDIN04                                          (0x0010)              /* AESXDIN0 Bit 4 */
#define AESXDIN05                                          (0x0020)              /* AESXDIN0 Bit 5 */
#define AESXDIN06                                          (0x0040)              /* AESXDIN0 Bit 6 */
#define AESXDIN07                                          (0x0080)              /* AESXDIN0 Bit 7 */
/* AESAXDIN[AESXDIN0] Bits */
#define AESXDIN0_OFS                                       ( 0)                  /* AESXDIN0x Offset */
#define AESXDIN0_M                                         (0x00ff)              /* AES data in byte n when AESAXDIN is written as half-word */
/* AESAXDIN[AESXDIN1] Bits */
#define AESXDIN10                                          (0x0100)              /* AESXDIN1 Bit 0 */
#define AESXDIN11                                          (0x0200)              /* AESXDIN1 Bit 1 */
#define AESXDIN12                                          (0x0400)              /* AESXDIN1 Bit 2 */
#define AESXDIN13                                          (0x0800)              /* AESXDIN1 Bit 3 */
#define AESXDIN14                                          (0x1000)              /* AESXDIN1 Bit 4 */
#define AESXDIN15                                          (0x2000)              /* AESXDIN1 Bit 5 */
#define AESXDIN16                                          (0x4000)              /* AESXDIN1 Bit 6 */
#define AESXDIN17                                          (0x8000)              /* AESXDIN1 Bit 7 */
/* AESAXDIN[AESXDIN1] Bits */
#define AESXDIN1_OFS                                       ( 8)                  /* AESXDIN1x Offset */
#define AESXDIN1_M                                         (0xff00)              /* AES data in byte n+1 when AESAXDIN is written as half-word */
/* AESAXIN[AESXIN0] Bits */
#define AESXIN00                                           (0x0001)              /* AESXIN0 Bit 0 */
#define AESXIN01                                           (0x0002)              /* AESXIN0 Bit 1 */
#define AESXIN02                                           (0x0004)              /* AESXIN0 Bit 2 */
#define AESXIN03                                           (0x0008)              /* AESXIN0 Bit 3 */
#define AESXIN04                                           (0x0010)              /* AESXIN0 Bit 4 */
#define AESXIN05                                           (0x0020)              /* AESXIN0 Bit 5 */
#define AESXIN06                                           (0x0040)              /* AESXIN0 Bit 6 */
#define AESXIN07                                           (0x0080)              /* AESXIN0 Bit 7 */
/* AESAXIN[AESXIN0] Bits */
#define AESXIN0_OFS                                        ( 0)                  /* AESXIN0x Offset */
#define AESXIN0_M                                          (0x00ff)              /* AES data in byte n when AESAXIN is written as half-word */
/* AESAXIN[AESXIN1] Bits */
#define AESXIN10                                           (0x0100)              /* AESXIN1 Bit 0 */
#define AESXIN11                                           (0x0200)              /* AESXIN1 Bit 1 */
#define AESXIN12                                           (0x0400)              /* AESXIN1 Bit 2 */
#define AESXIN13                                           (0x0800)              /* AESXIN1 Bit 3 */
#define AESXIN14                                           (0x1000)              /* AESXIN1 Bit 4 */
#define AESXIN15                                           (0x2000)              /* AESXIN1 Bit 5 */
#define AESXIN16                                           (0x4000)              /* AESXIN1 Bit 6 */
#define AESXIN17                                           (0x8000)              /* AESXIN1 Bit 7 */
/* AESAXIN[AESXIN1] Bits */
#define AESXIN1_OFS                                        ( 8)                  /* AESXIN1x Offset */
#define AESXIN1_M                                          (0xff00)              /* AES data in byte n+1 when AESAXIN is written as half-word */


