arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// CAPTIO0 Bits
//*****************************************************************************
/* CAPTIO0CTL[CAPTIOPISEL] Bits */
#define CAPTIOPISEL0                                       (0x0002)              /* CAPTIOPISEL Bit 0 */
#define CAPTIOPISEL1                                       (0x0004)              /* CAPTIOPISEL Bit 1 */
#define CAPTIOPISEL2                                       (0x0008)              /* CAPTIOPISEL Bit 2 */
/* CAPTIO0CTL[CAPTIOPISEL] Bits */
#define CAPTIOPISEL_OFS                                    ( 1)                  /* CAPTIOPISELx Offset */
#define CAPTIOPISEL_M                                      (0x000e)              /* Capacitive Touch IO pin select */
//#define CAPTIOPISEL0                                       (0x0002)              /* Capacitive Touch IO pin select */
//#define CAPTIOPISEL1                                       (0x0004)              /* Capacitive Touch IO pin select */
//#define CAPTIOPISEL2                                       (0x0008)              /* Capacitive Touch IO pin select */
#define CAPTIOPISEL_0                                      (0x0000)              /* Px.0 */
#define CAPTIOPISEL_1                                      (0x0002)              /* Px.1 */
#define CAPTIOPISEL_2                                      (0x0004)              /* Px.2 */
#define CAPTIOPISEL_3                                      (0x0006)              /* Px.3 */
#define CAPTIOPISEL_4                                      (0x0008)              /* Px.4 */
#define CAPTIOPISEL_5                                      (0x000a)              /* Px.5 */
#define CAPTIOPISEL_6                                      (0x000c)              /* Px.6 */
#define CAPTIOPISEL_7                                      (0x000e)              /* Px.7 */
/* CAPTIO0CTL[CAPTIOPOSEL] Bits */
#define CAPTIOPOSEL0                                       (0x0010)              /* CAPTIOPOSEL Bit 0 */
#define CAPTIOPOSEL1                                       (0x0020)              /* CAPTIOPOSEL Bit 1 */
#define CAPTIOPOSEL2                                       (0x0040)              /* CAPTIOPOSEL Bit 2 */
#define CAPTIOPOSEL3                                       (0x0080)              /* CAPTIOPOSEL Bit 3 */
/* CAPTIO0CTL[CAPTIOPOSEL] Bits */
#define CAPTIOPOSEL_OFS                                    ( 4)                  /* CAPTIOPOSELx Offset */
#define CAPTIOPOSEL_M                                      (0x00f0)              /* Capacitive Touch IO port select */
//#define CAPTIOPOSEL0                                       (0x0010)              /* Capacitive Touch IO port select */
//#define CAPTIOPOSEL1                                       (0x0020)              /* Capacitive Touch IO port select */
//#define CAPTIOPOSEL2                                       (0x0040)              /* Capacitive Touch IO port select */
//#define CAPTIOPOSEL3                                       (0x0080)              /* Capacitive Touch IO port select */
#define CAPTIOPOSEL_0                                      (0x0000)              /* Px = PJ */
#define CAPTIOPOSEL_1                                      (0x0010)              /* Px = P1 */
#define CAPTIOPOSEL_2                                      (0x0020)              /* Px = P2 */
#define CAPTIOPOSEL_3                                      (0x0030)              /* Px = P3 */
#define CAPTIOPOSEL_4                                      (0x0040)              /* Px = P4 */
#define CAPTIOPOSEL_5                                      (0x0050)              /* Px = P5 */
#define CAPTIOPOSEL_6                                      (0x0060)              /* Px = P6 */
#define CAPTIOPOSEL_7                                      (0x0070)              /* Px = P7 */
#define CAPTIOPOSEL_8                                      (0x0080)              /* Px = P8 */
#define CAPTIOPOSEL_9                                      (0x0090)              /* Px = P9 */
#define CAPTIOPOSEL_10                                     (0x00a0)              /* Px = P10 */
#define CAPTIOPOSEL_11                                     (0x00b0)              /* Px = P11 */
#define CAPTIOPOSEL_12                                     (0x00c0)              /* Px = P12 */
#define CAPTIOPOSEL_13                                     (0x00d0)              /* Px = P13 */
#define CAPTIOPOSEL_14                                     (0x00e0)              /* Px = P14 */
#define CAPTIOPOSEL_15                                     (0x00f0)              /* Px = P15 */
#define CAPTIOPOSEL__PJ                                    (0x0000)              /* Px = PJ */
#define CAPTIOPOSEL__P1                                    (0x0010)              /* Px = P1 */
#define CAPTIOPOSEL__P2                                    (0x0020)              /* Px = P2 */
#define CAPTIOPOSEL__P3                                    (0x0030)              /* Px = P3 */
#define CAPTIOPOSEL__P4                                    (0x0040)              /* Px = P4 */
#define CAPTIOPOSEL__P5                                    (0x0050)              /* Px = P5 */
#define CAPTIOPOSEL__P6                                    (0x0060)              /* Px = P6 */
#define CAPTIOPOSEL__P7                                    (0x0070)              /* Px = P7 */
#define CAPTIOPOSEL__P8                                    (0x0080)              /* Px = P8 */
#define CAPTIOPOSEL__P9                                    (0x0090)              /* Px = P9 */
#define CAPTIOPOSEL__P10                                   (0x00a0)              /* Px = P10 */
#define CAPTIOPOSEL__P11                                   (0x00b0)              /* Px = P11 */
#define CAPTIOPOSEL__P12                                   (0x00c0)              /* Px = P12 */
#define CAPTIOPOSEL__P13                                   (0x00d0)              /* Px = P13 */
#define CAPTIOPOSEL__P14                                   (0x00e0)              /* Px = P14 */
#define CAPTIOPOSEL__P15                                   (0x00f0)              /* Px = P15 */
/* CAPTIO0CTL[CAPTIOEN] Bits */
#define CAPTIOEN_OFS                                       ( 8)                  /* CAPTIOEN Offset */
#define CAPTIOEN                                           (0x0100)              /* Capacitive Touch IO enable */
/* CAPTIO0CTL[CAPTIOSTATE] Bits */
#define CAPTIOSTATE_OFS                                    ( 9)                  /* CAPTIOSTATE Offset */
#define CAPTIOSTATE                                        (0x0200)              /* Capacitive Touch IO state */


//*****************************************************************************
// CAPTIO1 Bits
//*****************************************************************************
/* CAPTIO1CTL[CAPTIOPISEL] Bits */
//#define CAPTIOPISEL0                                       (0x0002)              /* CAPTIOPISEL Bit 0 */
//#define CAPTIOPISEL1                                       (0x0004)              /* CAPTIOPISEL Bit 1 */
//#define CAPTIOPISEL2                                       (0x0008)              /* CAPTIOPISEL Bit 2 */
/* CAPTIO1CTL[CAPTIOPISEL] Bits */
//#define CAPTIOPISEL_OFS                                    ( 1)                  /* CAPTIOPISELx Offset */
//#define CAPTIOPISEL_M                                      (0x000e)              /* Capacitive Touch IO pin select */
//#define CAPTIOPISEL0                                       (0x0002)              /* Capacitive Touch IO pin select */
//#define CAPTIOPISEL1                                       (0x0004)              /* Capacitive Touch IO pin select */
//#define CAPTIOPISEL2                                       (0x0008)              /* Capacitive Touch IO pin select */
//#define CAPTIOPISEL_0                                      (0x0000)              /* Px.0 */
//#define CAPTIOPISEL_1                                      (0x0002)              /* Px.1 */
//#define CAPTIOPISEL_2                                      (0x0004)              /* Px.2 */
//#define CAPTIOPISEL_3                                      (0x0006)              /* Px.3 */
//#define CAPTIOPISEL_4                                      (0x0008)              /* Px.4 */
//#define CAPTIOPISEL_5                                      (0x000a)              /* Px.5 */
//#define CAPTIOPISEL_6                                      (0x000c)              /* Px.6 */
//#define CAPTIOPISEL_7                                      (0x000e)              /* Px.7 */
/* CAPTIO1CTL[CAPTIOPOSEL] Bits */
//#define CAPTIOPOSEL0                                       (0x0010)              /* CAPTIOPOSEL Bit 0 */
//#define CAPTIOPOSEL1                                       (0x0020)              /* CAPTIOPOSEL Bit 1 */
//#define CAPTIOPOSEL2                                       (0x0040)              /* CAPTIOPOSEL Bit 2 */
//#define CAPTIOPOSEL3                                       (0x0080)              /* CAPTIOPOSEL Bit 3 */
/* CAPTIO1CTL[CAPTIOPOSEL] Bits */
//#define CAPTIOPOSEL_OFS                                    ( 4)                  /* CAPTIOPOSELx Offset */
//#define CAPTIOPOSEL_M                                      (0x00f0)              /* Capacitive Touch IO port select */
//#define CAPTIOPOSEL0                                       (0x0010)              /* Capacitive Touch IO port select */
//#define CAPTIOPOSEL1                                       (0x0020)              /* Capacitive Touch IO port select */
//#define CAPTIOPOSEL2                                       (0x0040)              /* Capacitive Touch IO port select */
//#define CAPTIOPOSEL3                                       (0x0080)              /* Capacitive Touch IO port select */
//#define CAPTIOPOSEL_0                                      (0x0000)              /* Px = PJ */
//#define CAPTIOPOSEL_1                                      (0x0010)              /* Px = P1 */
//#define CAPTIOPOSEL_2                                      (0x0020)              /* Px = P2 */
//#define CAPTIOPOSEL_3                                      (0x0030)              /* Px = P3 */
//#define CAPTIOPOSEL_4                                      (0x0040)              /* Px = P4 */
//#define CAPTIOPOSEL_5                                      (0x0050)              /* Px = P5 */
//#define CAPTIOPOSEL_6                                      (0x0060)              /* Px = P6 */
//#define CAPTIOPOSEL_7                                      (0x0070)              /* Px = P7 */
//#define CAPTIOPOSEL_8                                      (0x0080)              /* Px = P8 */
//#define CAPTIOPOSEL_9                                      (0x0090)              /* Px = P9 */
//#define CAPTIOPOSEL_10                                     (0x00a0)              /* Px = P10 */
//#define CAPTIOPOSEL_11                                     (0x00b0)              /* Px = P11 */
//#define CAPTIOPOSEL_12                                     (0x00c0)              /* Px = P12 */
//#define CAPTIOPOSEL_13                                     (0x00d0)              /* Px = P13 */
//#define CAPTIOPOSEL_14                                     (0x00e0)              /* Px = P14 */
//#define CAPTIOPOSEL_15                                     (0x00f0)              /* Px = P15 */
//#define CAPTIOPOSEL__PJ                                    (0x0000)              /* Px = PJ */
//#define CAPTIOPOSEL__P1                                    (0x0010)              /* Px = P1 */
//#define CAPTIOPOSEL__P2                                    (0x0020)              /* Px = P2 */
//#define CAPTIOPOSEL__P3                                    (0x0030)              /* Px = P3 */
//#define CAPTIOPOSEL__P4                                    (0x0040)              /* Px = P4 */
//#define CAPTIOPOSEL__P5                                    (0x0050)              /* Px = P5 */
//#define CAPTIOPOSEL__P6                                    (0x0060)              /* Px = P6 */
//#define CAPTIOPOSEL__P7                                    (0x0070)              /* Px = P7 */
//#define CAPTIOPOSEL__P8                                    (0x0080)              /* Px = P8 */
//#define CAPTIOPOSEL__P9                                    (0x0090)              /* Px = P9 */
//#define CAPTIOPOSEL__P10                                   (0x00a0)              /* Px = P10 */
//#define CAPTIOPOSEL__P11                                   (0x00b0)              /* Px = P11 */
//#define CAPTIOPOSEL__P12                                   (0x00c0)              /* Px = P12 */
//#define CAPTIOPOSEL__P13                                   (0x00d0)              /* Px = P13 */
//#define CAPTIOPOSEL__P14                                   (0x00e0)              /* Px = P14 */
//#define CAPTIOPOSEL__P15                                   (0x00f0)              /* Px = P15 */
/* CAPTIO1CTL[CAPTIOEN] Bits */
//#define CAPTIOEN_OFS                                       ( 8)                  /* CAPTIOEN Offset */
//#define CAPTIOEN                                           (0x0100)              /* Capacitive Touch IO enable */
/* CAPTIO1CTL[CAPTIOSTATE] Bits */
//#define CAPTIOSTATE_OFS                                    ( 9)                  /* CAPTIOSTATE Offset */
//#define CAPTIOSTATE                                        (0x0200)              /* Capacitive Touch IO state */


