arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// COMP_E0 Bits
//*****************************************************************************
/* CE0CTL0[CEIPSEL] Bits */
#define CEIPSEL_OFS                                        ( 0)                  /* CEIPSEL Offset */
#define CEIPSEL_M                                          (0x000f)              /* Channel input selected for the V+ terminal */
#define CEIPSEL0                                           (0x0001)              /* Channel input selected for the V+ terminal */
#define CEIPSEL1                                           (0x0002)              /* Channel input selected for the V+ terminal */
#define CEIPSEL2                                           (0x0004)              /* Channel input selected for the V+ terminal */
#define CEIPSEL3                                           (0x0008)              /* Channel input selected for the V+ terminal */
#define CEIPSEL_0                                          (0x0000)              /* Channel 0 selected */
#define CEIPSEL_1                                          (0x0001)              /* Channel 1 selected */
#define CEIPSEL_2                                          (0x0002)              /* Channel 2 selected */
#define CEIPSEL_3                                          (0x0003)              /* Channel 3 selected */
#define CEIPSEL_4                                          (0x0004)              /* Channel 4 selected */
#define CEIPSEL_5                                          (0x0005)              /* Channel 5 selected */
#define CEIPSEL_6                                          (0x0006)              /* Channel 6 selected */
#define CEIPSEL_7                                          (0x0007)              /* Channel 7 selected */
#define CEIPSEL_8                                          (0x0008)              /* Channel 8 selected */
#define CEIPSEL_9                                          (0x0009)              /* Channel 9 selected */
#define CEIPSEL_10                                         (0x000a)              /* Channel 10 selected */
#define CEIPSEL_11                                         (0x000b)              /* Channel 11 selected */
#define CEIPSEL_12                                         (0x000c)              /* Channel 12 selected */
#define CEIPSEL_13                                         (0x000d)              /* Channel 13 selected */
#define CEIPSEL_14                                         (0x000e)              /* Channel 14 selected */
#define CEIPSEL_15                                         (0x000f)              /* Channel 15 selected */
/* CE0CTL0[CEIPEN] Bits */
#define CEIPEN_OFS                                         ( 7)                  /* CEIPEN Offset */
#define CEIPEN                                             (0x0080)              /* Channel input enable for the V+ terminal */
/* CE0CTL0[CEIMSEL] Bits */
#define CEIMSEL_OFS                                        ( 8)                  /* CEIMSEL Offset */
#define CEIMSEL_M                                          (0x0f00)              /* Channel input selected for the - terminal */
#define CEIMSEL0                                           (0x0100)              /* Channel input selected for the - terminal */
#define CEIMSEL1                                           (0x0200)              /* Channel input selected for the - terminal */
#define CEIMSEL2                                           (0x0400)              /* Channel input selected for the - terminal */
#define CEIMSEL3                                           (0x0800)              /* Channel input selected for the - terminal */
#define CEIMSEL_0                                          (0x0000)              /* Channel 0 selected */
#define CEIMSEL_1                                          (0x0100)              /* Channel 1 selected */
#define CEIMSEL_2                                          (0x0200)              /* Channel 2 selected */
#define CEIMSEL_3                                          (0x0300)              /* Channel 3 selected */
#define CEIMSEL_4                                          (0x0400)              /* Channel 4 selected */
#define CEIMSEL_5                                          (0x0500)              /* Channel 5 selected */
#define CEIMSEL_6                                          (0x0600)              /* Channel 6 selected */
#define CEIMSEL_7                                          (0x0700)              /* Channel 7 selected */
#define CEIMSEL_8                                          (0x0800)              /* Channel 8 selected */
#define CEIMSEL_9                                          (0x0900)              /* Channel 9 selected */
#define CEIMSEL_10                                         (0x0a00)              /* Channel 10 selected */
#define CEIMSEL_11                                         (0x0b00)              /* Channel 11 selected */
#define CEIMSEL_12                                         (0x0c00)              /* Channel 12 selected */
#define CEIMSEL_13                                         (0x0d00)              /* Channel 13 selected */
#define CEIMSEL_14                                         (0x0e00)              /* Channel 14 selected */
#define CEIMSEL_15                                         (0x0f00)              /* Channel 15 selected */
/* CE0CTL0[CEIMEN] Bits */
#define CEIMEN_OFS                                         (15)                  /* CEIMEN Offset */
#define CEIMEN                                             (0x8000)              /* Channel input enable for the - terminal */
/* CE0CTL1[CEOUT] Bits */
#define CEOUT_OFS                                          ( 0)                  /* CEOUT Offset */
#define CEOUT                                              (0x0001)              /* Comparator output value */
/* CE0CTL1[CEOUTPOL] Bits */
#define CEOUTPOL_OFS                                       ( 1)                  /* CEOUTPOL Offset */
#define CEOUTPOL                                           (0x0002)              /* Comparator output polarity */
/* CE0CTL1[CEF] Bits */
#define CEF_OFS                                            ( 2)                  /* CEF Offset */
#define CEF                                                (0x0004)              /* Comparator output filter */
/* CE0CTL1[CEIES] Bits */
#define CEIES_OFS                                          ( 3)                  /* CEIES Offset */
#define CEIES                                              (0x0008)              /* Interrupt edge select for CEIIFG and CEIFG */
/* CE0CTL1[CESHORT] Bits */
#define CESHORT_OFS                                        ( 4)                  /* CESHORT Offset */
#define CESHORT                                            (0x0010)              /* Input short */
/* CE0CTL1[CEEX] Bits */
#define CEEX_OFS                                           ( 5)                  /* CEEX Offset */
#define CEEX                                               (0x0020)              /* Exchange */
/* CE0CTL1[CEFDLY] Bits */
#define CEFDLY_OFS                                         ( 6)                  /* CEFDLY Offset */
#define CEFDLY_M                                           (0x00c0)              /* Filter delay */
#define CEFDLY0                                            (0x0040)              /* Filter delay */
#define CEFDLY1                                            (0x0080)              /* Filter delay */
#define CEFDLY_0                                           (0x0000)              /* Typical filter delay of TBD (450) ns */
#define CEFDLY_1                                           (0x0040)              /* Typical filter delay of TBD (900) ns */
#define CEFDLY_2                                           (0x0080)              /* Typical filter delay of TBD (1800) ns */
#define CEFDLY_3                                           (0x00c0)              /* Typical filter delay of TBD (3600) ns */
/* CE0CTL1[CEPWRMD] Bits */
#define CEPWRMD_OFS                                        ( 8)                  /* CEPWRMD Offset */
#define CEPWRMD_M                                          (0x0300)              /* Power Mode */
#define CEPWRMD0                                           (0x0100)              /* Power Mode */
#define CEPWRMD1                                           (0x0200)              /* Power Mode */
#define CEPWRMD_0                                          (0x0000)              /* High-speed mode */
#define CEPWRMD_1                                          (0x0100)              /* Normal mode */
#define CEPWRMD_2                                          (0x0200)              /* Ultra-low power mode */
/* CE0CTL1[CEON] Bits */
#define CEON_OFS                                           (10)                  /* CEON Offset */
#define CEON                                               (0x0400)              /* Comparator On */
/* CE0CTL1[CEMRVL] Bits */
#define CEMRVL_OFS                                         (11)                  /* CEMRVL Offset */
#define CEMRVL                                             (0x0800)              /* This bit is valid of CEMRVS is set to 1 */
/* CE0CTL1[CEMRVS] Bits */
#define CEMRVS_OFS                                         (12)                  /* CEMRVS Offset */
#define CEMRVS                                             (0x1000)              /*  */
/* CE0CTL2[CEREF0] Bits */
#define CEREF0_OFS                                         ( 0)                  /* CEREF0 Offset */
#define CEREF0_M                                           (0x001f)              /* Reference resistor tap 0 */
/* CE0CTL2[CERSEL] Bits */
#define CERSEL_OFS                                         ( 5)                  /* CERSEL Offset */
#define CERSEL                                             (0x0020)              /* Reference select */
/* CE0CTL2[CERS] Bits */
#define CERS_OFS                                           ( 6)                  /* CERS Offset */
#define CERS_M                                             (0x00c0)              /* Reference source */
#define CERS0                                              (0x0040)              /* Reference source */
#define CERS1                                              (0x0080)              /* Reference source */
#define CERS_0                                             (0x0000)              /* No current is drawn by the reference circuitry */
#define CERS_1                                             (0x0040)              /* VCC applied to the resistor ladder */
#define CERS_2                                             (0x0080)              /* Shared reference voltage applied to the resistor ladder */
#define CERS_3                                             (0x00c0)              /* Shared reference voltage supplied to V(CREF). Resistor ladder is off */
/* CE0CTL2[CEREF1] Bits */
#define CEREF1_OFS                                         ( 8)                  /* CEREF1 Offset */
#define CEREF1_M                                           (0x1f00)              /* Reference resistor tap 1 */
/* CE0CTL2[CEREFL] Bits */
#define CEREFL_OFS                                         (13)                  /* CEREFL Offset */
#define CEREFL_M                                           (0x6000)              /* Reference voltage level */
#define CEREFL0                                            (0x2000)              /* Reference voltage level */
#define CEREFL1                                            (0x4000)              /* Reference voltage level */
#define CEREFL_0                                           (0x0000)              /* Reference amplifier is disabled. No reference voltage is requested */
#define CEREFL_1                                           (0x2000)              /* 1.2 V is selected as shared reference voltage input */
#define CEREFL_2                                           (0x4000)              /* 2.0 V is selected as shared reference voltage input */
#define CEREFL_3                                           (0x6000)              /* 2.5 V is selected as shared reference voltage input */
#define CEREFL__OFF                                        (0x0000)              /* Reference amplifier is disabled. No reference voltage is requested */
#define CEREFL__1P2V                                       (0x2000)              /* 1.2 V is selected as shared reference voltage input */
#define CEREFL__2P0V                                       (0x4000)              /* 2.0 V is selected as shared reference voltage input */
#define CEREFL__2P5V                                       (0x6000)              /* 2.5 V is selected as shared reference voltage input */
/* CE0CTL2[CEREFACC] Bits */
#define CEREFACC_OFS                                       (15)                  /* CEREFACC Offset */
#define CEREFACC                                           (0x8000)              /* Reference accuracy */
/* CE0CTL3[CEPD0] Bits */
#define CEPD0_OFS                                          ( 0)                  /* CEPD0 Offset */
#define CEPD0                                              (0x0001)              /* Port disable */
/* CE0CTL3[CEPD1] Bits */
#define CEPD1_OFS                                          ( 1)                  /* CEPD1 Offset */
#define CEPD1                                              (0x0002)              /* Port disable */
/* CE0CTL3[CEPD2] Bits */
#define CEPD2_OFS                                          ( 2)                  /* CEPD2 Offset */
#define CEPD2                                              (0x0004)              /* Port disable */
/* CE0CTL3[CEPD3] Bits */
#define CEPD3_OFS                                          ( 3)                  /* CEPD3 Offset */
#define CEPD3                                              (0x0008)              /* Port disable */
/* CE0CTL3[CEPD4] Bits */
#define CEPD4_OFS                                          ( 4)                  /* CEPD4 Offset */
#define CEPD4                                              (0x0010)              /* Port disable */
/* CE0CTL3[CEPD5] Bits */
#define CEPD5_OFS                                          ( 5)                  /* CEPD5 Offset */
#define CEPD5                                              (0x0020)              /* Port disable */
/* CE0CTL3[CEPD6] Bits */
#define CEPD6_OFS                                          ( 6)                  /* CEPD6 Offset */
#define CEPD6                                              (0x0040)              /* Port disable */
/* CE0CTL3[CEPD7] Bits */
#define CEPD7_OFS                                          ( 7)                  /* CEPD7 Offset */
#define CEPD7                                              (0x0080)              /* Port disable */
/* CE0CTL3[CEPD8] Bits */
#define CEPD8_OFS                                          ( 8)                  /* CEPD8 Offset */
#define CEPD8                                              (0x0100)              /* Port disable */
/* CE0CTL3[CEPD9] Bits */
#define CEPD9_OFS                                          ( 9)                  /* CEPD9 Offset */
#define CEPD9                                              (0x0200)              /* Port disable */
/* CE0CTL3[CEPD10] Bits */
#define CEPD10_OFS                                         (10)                  /* CEPD10 Offset */
#define CEPD10                                             (0x0400)              /* Port disable */
/* CE0CTL3[CEPD11] Bits */
#define CEPD11_OFS                                         (11)                  /* CEPD11 Offset */
#define CEPD11                                             (0x0800)              /* Port disable */
/* CE0CTL3[CEPD12] Bits */
#define CEPD12_OFS                                         (12)                  /* CEPD12 Offset */
#define CEPD12                                             (0x1000)              /* Port disable */
/* CE0CTL3[CEPD13] Bits */
#define CEPD13_OFS                                         (13)                  /* CEPD13 Offset */
#define CEPD13                                             (0x2000)              /* Port disable */
/* CE0CTL3[CEPD14] Bits */
#define CEPD14_OFS                                         (14)                  /* CEPD14 Offset */
#define CEPD14                                             (0x4000)              /* Port disable */
/* CE0CTL3[CEPD15] Bits */
#define CEPD15_OFS                                         (15)                  /* CEPD15 Offset */
#define CEPD15                                             (0x8000)              /* Port disable */
/* CE0INT[CEIFG] Bits */
#define CEIFG_OFS                                          ( 0)                  /* CEIFG Offset */
#define CEIFG                                              (0x0001)              /* Comparator output interrupt flag */
/* CE0INT[CEIIFG] Bits */
#define CEIIFG_OFS                                         ( 1)                  /* CEIIFG Offset */
#define CEIIFG                                             (0x0002)              /* Comparator output inverted interrupt flag */
/* CE0INT[CERDYIFG] Bits */
#define CERDYIFG_OFS                                       ( 4)                  /* CERDYIFG Offset */
#define CERDYIFG                                           (0x0010)              /* Comparator ready interrupt flag */
/* CE0INT[CEIE] Bits */
#define CEIE_OFS                                           ( 8)                  /* CEIE Offset */
#define CEIE                                               (0x0100)              /* Comparator output interrupt enable */
/* CE0INT[CEIIE] Bits */
#define CEIIE_OFS                                          ( 9)                  /* CEIIE Offset */
#define CEIIE                                              (0x0200)              /* Comparator output interrupt enable inverted polarity */
/* CE0INT[CERDYIE] Bits */
#define CERDYIE_OFS                                        (12)                  /* CERDYIE Offset */
#define CERDYIE                                            (0x1000)              /* Comparator ready interrupt enable */


