arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH15] Bits */
#define DMA_INT0_CLRFLG_CH15_OFS                           (15)                  /* CH15 Offset */
#define DMA_INT0_CLRFLG_CH15                               (0x00008000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH16] Bits */
#define DMA_INT0_CLRFLG_CH16_OFS                           (16)                  /* CH16 Offset */
#define DMA_INT0_CLRFLG_CH16                               (0x00010000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH17] Bits */
#define DMA_INT0_CLRFLG_CH17_OFS                           (17)                  /* CH17 Offset */
#define DMA_INT0_CLRFLG_CH17                               (0x00020000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH18] Bits */
#define DMA_INT0_CLRFLG_CH18_OFS                           (18)                  /* CH18 Offset */
#define DMA_INT0_CLRFLG_CH18                               (0x00040000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH19] Bits */
#define DMA_INT0_CLRFLG_CH19_OFS                           (19)                  /* CH19 Offset */
#define DMA_INT0_CLRFLG_CH19                               (0x00080000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH20] Bits */
#define DMA_INT0_CLRFLG_CH20_OFS                           (20)                  /* CH20 Offset */
#define DMA_INT0_CLRFLG_CH20                               (0x00100000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH21] Bits */
#define DMA_INT0_CLRFLG_CH21_OFS                           (21)                  /* CH21 Offset */
#define DMA_INT0_CLRFLG_CH21                               (0x00200000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH22] Bits */
#define DMA_INT0_CLRFLG_CH22_OFS                           (22)                  /* CH22 Offset */
#define DMA_INT0_CLRFLG_CH22                               (0x00400000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH23] Bits */
#define DMA_INT0_CLRFLG_CH23_OFS                           (23)                  /* CH23 Offset */
#define DMA_INT0_CLRFLG_CH23                               (0x00800000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH24] Bits */
#define DMA_INT0_CLRFLG_CH24_OFS                           (24)                  /* CH24 Offset */
#define DMA_INT0_CLRFLG_CH24                               (0x01000000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH25] Bits */
#define DMA_INT0_CLRFLG_CH25_OFS                           (25)                  /* CH25 Offset */
#define DMA_INT0_CLRFLG_CH25                               (0x02000000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH26] Bits */
#define DMA_INT0_CLRFLG_CH26_OFS                           (26)                  /* CH26 Offset */
#define DMA_INT0_CLRFLG_CH26                               (0x04000000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH27] Bits */
#define DMA_INT0_CLRFLG_CH27_OFS                           (27)                  /* CH27 Offset */
#define DMA_INT0_CLRFLG_CH27                               (0x08000000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH28] Bits */
#define DMA_INT0_CLRFLG_CH28_OFS                           (28)                  /* CH28 Offset */
#define DMA_INT0_CLRFLG_CH28                               (0x10000000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH29] Bits */
#define DMA_INT0_CLRFLG_CH29_OFS                           (29)                  /* CH29 Offset */
#define DMA_INT0_CLRFLG_CH29                               (0x20000000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH30] Bits */
#define DMA_INT0_CLRFLG_CH30_OFS                           (30)                  /* CH30 Offset */
#define DMA_INT0_CLRFLG_CH30                               (0x40000000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_INT0_CLRFLG[DMA_INT0_CLRFLG_CH31] Bits */
#define DMA_INT0_CLRFLG_CH31_OFS                           (31)                  /* CH31 Offset */
#define DMA_INT0_CLRFLG_CH31                               (0x80000000)          /* Clear corresponding DMA_INT0_SRCFLG_REG */
/* DMA_STAT[DMA_STAT_MASTEN] Bits */
#define DMA_STAT_MASTEN_OFS                                ( 0)                  /* MASTEN Offset */
#define DMA_STAT_MASTEN                                    (0x00000001)          /*  */
/* DMA_STAT[DMA_STAT_] Bits */
#define DMA_STAT__OFS                                      ( 4)                  /* STATE Offset */
#define DMA_STAT__M                                        (0x000000f0)          /*  */
#define DMA_STAT_0                                         (0x00000010)          /*  */
#define DMA_STAT_1                                         (0x00000020)          /*  */
#define DMA_STAT_2                                         (0x00000040)          /*  */
#define DMA_STAT_3                                         (0x00000080)          /*  */
#define DMA_STAT__0                                        (0x00000000)          /* idle */
#define DMA_STAT__1                                        (0x00000010)          /* reading channel controller data */
#define DMA_STAT__2                                        (0x00000020)          /* reading source data end pointer */
#define DMA_STAT__3                                        (0x00000030)          /* reading destination data end pointer */
#define DMA_STAT__4                                        (0x00000040)          /* reading source data */
#define DMA_STAT__5                                        (0x00000050)          /* writing destination data */
#define DMA_STAT__6                                        (0x00000060)          /* waiting for DMA request to clear */
#define DMA_STAT__7                                        (0x00000070)          /* writing channel controller data */
#define DMA_STAT__8                                        (0x00000080)          /* stalled */
#define DMA_STAT__9                                        (0x00000090)          /* done */
#define DMA_STAT__10                                       (0x000000a0)          /* peripheral scatter-gather transition */
#define DMA_STAT__11                                       (0x000000b0)          /* Reserved */
#define DMA_STAT__12                                       (0x000000c0)          /* Reserved */
#define DMA_STAT__13                                       (0x000000d0)          /* Reserved */
#define DMA_STAT__14                                       (0x000000e0)          /* Reserved */
#define DMA_STAT__15                                       (0x000000f0)          /* Reserved */
/* DMA_STAT[DMA_STAT_] Bits */
//#define DMA_STAT__OFS                                      (16)                  /* DMACHANS Offset */
//#define DMA_STAT__M                                        (0x001f0000)          /*  */
//#define DMA_STAT_0                                         (0x00010000)          /*  */
//#define DMA_STAT_1                                         (0x00020000)          /*  */
//#define DMA_STAT_2                                         (0x00040000)          /*  */
//#define DMA_STAT_3                                         (0x00080000)          /*  */
#define DMA_STAT_4                                         (0x00100000)          /*  */
//#define DMA_STAT__0                                        (0x00000000)          /* Controller configured to use 1 DMA channel */
//#define DMA_STAT__1                                        (0x00010000)          /* Controller configured to use 2 DMA channels */
#define DMA_STAT__30                                       (0x001e0000)          /* Controller configured to use 31 DMA channels */
#define DMA_STAT__31                                       (0x001f0000)          /* Controller configured to use 32 DMA channels */
/* DMA_STAT[DMA_STAT_] Bits */
//#define DMA_STAT__OFS                                      (28)                  /* TESTSTAT Offset */
//#define DMA_STAT__M                                        (0xf0000000)          /*  */
//#define DMA_STAT_0                                         (0x10000000)          /*  */
//#define DMA_STAT_1                                         (0x20000000)          /*  */
//#define DMA_STAT_2                                         (0x40000000)          /*  */
//#define DMA_STAT_3                                         (0x80000000)          /*  */
//#define DMA_STAT__0                                        (0x00000000)          /* Controller does not include the integration test logic */
//#define DMA_STAT__1                                        (0x10000000)          /* Controller includes the integration test logic */
/* DMA_CFG[DMA_CFG_] Bits */
#define DMA_CFG__OFS                                       ( 0)                  /* MASTEN Offset */
#define DMA_CFG_                                           (0x00000001)          /*  */
/* DMA_CFG[DMA_CFG_] Bits */
//#define DMA_CFG__OFS                                       ( 5)                  /* CHPROTCTRL Offset */
#define DMA_CFG__M                                         (0x000000e0)          /*  */
/* DMA_CTLBASE[DMA_CTLBASE_] Bits */
#define DMA_CTLBASE__OFS                                   ( 5)                  /* ADDR Offset */
#define DMA_CTLBASE__M                                     (0xffffffe0)          /*  */
/* DMA_ERRCLR[DMA_ERRCLR_] Bits */
#define DMA_ERRCLR__OFS                                    ( 0)                  /* ERRCLR Offset */
#define DMA_ERRCLR_                                        (0x00000001)          /*  */

/* UDMA_STAT Control Bits */
#define UDMA_STAT_DMACHANS_M                               0x001F0000            /* Available uDMA Channels Minus 1 */
#define UDMA_STAT_STATE_M                                  0x000000F0            /* Control State Machine Status */
#define UDMA_STAT_STATE_IDLE                               0x00000000            /* Idle */
#define UDMA_STAT_STATE_RD_CTRL                            0x00000010            /* Reading channel controller data */
#define UDMA_STAT_STATE_RD_SRCENDP                         0x00000020            /* Reading source end pointer */
#define UDMA_STAT_STATE_RD_DSTENDP                         0x00000030            /* Reading destination end pointer */
#define UDMA_STAT_STATE_RD_SRCDAT                          0x00000040            /* Reading source data */
#define UDMA_STAT_STATE_WR_DSTDAT                          0x00000050            /* Writing destination data */
#define UDMA_STAT_STATE_WAIT                               0x00000060            /* Waiting for uDMA request to */
                                                                                 /* clear */
#define UDMA_STAT_STATE_WR_CTRL                            0x00000070            /* Writing channel controller data */
#define UDMA_STAT_STATE_STALL                              0x00000080            /* Stalled */
#define UDMA_STAT_STATE_DONE                               0x00000090            /* Done */
#define UDMA_STAT_STATE_UNDEF                              0x000000A0            /* Undefined */
#define UDMA_STAT_MASTEN                                   0x00000001            /* Master Enable Status */
#define UDMA_STAT_DMACHANS_S                               16

/* UDMA_CFG Control Bits */
#define UDMA_CFG_MASTEN                                    0x00000001            /* Controller Master Enable */

/* UDMA_CTLBASE Control Bits */
#define UDMA_CTLBASE_ADDR_M                                0xFFFFFC00            /* Channel Control Base Address */
#define UDMA_CTLBASE_ADDR_S                                10

