arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// EUSCI_B0 Bits
//*****************************************************************************
/* UCB0CTLW0[UCSWRST] Bits */
//#define UCSWRST_OFS                                        ( 0)                  /* UCSWRST Offset */
//#define UCSWRST                                            (0x0001)              /* Software reset enable */
/* UCB0CTLW0[UCTXSTT] Bits */
#define UCTXSTT_OFS                                        ( 1)                  /* UCTXSTT Offset */
#define UCTXSTT                                            (0x0002)              /* Transmit START condition in master mode */
/* UCB0CTLW0[UCTXSTP] Bits */
#define UCTXSTP_OFS                                        ( 2)                  /* UCTXSTP Offset */
#define UCTXSTP                                            (0x0004)              /* Transmit STOP condition in master mode */
/* UCB0CTLW0[UCTXNACK] Bits */
#define UCTXNACK_OFS                                       ( 3)                  /* UCTXNACK Offset */
#define UCTXNACK                                           (0x0008)              /* Transmit a NACK */
/* UCB0CTLW0[UCTR] Bits */
#define UCTR_OFS                                           ( 4)                  /* UCTR Offset */
#define UCTR                                               (0x0010)              /* Transmitter/receiver */
/* UCB0CTLW0[UCTXACK] Bits */
#define UCTXACK_OFS                                        ( 5)                  /* UCTXACK Offset */
#define UCTXACK                                            (0x0020)              /* Transmit ACK condition in slave mode */
/* UCB0CTLW0[UCSSEL] Bits */
//#define UCSSEL_OFS                                         ( 6)                  /* UCSSEL Offset */
//#define UCSSEL_M                                           (0x00c0)              /* eUSCI_B clock source select */
//#define UCSSEL0                                            (0x0040)              /* eUSCI_B clock source select */
//#define UCSSEL1                                            (0x0080)              /* eUSCI_B clock source select */
//#define UCSSEL_0                                           (0x0000)              /* UCLKI */
//#define UCSSEL_1                                           (0x0040)              /* ACLK */
//#define UCSSEL_2                                           (0x0080)              /* SMCLK */
#define UCSSEL__UCLKI                                      (0x0000)              /* UCLKI */
//#define UCSSEL__ACLK                                       (0x0040)              /* ACLK */
//#define UCSSEL__SMCLK                                      (0x0080)              /* SMCLK */
#define UCSSEL_3                                           (0x00c0)              /* SMCLK */
/* UCB0CTLW0[UCSYNC] Bits */
//#define UCSYNC_OFS                                         ( 8)                  /* UCSYNC Offset */
//#define UCSYNC                                             (0x0100)              /* Synchronous mode enable */
/* UCB0CTLW0[UCMODE] Bits */
//#define UCMODE_OFS                                         ( 9)                  /* UCMODE Offset */
//#define UCMODE_M                                           (0x0600)              /* eUSCI_B mode */
//#define UCMODE0                                            (0x0200)              /* eUSCI_B mode */
//#define UCMODE1                                            (0x0400)              /* eUSCI_B mode */
//#define UCMODE_0                                           (0x0000)              /* 3-pin SPI */
//#define UCMODE_1                                           (0x0200)              /* 4-pin SPI (master or slave enabled if STE = 1) */
//#define UCMODE_2                                           (0x0400)              /* 4-pin SPI (master or slave enabled if STE = 0) */
//#define UCMODE_3                                           (0x0600)              /* I2C mode */
/* UCB0CTLW0[UCMST] Bits */
//#define UCMST_OFS                                          (11)                  /* UCMST Offset */
//#define UCMST                                              (0x0800)              /* Master mode select */
/* UCB0CTLW0[UCMM] Bits */
#define UCMM_OFS                                           (13)                  /* UCMM Offset */
#define UCMM                                               (0x2000)              /* Multi-master environment select */
/* UCB0CTLW0[UCSLA10] Bits */
#define UCSLA10_OFS                                        (14)                  /* UCSLA10 Offset */
#define UCSLA10                                            (0x4000)              /* Slave addressing mode select */
/* UCB0CTLW0[UCA10] Bits */
#define UCA10_OFS                                          (15)                  /* UCA10 Offset */
#define UCA10                                              (0x8000)              /* Own addressing mode select */
/* UCB0CTLW0_SPI[UCSWRST] Bits */
//#define UCSWRST_OFS                                        ( 0)                  /* UCSWRST Offset */
//#define UCSWRST                                            (0x0001)              /* Software reset enable */
/* UCB0CTLW0_SPI[UCSTEM] Bits */
//#define UCSTEM_OFS                                         ( 1)                  /* UCSTEM Offset */
//#define UCSTEM                                             (0x0002)              /* STE mode select in master mode. */
/* UCB0CTLW0_SPI[UCSSEL] Bits */
//#define UCSSEL_OFS                                         ( 6)                  /* UCSSEL Offset */
//#define UCSSEL_M                                           (0x00c0)              /* eUSCI_B clock source select */
//#define UCSSEL0                                            (0x0040)              /* eUSCI_B clock source select */
//#define UCSSEL1                                            (0x0080)              /* eUSCI_B clock source select */
//#define UCSSEL_1                                           (0x0040)              /* ACLK */
//#define UCSSEL_2                                           (0x0080)              /* SMCLK */
//#define UCSSEL_0                                           (0x0000)              /* Reserved */
//#define UCSSEL__ACLK                                       (0x0040)              /* ACLK */
//#define UCSSEL__SMCLK                                      (0x0080)              /* SMCLK */
//#define UCSSEL_3                                           (0x00c0)              /* SMCLK */
/* UCB0CTLW0_SPI[UCSYNC] Bits */
//#define UCSYNC_OFS                                         ( 8)                  /* UCSYNC Offset */
//#define UCSYNC                                             (0x0100)              /* Synchronous mode enable */
/* UCB0CTLW0_SPI[UCMODE] Bits */
//#define UCMODE_OFS                                         ( 9)                  /* UCMODE Offset */
//#define UCMODE_M                                           (0x0600)              /* eUSCI mode */
//#define UCMODE0                                            (0x0200)              /* eUSCI mode */
//#define UCMODE1                                            (0x0400)              /* eUSCI mode */
//#define UCMODE_0                                           (0x0000)              /* 3-pin SPI */
//#define UCMODE_1                                           (0x0200)              /* 4-pin SPI with UCxSTE active high: Slave enabled when UCxSTE = 1 */
//#define UCMODE_2                                           (0x0400)              /* 4-pin SPI with UCxSTE active low: Slave enabled when UCxSTE = 0 */
//#define UCMODE_3                                           (0x0600)              /* I2C mode */
/* UCB0CTLW0_SPI[UCMST] Bits */
//#define UCMST_OFS                                          (11)                  /* UCMST Offset */
//#define UCMST                                              (0x0800)              /* Master mode select */
/* UCB0CTLW0_SPI[UC7BIT] Bits */
//#define UC7BIT_OFS                                         (12)                  /* UC7BIT Offset */
//#define UC7BIT                                             (0x1000)              /* Character length */
/* UCB0CTLW0_SPI[UCMSB] Bits */
//#define UCMSB_OFS                                          (13)                  /* UCMSB Offset */
//#define UCMSB                                              (0x2000)              /* MSB first select */
/* UCB0CTLW0_SPI[UCCKPL] Bits */
//#define UCCKPL_OFS                                         (14)                  /* UCCKPL Offset */
//#define UCCKPL                                             (0x4000)              /* Clock polarity select */
/* UCB0CTLW0_SPI[UCCKPH] Bits */
//#define UCCKPH_OFS                                         (15)                  /* UCCKPH Offset */
//#define UCCKPH                                             (0x8000)              /* Clock phase select */
/* UCB0CTLW1[UCGLIT] Bits */
//#define UCGLIT_OFS                                         ( 0)                  /* UCGLIT Offset */
//#define UCGLIT_M                                           (0x0003)              /* Deglitch time */
//#define UCGLIT0                                            (0x0001)              /* Deglitch time */
//#define UCGLIT1                                            (0x0002)              /* Deglitch time */
//#define UCGLIT_0                                           (0x0000)              /* 50 ns */
//#define UCGLIT_1                                           (0x0001)              /* 25 ns */
//#define UCGLIT_2                                           (0x0002)              /* 12.5 ns */
//#define UCGLIT_3                                           (0x0003)              /* 6.25 ns */
/* UCB0CTLW1[UCASTP] Bits */
#define UCASTP_OFS                                         ( 2)                  /* UCASTP Offset */
#define UCASTP_M                                           (0x000c)              /* Automatic STOP condition generation */
#define UCASTP0                                            (0x0004)              /* Automatic STOP condition generation */
#define UCASTP1                                            (0x0008)              /* Automatic STOP condition generation */
#define UCASTP_0                                           (0x0000)              /* No automatic STOP generation. The STOP condition is generated after the user sets the UCTXSTP bit. The value in UCBxTBCNT is a don't care. */
#define UCASTP_1                                           (0x0004)              /* UCBCNTIFG is set with the byte counter reaches the threshold defined in UCBxTBCNT */
#define UCASTP_2                                           (0x0008)              /* A STOP condition is generated automatically after the byte counter value reached UCBxTBCNT. UCBCNTIFG is set with the byte counter reaching the threshold */
/* UCB0CTLW1[UCSWACK] Bits */
#define UCSWACK_OFS                                        ( 4)                  /* UCSWACK Offset */
#define UCSWACK                                            (0x0010)              /* SW or HW ACK control */
/* UCB0CTLW1[UCSTPNACK] Bits */
#define UCSTPNACK_OFS                                      ( 5)                  /* UCSTPNACK Offset */
#define UCSTPNACK                                          (0x0020)              /* ACK all master bytes */
/* UCB0CTLW1[UCCLTO] Bits */
#define UCCLTO_OFS                                         ( 6)                  /* UCCLTO Offset */
#define UCCLTO_M                                           (0x00c0)              /* Clock low timeout select */
#define UCCLTO0                                            (0x0040)              /* Clock low timeout select */
#define UCCLTO1                                            (0x0080)              /* Clock low timeout select */
#define UCCLTO_0                                           (0x0000)              /* Disable clock low timeout counter */
#define UCCLTO_1                                           (0x0040)              /* 135 000 SYSCLK cycles (approximately 28 ms) */
#define UCCLTO_2                                           (0x0080)              /* 150 000 SYSCLK cycles (approximately 31 ms) */
#define UCCLTO_3                                           (0x00c0)              /* 165 000 SYSCLK cycles (approximately 34 ms) */
/* UCB0CTLW1[UCETXINT] Bits */
#define UCETXINT_OFS                                       ( 8)                  /* UCETXINT Offset */
#define UCETXINT                                           (0x0100)              /* Early UCTXIFG0 */
/* UCB0STATW[UCBBUSY] Bits */
#define UCBBUSY_OFS                                        ( 4)                  /* UCBBUSY Offset */
#define UCBBUSY                                            (0x0010)              /* Bus busy */
/* UCB0STATW[UCGC] Bits */
#define UCGC_OFS                                           ( 5)                  /* UCGC Offset */
#define UCGC                                               (0x0020)              /* General call address received */
/* UCB0STATW[UCSCLLOW] Bits */
#define UCSCLLOW_OFS                                       ( 6)                  /* UCSCLLOW Offset */
#define UCSCLLOW                                           (0x0040)              /* SCL low */
/* UCB0STATW[UCBCNT] Bits */
#define UCBCNT_OFS                                         ( 8)                  /* UCBCNT Offset */
#define UCBCNT_M                                           (0xff00)              /* Hardware byte counter value */
/* UCB0STATW_SPI[UCBUSY] Bits */
//#define UCBUSY_OFS                                         ( 0)                  /* UCBUSY Offset */
//#define UCBUSY                                             (0x0001)              /* eUSCI_B busy */
/* UCB0STATW_SPI[UCOE] Bits */
//#define UCOE_OFS                                           ( 5)                  /* UCOE Offset */
//#define UCOE                                               (0x0020)              /* Overrun error flag */
/* UCB0STATW_SPI[UCFE] Bits */
//#define UCFE_OFS                                           ( 6)                  /* UCFE Offset */
//#define UCFE                                               (0x0040)              /* Framing error flag */
/* UCB0STATW_SPI[UCLISTEN] Bits */
//#define UCLISTEN_OFS                                       ( 7)                  /* UCLISTEN Offset */
//#define UCLISTEN                                           (0x0080)              /* Listen enable */
/* UCB0TBCNT[UCTBCNT] Bits */
#define UCTBCNT_OFS                                        ( 0)                  /* UCTBCNT Offset */
#define UCTBCNT_M                                          (0x00ff)              /* Byte counter threshold value */
/* UCB0RXBUF[UCRXBUF] Bits */
//#define UCRXBUF_OFS                                        ( 0)                  /* UCRXBUF Offset */
//#define UCRXBUF_M                                          (0x00ff)              /* Receive data buffer */
/* UCB0RXBUF_SPI[UCRXBUF] Bits */
//#define UCRXBUF_OFS                                        ( 0)                  /* UCRXBUF Offset */
//#define UCRXBUF_M                                          (0x00ff)              /* Receive data buffer */
/* UCB0TXBUF[UCTXBUF] Bits */
//#define UCTXBUF_OFS                                        ( 0)                  /* UCTXBUF Offset */
//#define UCTXBUF_M                                          (0x00ff)              /* Transmit data buffer */
/* UCB0TXBUF_SPI[UCTXBUF] Bits */
//#define UCTXBUF_OFS                                        ( 0)                  /* UCTXBUF Offset */
//#define UCTXBUF_M                                          (0x00ff)              /* Transmit data buffer */
/* UCB0I2COA0[I2COA0] Bits */
#define I2COA0_OFS                                         ( 0)                  /* I2COA0 Offset */
#define I2COA0_M                                           (0x03ff)              /* I2C own address */
/* UCB0I2COA0[UCOAEN] Bits */
#define UCOAEN_OFS                                         (10)                  /* UCOAEN Offset */
#define UCOAEN                                             (0x0400)              /* Own Address enable register */
/* UCB0I2COA0[UCGCEN] Bits */
#define UCGCEN_OFS                                         (15)                  /* UCGCEN Offset */
#define UCGCEN                                             (0x8000)              /* General call response enable */
/* UCB0I2COA1[I2COA1] Bits */
#define I2COA1_OFS                                         ( 0)                  /* I2COA1 Offset */
#define I2COA1_M                                           (0x03ff)              /* I2C own address */
/* UCB0I2COA1[UCOAEN] Bits */
//#define UCOAEN_OFS                                         (10)                  /* UCOAEN Offset */
//#define UCOAEN                                             (0x0400)              /* Own Address enable register */
/* UCB0I2COA2[I2COA2] Bits */
#define I2COA2_OFS                                         ( 0)                  /* I2COA2 Offset */
#define I2COA2_M                                           (0x03ff)              /* I2C own address */
/* UCB0I2COA2[UCOAEN] Bits */
//#define UCOAEN_OFS                                         (10)                  /* UCOAEN Offset */
//#define UCOAEN                                             (0x0400)              /* Own Address enable register */
/* UCB0I2COA3[I2COA3] Bits */
#define I2COA3_OFS                                         ( 0)                  /* I2COA3 Offset */
#define I2COA3_M                                           (0x03ff)              /* I2C own address */
/* UCB0I2COA3[UCOAEN] Bits */
//#define UCOAEN_OFS                                         (10)                  /* UCOAEN Offset */
//#define UCOAEN                                             (0x0400)              /* Own Address enable register */
/* UCB0ADDRX[ADDRX] Bits */
#define ADDRX_OFS                                          ( 0)                  /* ADDRX Offset */
#define ADDRX_M                                            (0x03ff)              /* Received Address Register */
/* UCB0ADDMASK[ADDMASK] Bits */
#define ADDMASK_OFS                                        ( 0)                  /* ADDMASK Offset */
#define ADDMASK_M                                          (0x03ff)              /*  */
/* UCB0I2CSA[I2CSA] Bits */
#define I2CSA_OFS                                          ( 0)                  /* I2CSA Offset */
#define I2CSA_M                                            (0x03ff)              /* I2C slave address */
/* UCB0IE[UCRXIE0] Bits */
#define UCRXIE0_OFS                                        ( 0)                  /* UCRXIE0 Offset */
#define UCRXIE0                                            (0x0001)              /* Receive interrupt enable 0 */
/* UCB0IE[UCTXIE0] Bits */
#define UCTXIE0_OFS                                        ( 1)                  /* UCTXIE0 Offset */
#define UCTXIE0                                            (0x0002)              /* Transmit interrupt enable 0 */
/* UCB0IE[UCSTTIE] Bits */
//#define UCSTTIE_OFS                                        ( 2)                  /* UCSTTIE Offset */
//#define UCSTTIE                                            (0x0004)              /* START condition interrupt enable */
/* UCB0IE[UCSTPIE] Bits */
#define UCSTPIE_OFS                                        ( 3)                  /* UCSTPIE Offset */
#define UCSTPIE                                            (0x0008)              /* STOP condition interrupt enable */
/* UCB0IE[UCALIE] Bits */
#define UCALIE_OFS                                         ( 4)                  /* UCALIE Offset */
#define UCALIE                                             (0x0010)              /* Arbitration lost interrupt enable */
/* UCB0IE[UCNACKIE] Bits */
#define UCNACKIE_OFS                                       ( 5)                  /* UCNACKIE Offset */
#define UCNACKIE                                           (0x0020)              /* Not-acknowledge interrupt enable */
/* UCB0IE[UCBCNTIE] Bits */
#define UCBCNTIE_OFS                                       ( 6)                  /* UCBCNTIE Offset */
#define UCBCNTIE                                           (0x0040)              /* Byte counter interrupt enable */
/* UCB0IE[UCCLTOIE] Bits */
#define UCCLTOIE_OFS                                       ( 7)                  /* UCCLTOIE Offset */
#define UCCLTOIE                                           (0x0080)              /* Clock low timeout interrupt enable */
/* UCB0IE[UCRXIE1] Bits */
#define UCRXIE1_OFS                                        ( 8)                  /* UCRXIE1 Offset */
#define UCRXIE1                                            (0x0100)              /* Receive interrupt enable 1 */
/* UCB0IE[UCTXIE1] Bits */
#define UCTXIE1_OFS                                        ( 9)                  /* UCTXIE1 Offset */
#define UCTXIE1                                            (0x0200)              /* Transmit interrupt enable 1 */
/* UCB0IE[UCRXIE2] Bits */
#define UCRXIE2_OFS                                        (10)                  /* UCRXIE2 Offset */
#define UCRXIE2                                            (0x0400)              /* Receive interrupt enable 2 */
/* UCB0IE[UCTXIE2] Bits */
#define UCTXIE2_OFS                                        (11)                  /* UCTXIE2 Offset */
#define UCTXIE2                                            (0x0800)              /* Transmit interrupt enable 2 */
/* UCB0IE[UCRXIE3] Bits */
#define UCRXIE3_OFS                                        (12)                  /* UCRXIE3 Offset */
#define UCRXIE3                                            (0x1000)              /* Receive interrupt enable 3 */
/* UCB0IE[UCTXIE3] Bits */
#define UCTXIE3_OFS                                        (13)                  /* UCTXIE3 Offset */
#define UCTXIE3                                            (0x2000)              /* Transmit interrupt enable 3 */
/* UCB0IE[UCBIT9IE] Bits */
#define UCBIT9IE_OFS                                       (14)                  /* UCBIT9IE Offset */
#define UCBIT9IE                                           (0x4000)              /* Bit position 9 interrupt enable */
/* UCB0IE_SPI[UCRXIE] Bits */
//#define UCRXIE_OFS                                         ( 0)                  /* UCRXIE Offset */
//#define UCRXIE                                             (0x0001)              /* Receive interrupt enable */
/* UCB0IE_SPI[UCTXIE] Bits */
//#define UCTXIE_OFS                                         ( 1)                  /* UCTXIE Offset */
//#define UCTXIE                                             (0x0002)              /* Transmit interrupt enable */
/* UCB0IFG[UCRXIFG0] Bits */
#define UCRXIFG0_OFS                                       ( 0)                  /* UCRXIFG0 Offset */
#define UCRXIFG0                                           (0x0001)              /* eUSCI_B receive interrupt flag 0 */
/* UCB0IFG[UCTXIFG0] Bits */
#define UCTXIFG0_OFS                                       ( 1)                  /* UCTXIFG0 Offset */
#define UCTXIFG0                                           (0x0002)              /* eUSCI_B transmit interrupt flag 0 */
/* UCB0IFG[UCSTTIFG] Bits */
//#define UCSTTIFG_OFS                                       ( 2)                  /* UCSTTIFG Offset */
//#define UCSTTIFG                                           (0x0004)              /* START condition interrupt flag */
/* UCB0IFG[UCSTPIFG] Bits */
#define UCSTPIFG_OFS                                       ( 3)                  /* UCSTPIFG Offset */
#define UCSTPIFG                                           (0x0008)              /* STOP condition interrupt flag */
/* UCB0IFG[UCALIFG] Bits */
#define UCALIFG_OFS                                        ( 4)                  /* UCALIFG Offset */
