arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// FPB Bits
//*****************************************************************************
/* FPB_FP_CTRL[FPB_FP_CTRL_ENABLE] Bits */
#define FPB_FP_CTRL_ENABLE_OFS                             ( 0)                  /* ENABLE Offset */
#define FPB_FP_CTRL_ENABLE                                 (0x00000001)          /*  */
/* FPB_FP_CTRL[FPB_FP_CTRL_KEY] Bits */
#define FPB_FP_CTRL_KEY_OFS                                ( 1)                  /* KEY Offset */
#define FPB_FP_CTRL_KEY                                    (0x00000002)          /*  */
/* FPB_FP_CTRL[FPB_FP_CTRL_NUM_CODE1] Bits */
#define FPB_FP_CTRL_NUM_CODE1_OFS                          ( 4)                  /* NUM_CODE1 Offset */
#define FPB_FP_CTRL_NUM_CODE1_M                            (0x000000f0)          /*  */
#define FPB_FP_CTRL_NUM_CODE10                             (0x00000010)          /*  */
#define FPB_FP_CTRL_NUM_CODE11                             (0x00000020)          /*  */
#define FPB_FP_CTRL_NUM_CODE12                             (0x00000040)          /*  */
#define FPB_FP_CTRL_NUM_CODE13                             (0x00000080)          /*  */
#define FPB_FP_CTRL_NUM_CODE1_0                            (0x00000000)          /* no code slots */
#define FPB_FP_CTRL_NUM_CODE1_2                            (0x00000020)          /* two code slots */
#define FPB_FP_CTRL_NUM_CODE1_6                            (0x00000060)          /* six code slots */
/* FPB_FP_CTRL[FPB_FP_CTRL_NUM_LIT] Bits */
#define FPB_FP_CTRL_NUM_LIT_OFS                            ( 8)                  /* NUM_LIT Offset */
#define FPB_FP_CTRL_NUM_LIT_M                              (0x00000f00)          /*  */
#define FPB_FP_CTRL_NUM_LIT0                               (0x00000100)          /*  */
#define FPB_FP_CTRL_NUM_LIT1                               (0x00000200)          /*  */
#define FPB_FP_CTRL_NUM_LIT2                               (0x00000400)          /*  */
#define FPB_FP_CTRL_NUM_LIT3                               (0x00000800)          /*  */
#define FPB_FP_CTRL_NUM_LIT_0                              (0x00000000)          /* no literal slots */
#define FPB_FP_CTRL_NUM_LIT_2                              (0x00000200)          /* two literal slots */
/* FPB_FP_CTRL[FPB_FP_CTRL_NUM_CODE2] Bits */
#define FPB_FP_CTRL_NUM_CODE2_OFS                          (12)                  /* NUM_CODE2 Offset */
#define FPB_FP_CTRL_NUM_CODE2_M                            (0x00003000)          /*  */
/* FPB_FP_REMAP[FPB_FP_REMAP_REMAP] Bits */
#define FPB_FP_REMAP_REMAP_OFS                             ( 5)                  /* REMAP Offset */
#define FPB_FP_REMAP_REMAP_M                               (0x1fffffe0)          /*  */
/* FPB_FP_COMP0[FPB_FP_COMP0_ENABLE] Bits */
#define FPB_FP_COMP0_ENABLE_OFS                            ( 0)                  /* ENABLE Offset */
#define FPB_FP_COMP0_ENABLE                                (0x00000001)          /*  */
/* FPB_FP_COMP0[FPB_FP_COMP0_COMP] Bits */
#define FPB_FP_COMP0_COMP_OFS                              ( 2)                  /* COMP Offset */
#define FPB_FP_COMP0_COMP_M                                (0x1ffffffc)          /*  */
/* FPB_FP_COMP0[FPB_FP_COMP0_REPLACE] Bits */
#define FPB_FP_COMP0_REPLACE_OFS                           (30)                  /* REPLACE Offset */
#define FPB_FP_COMP0_REPLACE_M                             (0xc0000000)          /*  */
#define FPB_FP_COMP0_REPLACE0                              (0x40000000)          /*  */
#define FPB_FP_COMP0_REPLACE1                              (0x80000000)          /*  */
#define FPB_FP_COMP0_REPLACE_0                             (0x00000000)          /* remap to remap address. See FP_REMAP */
#define FPB_FP_COMP0_REPLACE_1                             (0x40000000)          /* set BKPT on lower halfword, upper is unaffected */
#define FPB_FP_COMP0_REPLACE_2                             (0x80000000)          /* set BKPT on upper halfword, lower is unaffected */
#define FPB_FP_COMP0_REPLACE_3                             (0xc0000000)          /* set BKPT on both lower and upper halfwords. */
/* FPB_FP_COMP1[FPB_FP_COMP1_ENABLE] Bits */
#define FPB_FP_COMP1_ENABLE_OFS                            ( 0)                  /* ENABLE Offset */
#define FPB_FP_COMP1_ENABLE                                (0x00000001)          /*  */
/* FPB_FP_COMP1[FPB_FP_COMP1_COMP] Bits */
#define FPB_FP_COMP1_COMP_OFS                              ( 2)                  /* COMP Offset */
#define FPB_FP_COMP1_COMP_M                                (0x1ffffffc)          /*  */
/* FPB_FP_COMP1[FPB_FP_COMP1_REPLACE] Bits */
#define FPB_FP_COMP1_REPLACE_OFS                           (30)                  /* REPLACE Offset */
#define FPB_FP_COMP1_REPLACE_M                             (0xc0000000)          /*  */
#define FPB_FP_COMP1_REPLACE0                              (0x40000000)          /*  */
#define FPB_FP_COMP1_REPLACE1                              (0x80000000)          /*  */
#define FPB_FP_COMP1_REPLACE_0                             (0x00000000)          /* remap to remap address. See FP_REMAP */
#define FPB_FP_COMP1_REPLACE_1                             (0x40000000)          /* set BKPT on lower halfword, upper is unaffected */
#define FPB_FP_COMP1_REPLACE_2                             (0x80000000)          /* set BKPT on upper halfword, lower is unaffected */
#define FPB_FP_COMP1_REPLACE_3                             (0xc0000000)          /* set BKPT on both lower and upper halfwords. */
/* FPB_FP_COMP2[FPB_FP_COMP2_ENABLE] Bits */
#define FPB_FP_COMP2_ENABLE_OFS                            ( 0)                  /* ENABLE Offset */
#define FPB_FP_COMP2_ENABLE                                (0x00000001)          /*  */
/* FPB_FP_COMP2[FPB_FP_COMP2_COMP] Bits */
#define FPB_FP_COMP2_COMP_OFS                              ( 2)                  /* COMP Offset */
#define FPB_FP_COMP2_COMP_M                                (0x1ffffffc)          /*  */
/* FPB_FP_COMP2[FPB_FP_COMP2_REPLACE] Bits */
#define FPB_FP_COMP2_REPLACE_OFS                           (30)                  /* REPLACE Offset */
#define FPB_FP_COMP2_REPLACE_M                             (0xc0000000)          /*  */
#define FPB_FP_COMP2_REPLACE0                              (0x40000000)          /*  */
#define FPB_FP_COMP2_REPLACE1                              (0x80000000)          /*  */
#define FPB_FP_COMP2_REPLACE_0                             (0x00000000)          /* remap to remap address. See FP_REMAP */
#define FPB_FP_COMP2_REPLACE_1                             (0x40000000)          /* set BKPT on lower halfword, upper is unaffected */
#define FPB_FP_COMP2_REPLACE_2                             (0x80000000)          /* set BKPT on upper halfword, lower is unaffected */
#define FPB_FP_COMP2_REPLACE_3                             (0xc0000000)          /* set BKPT on both lower and upper halfwords. */
/* FPB_FP_COMP3[FPB_FP_COMP3_ENABLE] Bits */
#define FPB_FP_COMP3_ENABLE_OFS                            ( 0)                  /* ENABLE Offset */
#define FPB_FP_COMP3_ENABLE                                (0x00000001)          /*  */
/* FPB_FP_COMP3[FPB_FP_COMP3_COMP] Bits */
#define FPB_FP_COMP3_COMP_OFS                              ( 2)                  /* COMP Offset */
#define FPB_FP_COMP3_COMP_M                                (0x1ffffffc)          /*  */
/* FPB_FP_COMP3[FPB_FP_COMP3_REPLACE] Bits */
#define FPB_FP_COMP3_REPLACE_OFS                           (30)                  /* REPLACE Offset */
#define FPB_FP_COMP3_REPLACE_M                             (0xc0000000)          /*  */
#define FPB_FP_COMP3_REPLACE0                              (0x40000000)          /*  */
#define FPB_FP_COMP3_REPLACE1                              (0x80000000)          /*  */
#define FPB_FP_COMP3_REPLACE_0                             (0x00000000)          /* remap to remap address. See FP_REMAP */
#define FPB_FP_COMP3_REPLACE_1                             (0x40000000)          /* set BKPT on lower halfword, upper is unaffected */
#define FPB_FP_COMP3_REPLACE_2                             (0x80000000)          /* set BKPT on upper halfword, lower is unaffected */
#define FPB_FP_COMP3_REPLACE_3                             (0xc0000000)          /* set BKPT on both lower and upper halfwords. */
/* FPB_FP_COMP4[FPB_FP_COMP4_ENABLE] Bits */
#define FPB_FP_COMP4_ENABLE_OFS                            ( 0)                  /* ENABLE Offset */
#define FPB_FP_COMP4_ENABLE                                (0x00000001)          /*  */
/* FPB_FP_COMP4[FPB_FP_COMP4_COMP] Bits */
#define FPB_FP_COMP4_COMP_OFS                              ( 2)                  /* COMP Offset */
#define FPB_FP_COMP4_COMP_M                                (0x1ffffffc)          /*  */
/* FPB_FP_COMP4[FPB_FP_COMP4_REPLACE] Bits */
#define FPB_FP_COMP4_REPLACE_OFS                           (30)                  /* REPLACE Offset */
#define FPB_FP_COMP4_REPLACE_M                             (0xc0000000)          /*  */
#define FPB_FP_COMP4_REPLACE0                              (0x40000000)          /*  */
#define FPB_FP_COMP4_REPLACE1                              (0x80000000)          /*  */
#define FPB_FP_COMP4_REPLACE_0                             (0x00000000)          /* remap to remap address. See FP_REMAP */
#define FPB_FP_COMP4_REPLACE_1                             (0x40000000)          /* set BKPT on lower halfword, upper is unaffected */
#define FPB_FP_COMP4_REPLACE_2                             (0x80000000)          /* set BKPT on upper halfword, lower is unaffected */
#define FPB_FP_COMP4_REPLACE_3                             (0xc0000000)          /* set BKPT on both lower and upper halfwords. */
/* FPB_FP_COMP5[FPB_FP_COMP5_ENABLE] Bits */
#define FPB_FP_COMP5_ENABLE_OFS                            ( 0)                  /* ENABLE Offset */
#define FPB_FP_COMP5_ENABLE                                (0x00000001)          /*  */
/* FPB_FP_COMP5[FPB_FP_COMP5_COMP] Bits */
#define FPB_FP_COMP5_COMP_OFS                              ( 2)                  /* COMP Offset */
#define FPB_FP_COMP5_COMP_M                                (0x1ffffffc)          /*  */
/* FPB_FP_COMP5[FPB_FP_COMP5_REPLACE] Bits */
#define FPB_FP_COMP5_REPLACE_OFS                           (30)                  /* REPLACE Offset */
#define FPB_FP_COMP5_REPLACE_M                             (0xc0000000)          /*  */
#define FPB_FP_COMP5_REPLACE0                              (0x40000000)          /*  */
#define FPB_FP_COMP5_REPLACE1                              (0x80000000)          /*  */
#define FPB_FP_COMP5_REPLACE_0                             (0x00000000)          /* remap to remap address. See FP_REMAP */
#define FPB_FP_COMP5_REPLACE_1                             (0x40000000)          /* set BKPT on lower halfword, upper is unaffected */
#define FPB_FP_COMP5_REPLACE_2                             (0x80000000)          /* set BKPT on upper halfword, lower is unaffected */
#define FPB_FP_COMP5_REPLACE_3                             (0xc0000000)          /* set BKPT on both lower and upper halfwords. */
/* FPB_FP_COMP6[FPB_FP_COMP6_ENABLE] Bits */
#define FPB_FP_COMP6_ENABLE_OFS                            ( 0)                  /* ENABLE Offset */
#define FPB_FP_COMP6_ENABLE                                (0x00000001)          /*  */
/* FPB_FP_COMP6[FPB_FP_COMP6_COMP] Bits */
#define FPB_FP_COMP6_COMP_OFS                              ( 2)                  /* COMP Offset */
#define FPB_FP_COMP6_COMP_M                                (0x1ffffffc)          /*  */
/* FPB_FP_COMP6[FPB_FP_COMP6_REPLACE] Bits */
#define FPB_FP_COMP6_REPLACE_OFS                           (30)                  /* REPLACE Offset */
#define FPB_FP_COMP6_REPLACE_M                             (0xc0000000)          /*  */
#define FPB_FP_COMP6_REPLACE0                              (0x40000000)          /*  */
#define FPB_FP_COMP6_REPLACE1                              (0x80000000)          /*  */
#define FPB_FP_COMP6_REPLACE_0                             (0x00000000)          /* remap to remap address. See FP_REMAP */
#define FPB_FP_COMP6_REPLACE_1                             (0x40000000)          /* set BKPT on lower halfword, upper is unaffected */
#define FPB_FP_COMP6_REPLACE_2                             (0x80000000)          /* set BKPT on upper halfword, lower is unaffected */
#define FPB_FP_COMP6_REPLACE_3                             (0xc0000000)          /* set BKPT on both lower and upper halfwords. */
/* FPB_FP_COMP7[FPB_FP_COMP7_ENABLE] Bits */
#define FPB_FP_COMP7_ENABLE_OFS                            ( 0)                  /* ENABLE Offset */
#define FPB_FP_COMP7_ENABLE                                (0x00000001)          /*  */
/* FPB_FP_COMP7[FPB_FP_COMP7_COMP] Bits */
#define FPB_FP_COMP7_COMP_OFS                              ( 2)                  /* COMP Offset */
#define FPB_FP_COMP7_COMP_M                                (0x1ffffffc)          /*  */
/* FPB_FP_COMP7[FPB_FP_COMP7_REPLACE] Bits */
#define FPB_FP_COMP7_REPLACE_OFS                           (30)                  /* REPLACE Offset */
#define FPB_FP_COMP7_REPLACE_M                             (0xc0000000)          /*  */
#define FPB_FP_COMP7_REPLACE0                              (0x40000000)          /*  */
#define FPB_FP_COMP7_REPLACE1                              (0x80000000)          /*  */
#define FPB_FP_COMP7_REPLACE_0                             (0x00000000)          /* remap to remap address. See FP_REMAP */
#define FPB_FP_COMP7_REPLACE_1                             (0x40000000)          /* set BKPT on lower halfword, upper is unaffected */
#define FPB_FP_COMP7_REPLACE_2                             (0x80000000)          /* set BKPT on upper halfword, lower is unaffected */
#define FPB_FP_COMP7_REPLACE_3                             (0xc0000000)          /* set BKPT on both lower and upper halfwords. */


//*****************************************************************************
// FPU Bits
//*****************************************************************************
/* FPU_FPCCR[FPU_FPCCR_ASPEN] Bits */
#define FPU_FPCCR_ASPEN_OFS                                (31)                  /* ASPEN Offset */
#define FPU_FPCCR_ASPEN                                    (0x80000000)          /*  */
/* FPU_FPCCR[FPU_FPCCR_LSPEN] Bits */
#define FPU_FPCCR_LSPEN_OFS                                (30)                  /* LSPEN Offset */
#define FPU_FPCCR_LSPEN                                    (0x40000000)          /*  */
/* FPU_FPCCR[FPU_FPCCR_MONRDY] Bits */
#define FPU_FPCCR_MONRDY_OFS                               ( 8)                  /* MONRDY Offset */
#define FPU_FPCCR_MONRDY                                   (0x00000100)          /*  */
/* FPU_FPCCR[FPU_FPCCR_BFRDY] Bits */
#define FPU_FPCCR_BFRDY_OFS                                ( 6)                  /* BFRDY Offset */
#define FPU_FPCCR_BFRDY                                    (0x00000040)          /*  */
/* FPU_FPCCR[FPU_FPCCR_MMRDY] Bits */
#define FPU_FPCCR_MMRDY_OFS                                ( 5)                  /* MMRDY Offset */
#define FPU_FPCCR_MMRDY                                    (0x00000020)          /*  */
/* FPU_FPCCR[FPU_FPCCR_HFRDY] Bits */
#define FPU_FPCCR_HFRDY_OFS                                ( 4)                  /* HFRDY Offset */
#define FPU_FPCCR_HFRDY                                    (0x00000010)          /*  */
/* FPU_FPCCR[FPU_FPCCR_THREAD] Bits */
#define FPU_FPCCR_THREAD_OFS                               ( 3)                  /* THREAD Offset */
#define FPU_FPCCR_THREAD                                   (0x00000008)          /*  */
/* FPU_FPCCR[FPU_FPCCR_USER] Bits */
#define FPU_FPCCR_USER_OFS                                 ( 1)                  /* USER Offset */
#define FPU_FPCCR_USER                                     (0x00000002)          /*  */
/* FPU_FPCCR[FPU_FPCCR_LSPACT] Bits */
#define FPU_FPCCR_LSPACT_OFS                               ( 0)                  /* LSPACT Offset */
#define FPU_FPCCR_LSPACT                                   (0x00000001)          /*  */
/* FPU_FPCAR[FPU_FPCAR_ADDRESS] Bits */
#define FPU_FPCAR_ADDRESS_OFS                              ( 2)                  /* ADDRESS Offset */
#define FPU_FPCAR_ADDRESS_M                                (0x7ffffffc)          /*  */
/* FPU_FPDSCR[FPU_FPDSCR_AHP] Bits */
#define FPU_FPDSCR_AHP_OFS                                 (26)                  /* AHP Offset */
#define FPU_FPDSCR_AHP                                     (0x04000000)          /*  */
/* FPU_FPDSCR[FPU_FPDSCR_DN] Bits */
#define FPU_FPDSCR_DN_OFS                                  (25)                  /* DN Offset */
#define FPU_FPDSCR_DN                                      (0x02000000)          /*  */
/* FPU_FPDSCR[FPU_FPDSCR_FZ] Bits */
#define FPU_FPDSCR_FZ_OFS                                  (24)                  /* FZ Offset */
#define FPU_FPDSCR_FZ                                      (0x01000000)          /*  */
/* FPU_FPDSCR[FPU_FPDSCR_RMODE] Bits */
#define FPU_FPDSCR_RMODE_OFS                               (22)                  /* RMODE Offset */
#define FPU_FPDSCR_RMODE_M                                 (0x00c00000)          /*  */
/* FPU_MVFR0[FPU_MVFR0_FP_ROUNDING_MODES] Bits */
#define FPU_MVFR0_FP_ROUNDING_MODES_OFS                    (28)                  /* FP_ROUNDING_MODES Offset */
#define FPU_MVFR0_FP_ROUNDING_MODES_M                      (0xf0000000)          /*  */
/* FPU_MVFR0[FPU_MVFR0_SHORT_VECTORS] Bits */
#define FPU_MVFR0_SHORT_VECTORS_OFS                        (24)                  /* SHORT_VECTORS Offset */
#define FPU_MVFR0_SHORT_VECTORS_M                          (0x0f000000)          /*  */
/* FPU_MVFR0[FPU_MVFR0_SQUARE_ROOT] Bits */
#define FPU_MVFR0_SQUARE_ROOT_OFS                          (20)                  /* SQUARE_ROOT Offset */
#define FPU_MVFR0_SQUARE_ROOT_M                            (0x00f00000)          /*  */
/* FPU_MVFR0[FPU_MVFR0_DIVIDE] Bits */
#define FPU_MVFR0_DIVIDE_OFS                               (16)                  /* DIVIDE Offset */
#define FPU_MVFR0_DIVIDE_M                                 (0x000f0000)          /*  */
/* FPU_MVFR0[FPU_MVFR0_FP_ECEPTION_TRAPPING] Bits */
#define FPU_MVFR0_FP_ECEPTION_TRAPPING_OFS                 (12)                  /* FP_EXCEPTION_TRAPPING Offset */
#define FPU_MVFR0_FP_ECEPTION_TRAPPING_M                   (0x0000f000)          /*  */
/* FPU_MVFR0[FPU_MVFR0_DOUBLE_PRECISION] Bits */
#define FPU_MVFR0_DOUBLE_PRECISION_OFS                     ( 8)                  /* DOUBLE_PRECISION Offset */
#define FPU_MVFR0_DOUBLE_PRECISION_M                       (0x00000f00)          /*  */
/* FPU_MVFR0[FPU_MVFR0_SINGLE_PRECISION] Bits */
#define FPU_MVFR0_SINGLE_PRECISION_OFS                     ( 4)                  /* SINGLE_PRECISION Offset */
#define FPU_MVFR0_SINGLE_PRECISION_M                       (0x000000f0)          /*  */
/* FPU_MVFR0[FPU_MVFR0_A_SIMD_REGISTERS] Bits */
#define FPU_MVFR0_A_SIMD_REGISTERS_OFS                     ( 0)                  /* A_SIMD_REGISTERS Offset */
#define FPU_MVFR0_A_SIMD_REGISTERS_M                       (0x0000000f)          /*  */
/* FPU_MVFR1[FPU_MVFR1_FP_FUSED_MAC] Bits */
#define FPU_MVFR1_FP_FUSED_MAC_OFS                         (28)                  /* FP_FUSED_MAC Offset */
#define FPU_MVFR1_FP_FUSED_MAC_M                           (0xf0000000)          /*  */
/* FPU_MVFR1[FPU_MVFR1_FP_HPFP] Bits */
#define FPU_MVFR1_FP_HPFP_OFS                              (24)                  /* FP_HPFP Offset */
#define FPU_MVFR1_FP_HPFP_M                                (0x0f000000)          /*  */
/* FPU_MVFR1[FPU_MVFR1_D_NAN_MODE] Bits */
#define FPU_MVFR1_D_NAN_MODE_OFS                           ( 4)                  /* D_NAN_MODE Offset */
#define FPU_MVFR1_D_NAN_MODE_M                             (0x000000f0)          /*  */
/* FPU_MVFR1[FPU_MVFR1_FTZ_MODE] Bits */
#define FPU_MVFR1_FTZ_MODE_OFS                             ( 0)                  /* FTZ_MODE Offset */
#define FPU_MVFR1_FTZ_MODE_M                               (0x0000000f)          /*  */


