arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// REF_A Bits
//*****************************************************************************
/* REFCTL0[REFON] Bits */
#define REFON_OFS                                          ( 0)                  /* REFON Offset */
#define REFON                                              (0x0001)              /* Reference enable */
/* REFCTL0[REFOUT] Bits */
#define REFOUT_OFS                                         ( 1)                  /* REFOUT Offset */
#define REFOUT                                             (0x0002)              /* Reference output buffer */
/* REFCTL0[REFTCOFF] Bits */
#define REFTCOFF_OFS                                       ( 3)                  /* REFTCOFF Offset */
#define REFTCOFF                                           (0x0008)              /* Temperature sensor disabled */
/* REFCTL0[REFVSEL] Bits */
#define REFVSEL_OFS                                        ( 4)                  /* REFVSEL Offset */
#define REFVSEL_M                                          (0x0030)              /* Reference voltage level select */
#define REFVSEL0                                           (0x0010)              /* Reference voltage level select */
#define REFVSEL1                                           (0x0020)              /* Reference voltage level select */
#define REFVSEL_0                                          (0x0000)              /* 1.2 V available when reference requested or REFON = 1 */
#define REFVSEL_1                                          (0x0010)              /* 1.45 V available when reference requested or REFON = 1 */
#define REFVSEL_3                                          (0x0030)              /* 2.5 V available when reference requested or REFON = 1 */
/* REFCTL0[REFGENOT] Bits */
#define REFGENOT_OFS                                       ( 6)                  /* REFGENOT Offset */
#define REFGENOT                                           (0x0040)              /* Reference generator one-time trigger */
/* REFCTL0[REFBGOT] Bits */
#define REFBGOT_OFS                                        ( 7)                  /* REFBGOT Offset */
#define REFBGOT                                            (0x0080)              /* Bandgap and bandgap buffer one-time trigger */
/* REFCTL0[REFGENACT] Bits */
#define REFGENACT_OFS                                      ( 8)                  /* REFGENACT Offset */
#define REFGENACT                                          (0x0100)              /* Reference generator active */
/* REFCTL0[REFBGACT] Bits */
#define REFBGACT_OFS                                       ( 9)                  /* REFBGACT Offset */
#define REFBGACT                                           (0x0200)              /* Reference bandgap active */
/* REFCTL0[REFGENBUSY] Bits */
#define REFGENBUSY_OFS                                     (10)                  /* REFGENBUSY Offset */
#define REFGENBUSY                                         (0x0400)              /* Reference generator busy */
/* REFCTL0[BGMODE] Bits */
#define BGMODE_OFS                                         (11)                  /* BGMODE Offset */
#define BGMODE                                             (0x0800)              /* Bandgap mode */
/* REFCTL0[REFGENRDY] Bits */
#define REFGENRDY_OFS                                      (12)                  /* REFGENRDY Offset */
#define REFGENRDY                                          (0x1000)              /* Variable reference voltage ready status */
/* REFCTL0[REFBGRDY] Bits */
#define REFBGRDY_OFS                                       (13)                  /* REFBGRDY Offset */
#define REFBGRDY                                           (0x2000)              /* Buffered bandgap voltage ready status */


//*****************************************************************************
// RSTCTL Bits
//*****************************************************************************
/* RSTCTL_RESET_REQ[RSTCTL_RESET_REQ_SOFT_REQ] Bits */
#define RSTCTL_RESET_REQ_SOFT_REQ_OFS                      ( 0)                  /* SOFT_REQ Offset */
#define RSTCTL_RESET_REQ_SOFT_REQ                          (0x00000001)          /* Soft Reset request */
/* RSTCTL_RESET_REQ[RSTCTL_RESET_REQ_HARD_REQ] Bits */
#define RSTCTL_RESET_REQ_HARD_REQ_OFS                      ( 1)                  /* HARD_REQ Offset */
#define RSTCTL_RESET_REQ_HARD_REQ                          (0x00000002)          /* Hard Reset request */
/* RSTCTL_RESET_REQ[RSTCTL_RESET_REQ_RSTKEY] Bits */
#define RSTCTL_RESET_REQ_RSTKEY_OFS                        ( 8)                  /* RSTKEY Offset */
#define RSTCTL_RESET_REQ_RSTKEY_M                          (0x0000ff00)          /* Write key to unlock reset request bits */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC0] Bits */
#define RSTCTL_HARDRESET_CLR_SRC0_OFS                      ( 0)                  /* SRC0 Offset */
#define RSTCTL_HARDRESET_CLR_SRC0                          (0x00000001)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC1] Bits */
#define RSTCTL_HARDRESET_CLR_SRC1_OFS                      ( 1)                  /* SRC1 Offset */
#define RSTCTL_HARDRESET_CLR_SRC1                          (0x00000002)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC2] Bits */
#define RSTCTL_HARDRESET_CLR_SRC2_OFS                      ( 2)                  /* SRC2 Offset */
#define RSTCTL_HARDRESET_CLR_SRC2                          (0x00000004)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC3] Bits */
#define RSTCTL_HARDRESET_CLR_SRC3_OFS                      ( 3)                  /* SRC3 Offset */
#define RSTCTL_HARDRESET_CLR_SRC3                          (0x00000008)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC4] Bits */
#define RSTCTL_HARDRESET_CLR_SRC4_OFS                      ( 4)                  /* SRC4 Offset */
#define RSTCTL_HARDRESET_CLR_SRC4                          (0x00000010)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC5] Bits */
#define RSTCTL_HARDRESET_CLR_SRC5_OFS                      ( 5)                  /* SRC5 Offset */
#define RSTCTL_HARDRESET_CLR_SRC5                          (0x00000020)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC6] Bits */
#define RSTCTL_HARDRESET_CLR_SRC6_OFS                      ( 6)                  /* SRC6 Offset */
#define RSTCTL_HARDRESET_CLR_SRC6                          (0x00000040)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC7] Bits */
#define RSTCTL_HARDRESET_CLR_SRC7_OFS                      ( 7)                  /* SRC7 Offset */
#define RSTCTL_HARDRESET_CLR_SRC7                          (0x00000080)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC8] Bits */
#define RSTCTL_HARDRESET_CLR_SRC8_OFS                      ( 8)                  /* SRC8 Offset */
#define RSTCTL_HARDRESET_CLR_SRC8                          (0x00000100)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT  */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC9] Bits */
#define RSTCTL_HARDRESET_CLR_SRC9_OFS                      ( 9)                  /* SRC9 Offset */
#define RSTCTL_HARDRESET_CLR_SRC9                          (0x00000200)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC10] Bits */
#define RSTCTL_HARDRESET_CLR_SRC10_OFS                     (10)                  /* SRC10 Offset */
#define RSTCTL_HARDRESET_CLR_SRC10                         (0x00000400)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC11] Bits */
#define RSTCTL_HARDRESET_CLR_SRC11_OFS                     (11)                  /* SRC11 Offset */
#define RSTCTL_HARDRESET_CLR_SRC11                         (0x00000800)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC12] Bits */
#define RSTCTL_HARDRESET_CLR_SRC12_OFS                     (12)                  /* SRC12 Offset */
#define RSTCTL_HARDRESET_CLR_SRC12                         (0x00001000)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC13] Bits */
#define RSTCTL_HARDRESET_CLR_SRC13_OFS                     (13)                  /* SRC13 Offset */
#define RSTCTL_HARDRESET_CLR_SRC13                         (0x00002000)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC14] Bits */
#define RSTCTL_HARDRESET_CLR_SRC14_OFS                     (14)                  /* SRC14 Offset */
#define RSTCTL_HARDRESET_CLR_SRC14                         (0x00004000)          /* Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT */
/* RSTCTL_HARDRESET_CLR[RSTCTL_HARDRESET_CLR_SRC15] Bits */
#define RSTCTL_HARDRESET_CLR_SRC15_OFS                     (15)                  /* SRC15 Offset */
#define RSTCTL_HARDRESET_CLR_SRC15                         (0x00008000)          /* Write 1 clears the corresponding bit in the RSTCTL_HRDRESETSTAT_REG */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC0] Bits */
#define RSTCTL_HARDRESET_SET_SRC0_OFS                      ( 0)                  /* SRC0 Offset */
#define RSTCTL_HARDRESET_SET_SRC0                          (0x00000001)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC1] Bits */
#define RSTCTL_HARDRESET_SET_SRC1_OFS                      ( 1)                  /* SRC1 Offset */
#define RSTCTL_HARDRESET_SET_SRC1                          (0x00000002)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC2] Bits */
#define RSTCTL_HARDRESET_SET_SRC2_OFS                      ( 2)                  /* SRC2 Offset */
#define RSTCTL_HARDRESET_SET_SRC2                          (0x00000004)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC3] Bits */
#define RSTCTL_HARDRESET_SET_SRC3_OFS                      ( 3)                  /* SRC3 Offset */
#define RSTCTL_HARDRESET_SET_SRC3                          (0x00000008)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC4] Bits */
#define RSTCTL_HARDRESET_SET_SRC4_OFS                      ( 4)                  /* SRC4 Offset */
#define RSTCTL_HARDRESET_SET_SRC4                          (0x00000010)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC5] Bits */
#define RSTCTL_HARDRESET_SET_SRC5_OFS                      ( 5)                  /* SRC5 Offset */
#define RSTCTL_HARDRESET_SET_SRC5                          (0x00000020)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC6] Bits */
#define RSTCTL_HARDRESET_SET_SRC6_OFS                      ( 6)                  /* SRC6 Offset */
#define RSTCTL_HARDRESET_SET_SRC6                          (0x00000040)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC7] Bits */
#define RSTCTL_HARDRESET_SET_SRC7_OFS                      ( 7)                  /* SRC7 Offset */
#define RSTCTL_HARDRESET_SET_SRC7                          (0x00000080)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC8] Bits */
#define RSTCTL_HARDRESET_SET_SRC8_OFS                      ( 8)                  /* SRC8 Offset */
#define RSTCTL_HARDRESET_SET_SRC8                          (0x00000100)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC9] Bits */
#define RSTCTL_HARDRESET_SET_SRC9_OFS                      ( 9)                  /* SRC9 Offset */
#define RSTCTL_HARDRESET_SET_SRC9                          (0x00000200)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC10] Bits */
#define RSTCTL_HARDRESET_SET_SRC10_OFS                     (10)                  /* SRC10 Offset */
#define RSTCTL_HARDRESET_SET_SRC10                         (0x00000400)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC11] Bits */
#define RSTCTL_HARDRESET_SET_SRC11_OFS                     (11)                  /* SRC11 Offset */
#define RSTCTL_HARDRESET_SET_SRC11                         (0x00000800)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC12] Bits */
#define RSTCTL_HARDRESET_SET_SRC12_OFS                     (12)                  /* SRC12 Offset */
#define RSTCTL_HARDRESET_SET_SRC12                         (0x00001000)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC13] Bits */
#define RSTCTL_HARDRESET_SET_SRC13_OFS                     (13)                  /* SRC13 Offset */
#define RSTCTL_HARDRESET_SET_SRC13                         (0x00002000)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC14] Bits */
#define RSTCTL_HARDRESET_SET_SRC14_OFS                     (14)                  /* SRC14 Offset */
#define RSTCTL_HARDRESET_SET_SRC14                         (0x00004000)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_HARDRESET_SET[RSTCTL_HARDRESET_SET_SRC15] Bits */
#define RSTCTL_HARDRESET_SET_SRC15_OFS                     (15)                  /* SRC15 Offset */
#define RSTCTL_HARDRESET_SET_SRC15                         (0x00008000)          /* Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset) */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC0] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC0_OFS                     ( 0)                  /* SRC0 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC0                         (0x00000001)          /* If 1, indicates that SRC0 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC1] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC1_OFS                     ( 1)                  /* SRC1 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC1                         (0x00000002)          /* If 1, indicates that SRC1 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC2] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC2_OFS                     ( 2)                  /* SRC2 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC2                         (0x00000004)          /* If 1, indicates that SRC2 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC3] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC3_OFS                     ( 3)                  /* SRC3 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC3                         (0x00000008)          /* If 1, indicates that SRC3 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC4] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC4_OFS                     ( 4)                  /* SRC4 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC4                         (0x00000010)          /* If 1, indicates that SRC4 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC5] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC5_OFS                     ( 5)                  /* SRC5 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC5                         (0x00000020)          /* If 1, indicates that SRC5 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC6] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC6_OFS                     ( 6)                  /* SRC6 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC6                         (0x00000040)          /* If 1, indicates that SRC6 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC7] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC7_OFS                     ( 7)                  /* SRC7 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC7                         (0x00000080)          /* If 1, indicates that SRC7 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC8] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC8_OFS                     ( 8)                  /* SRC8 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC8                         (0x00000100)          /* If 1, indicates that SRC8 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC9] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC9_OFS                     ( 9)                  /* SRC9 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC9                         (0x00000200)          /* If 1, indicates that SRC9 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC10] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC10_OFS                    (10)                  /* SRC10 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC10                        (0x00000400)          /* If 1, indicates that SRC10 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC11] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC11_OFS                    (11)                  /* SRC11 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC11                        (0x00000800)          /* If 1, indicates that SRC11 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC12] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC12_OFS                    (12)                  /* SRC12 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC12                        (0x00001000)          /* If 1, indicates that SRC12 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC13] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC13_OFS                    (13)                  /* SRC13 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC13                        (0x00002000)          /* If 1, indicates that SRC13 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC14] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC14_OFS                    (14)                  /* SRC14 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC14                        (0x00004000)          /* If 1, indicates that SRC14 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_STAT[RSTCTL_SOFTRESET_STAT_SRC15] Bits */
#define RSTCTL_SOFTRESET_STAT_SRC15_OFS                    (15)                  /* SRC15 Offset */
#define RSTCTL_SOFTRESET_STAT_SRC15                        (0x00008000)          /* If 1, indicates that SRC15 was the source of the Soft Reset */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC0] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC0_OFS                      ( 0)                  /* SRC0 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC0                          (0x00000001)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC1] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC1_OFS                      ( 1)                  /* SRC1 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC1                          (0x00000002)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC2] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC2_OFS                      ( 2)                  /* SRC2 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC2                          (0x00000004)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC3] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC3_OFS                      ( 3)                  /* SRC3 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC3                          (0x00000008)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC4] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC4_OFS                      ( 4)                  /* SRC4 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC4                          (0x00000010)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC5] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC5_OFS                      ( 5)                  /* SRC5 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC5                          (0x00000020)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC6] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC6_OFS                      ( 6)                  /* SRC6 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC6                          (0x00000040)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC7] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC7_OFS                      ( 7)                  /* SRC7 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC7                          (0x00000080)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC8] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC8_OFS                      ( 8)                  /* SRC8 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC8                          (0x00000100)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC9] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC9_OFS                      ( 9)                  /* SRC9 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC9                          (0x00000200)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC10] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC10_OFS                     (10)                  /* SRC10 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC10                         (0x00000400)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC11] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC11_OFS                     (11)                  /* SRC11 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC11                         (0x00000800)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC12] Bits */
