arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
#define RSTCTL_SOFTRESET_CLR_SRC12_OFS                     (12)                  /* SRC12 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC12                         (0x00001000)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC13] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC13_OFS                     (13)                  /* SRC13 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC13                         (0x00002000)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC14] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC14_OFS                     (14)                  /* SRC14 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC14                         (0x00004000)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_CLR[RSTCTL_SOFTRESET_CLR_SRC15] Bits */
#define RSTCTL_SOFTRESET_CLR_SRC15_OFS                     (15)                  /* SRC15 Offset */
#define RSTCTL_SOFTRESET_CLR_SRC15                         (0x00008000)          /* Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_STAT */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC0] Bits */
#define RSTCTL_SOFTRESET_SET_SRC0_OFS                      ( 0)                  /* SRC0 Offset */
#define RSTCTL_SOFTRESET_SET_SRC0                          (0x00000001)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC1] Bits */
#define RSTCTL_SOFTRESET_SET_SRC1_OFS                      ( 1)                  /* SRC1 Offset */
#define RSTCTL_SOFTRESET_SET_SRC1                          (0x00000002)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC2] Bits */
#define RSTCTL_SOFTRESET_SET_SRC2_OFS                      ( 2)                  /* SRC2 Offset */
#define RSTCTL_SOFTRESET_SET_SRC2                          (0x00000004)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC3] Bits */
#define RSTCTL_SOFTRESET_SET_SRC3_OFS                      ( 3)                  /* SRC3 Offset */
#define RSTCTL_SOFTRESET_SET_SRC3                          (0x00000008)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC4] Bits */
#define RSTCTL_SOFTRESET_SET_SRC4_OFS                      ( 4)                  /* SRC4 Offset */
#define RSTCTL_SOFTRESET_SET_SRC4                          (0x00000010)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC5] Bits */
#define RSTCTL_SOFTRESET_SET_SRC5_OFS                      ( 5)                  /* SRC5 Offset */
#define RSTCTL_SOFTRESET_SET_SRC5                          (0x00000020)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC6] Bits */
#define RSTCTL_SOFTRESET_SET_SRC6_OFS                      ( 6)                  /* SRC6 Offset */
#define RSTCTL_SOFTRESET_SET_SRC6                          (0x00000040)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC7] Bits */
#define RSTCTL_SOFTRESET_SET_SRC7_OFS                      ( 7)                  /* SRC7 Offset */
#define RSTCTL_SOFTRESET_SET_SRC7                          (0x00000080)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC8] Bits */
#define RSTCTL_SOFTRESET_SET_SRC8_OFS                      ( 8)                  /* SRC8 Offset */
#define RSTCTL_SOFTRESET_SET_SRC8                          (0x00000100)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC9] Bits */
#define RSTCTL_SOFTRESET_SET_SRC9_OFS                      ( 9)                  /* SRC9 Offset */
#define RSTCTL_SOFTRESET_SET_SRC9                          (0x00000200)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC10] Bits */
#define RSTCTL_SOFTRESET_SET_SRC10_OFS                     (10)                  /* SRC10 Offset */
#define RSTCTL_SOFTRESET_SET_SRC10                         (0x00000400)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC11] Bits */
#define RSTCTL_SOFTRESET_SET_SRC11_OFS                     (11)                  /* SRC11 Offset */
#define RSTCTL_SOFTRESET_SET_SRC11                         (0x00000800)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC12] Bits */
#define RSTCTL_SOFTRESET_SET_SRC12_OFS                     (12)                  /* SRC12 Offset */
#define RSTCTL_SOFTRESET_SET_SRC12                         (0x00001000)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC13] Bits */
#define RSTCTL_SOFTRESET_SET_SRC13_OFS                     (13)                  /* SRC13 Offset */
#define RSTCTL_SOFTRESET_SET_SRC13                         (0x00002000)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC14] Bits */
#define RSTCTL_SOFTRESET_SET_SRC14_OFS                     (14)                  /* SRC14 Offset */
#define RSTCTL_SOFTRESET_SET_SRC14                         (0x00004000)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_SOFTRESET_SET[RSTCTL_SOFTRESET_SET_SRC15] Bits */
#define RSTCTL_SOFTRESET_SET_SRC15_OFS                     (15)                  /* SRC15 Offset */
#define RSTCTL_SOFTRESET_SET_SRC15                         (0x00008000)          /* Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT (and initiates a Soft Reset) */
/* RSTCTL_PSSRESET_STAT[RSTCTL_PSSRESET_STAT_SVSL] Bits */
#define RSTCTL_PSSRESET_STAT_SVSL_OFS                      ( 0)                  /* SVSL Offset */
#define RSTCTL_PSSRESET_STAT_SVSL                          (0x00000001)          /* Indicates if POR was caused by an SVSL trip condition in the PSS */
/* RSTCTL_PSSRESET_STAT[RSTCTL_PSSRESET_STAT_SVSMH] Bits */
#define RSTCTL_PSSRESET_STAT_SVSMH_OFS                     ( 1)                  /* SVSMH Offset */
#define RSTCTL_PSSRESET_STAT_SVSMH                         (0x00000002)          /* Indicates if POR was caused by an SVSMH trip condition int the PSS */
/* RSTCTL_PSSRESET_STAT[RSTCTL_PSSRESET_STAT_BGREF] Bits */
#define RSTCTL_PSSRESET_STAT_BGREF_OFS                     ( 2)                  /* BGREF Offset */
#define RSTCTL_PSSRESET_STAT_BGREF                         (0x00000004)          /* Indicates if POR was caused by a BGREF not okay condition in the PSS */
/* RSTCTL_PSSRESET_STAT[RSTCTL_PSSRESET_STAT_VCCDET] Bits */
#define RSTCTL_PSSRESET_STAT_VCCDET_OFS                    ( 3)                  /* VCCDET Offset */
#define RSTCTL_PSSRESET_STAT_VCCDET                        (0x00000008)          /* Indicates if POR was caused by a VCCDET trip condition in the PSS */
/* RSTCTL_PSSRESET_CLR[RSTCTL_PSSRESET_CLR_CLR] Bits */
#define RSTCTL_PSSRESET_CLR_CLR_OFS                        ( 0)                  /* CLR Offset */
#define RSTCTL_PSSRESET_CLR_CLR                            (0x00000001)          /* Write 1 clears all PSS Reset Flags in the RSTCTL_PSSRESET_STAT */
/* RSTCTL_PCMRESET_STAT[RSTCTL_PCMRESET_STAT_LPM35] Bits */
#define RSTCTL_PCMRESET_STAT_LPM35_OFS                     ( 0)                  /* LPM35 Offset */
#define RSTCTL_PCMRESET_STAT_LPM35                         (0x00000001)          /* Indicates if POR was caused by PCM due to an exit from LPM3.5 */
/* RSTCTL_PCMRESET_STAT[RSTCTL_PCMRESET_STAT_LPM45] Bits */
#define RSTCTL_PCMRESET_STAT_LPM45_OFS                     ( 1)                  /* LPM45 Offset */
#define RSTCTL_PCMRESET_STAT_LPM45                         (0x00000002)          /* Indicates if POR was caused by PCM due to an exit from LPM4.5 */
/* RSTCTL_PCMRESET_CLR[RSTCTL_PCMRESET_CLR_CLR] Bits */
#define RSTCTL_PCMRESET_CLR_CLR_OFS                        ( 0)                  /* CLR Offset */
#define RSTCTL_PCMRESET_CLR_CLR                            (0x00000001)          /* Write 1 clears all PCM Reset Flags in the RSTCTL_PCMRESET_STAT */
/* RSTCTL_PINRESET_STAT[RSTCTL_PINRESET_STAT_RSTNMI] Bits */
#define RSTCTL_PINRESET_STAT_RSTNMI_OFS                    ( 0)                  /* RSTNMI Offset */
#define RSTCTL_PINRESET_STAT_RSTNMI                        (0x00000001)          /* POR was caused by RSTn/NMI pin based reset event */
/* RSTCTL_PINRESET_CLR[RSTCTL_PINRESET_CLR_CLR] Bits */
#define RSTCTL_PINRESET_CLR_CLR_OFS                        ( 0)                  /* CLR Offset */
#define RSTCTL_PINRESET_CLR_CLR                            (0x00000001)          /* Write 1 clears the RSTn/NMI Pin Reset Flag in RSTCTL_PINRESET_STAT */
/* RSTCTL_REBOOTRESET_STAT[RSTCTL_REBOOTRESET_STAT_REBOOT] Bits */
#define RSTCTL_REBOOTRESET_STAT_REBOOT_OFS                 ( 0)                  /* REBOOT Offset */
#define RSTCTL_REBOOTRESET_STAT_REBOOT                     (0x00000001)          /* Indicates if Reboot reset was caused by the SYSCTL module. */
/* RSTCTL_REBOOTRESET_CLR[RSTCTL_REBOOTRESET_CLR_CLR] Bits */
#define RSTCTL_REBOOTRESET_CLR_CLR_OFS                     ( 0)                  /* CLR Offset */
#define RSTCTL_REBOOTRESET_CLR_CLR                         (0x00000001)          /* Write 1 clears the Reboot Reset Flag in RSTCTL_REBOOTRESET_STAT */

/* Pre-defined bitfield values */
#define RSTCTL_RESETREQ_RSTKEY_VAL                         (0x00006900)          /* Key value to enable writes to bits 1-0 */


