arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// RTC_C Bits
//*****************************************************************************
/* RTCCTL0[RTCRDYIFG] Bits */
#define RTCRDYIFG_OFS                                      ( 0)                  /* RTCRDYIFG Offset */
#define RTCRDYIFG                                          (0x0001)              /* Real-time clock ready interrupt flag */
/* RTCCTL0[RTCAIFG] Bits */
#define RTCAIFG_OFS                                        ( 1)                  /* RTCAIFG Offset */
#define RTCAIFG                                            (0x0002)              /* Real-time clock alarm interrupt flag */
/* RTCCTL0[RTCTEVIFG] Bits */
#define RTCTEVIFG_OFS                                      ( 2)                  /* RTCTEVIFG Offset */
#define RTCTEVIFG                                          (0x0004)              /* Real-time clock time event interrupt flag */
/* RTCCTL0[RTCOFIFG] Bits */
#define RTCOFIFG_OFS                                       ( 3)                  /* RTCOFIFG Offset */
#define RTCOFIFG                                           (0x0008)              /* 32-kHz crystal oscillator fault interrupt flag */
/* RTCCTL0[RTCRDYIE] Bits */
#define RTCRDYIE_OFS                                       ( 4)                  /* RTCRDYIE Offset */
#define RTCRDYIE                                           (0x0010)              /* Real-time clock ready interrupt enable */
/* RTCCTL0[RTCAIE] Bits */
#define RTCAIE_OFS                                         ( 5)                  /* RTCAIE Offset */
#define RTCAIE                                             (0x0020)              /* Real-time clock alarm interrupt enable */
/* RTCCTL0[RTCTEVIE] Bits */
#define RTCTEVIE_OFS                                       ( 6)                  /* RTCTEVIE Offset */
#define RTCTEVIE                                           (0x0040)              /* Real-time clock time event interrupt enable */
/* RTCCTL0[RTCOFIE] Bits */
#define RTCOFIE_OFS                                        ( 7)                  /* RTCOFIE Offset */
#define RTCOFIE                                            (0x0080)              /* 32-kHz crystal oscillator fault interrupt enable */
/* RTCCTL0[RTCKEY] Bits */
#define RTCKEY_OFS                                         ( 8)                  /* RTCKEY Offset */
#define RTCKEY_M                                           (0xff00)              /* Real-time clock key */
/* RTCCTL13[RTCTEV] Bits */
#define RTCTEV_OFS                                         ( 0)                  /* RTCTEV Offset */
#define RTCTEV_M                                           (0x0003)              /* Real-time clock time event */
#define RTCTEV0                                            (0x0001)              /* Real-time clock time event */
#define RTCTEV1                                            (0x0002)              /* Real-time clock time event */
#define RTCTEV_0                                           (0x0000)              /* Minute changed */
#define RTCTEV_1                                           (0x0001)              /* Hour changed */
#define RTCTEV_2                                           (0x0002)              /* Every day at midnight (00:00) */
#define RTCTEV_3                                           (0x0003)              /* Every day at noon (12:00) */
/* RTCCTL13[RTCSSEL] Bits */
#define RTCSSEL_OFS                                        ( 2)                  /* RTCSSEL Offset */
#define RTCSSEL_M                                          (0x000c)              /* Real-time clock source select */
#define RTCSSEL0                                           (0x0004)              /* Real-time clock source select */
#define RTCSSEL1                                           (0x0008)              /* Real-time clock source select */
#define RTCSSEL_0                                          (0x0000)              /* BCLK */
#define RTCSSEL__BCLK                                      (0x0000)              /* BCLK */
/* RTCCTL13[RTCRDY] Bits */
#define RTCRDY_OFS                                         ( 4)                  /* RTCRDY Offset */
#define RTCRDY                                             (0x0010)              /* Real-time clock ready */
/* RTCCTL13[RTCMODE] Bits */
#define RTCMODE_OFS                                        ( 5)                  /* RTCMODE Offset */
#define RTCMODE                                            (0x0020)              /*  */
/* RTCCTL13[RTCHOLD] Bits */
#define RTCHOLD_OFS                                        ( 6)                  /* RTCHOLD Offset */
#define RTCHOLD                                            (0x0040)              /* Real-time clock hold */
/* RTCCTL13[RTCBCD] Bits */
#define RTCBCD_OFS                                         ( 7)                  /* RTCBCD Offset */
#define RTCBCD                                             (0x0080)              /* Real-time clock BCD select */
/* RTCCTL13[RTCCALF] Bits */
#define RTCCALF_OFS                                        ( 8)                  /* RTCCALF Offset */
#define RTCCALF_M                                          (0x0300)              /* Real-time clock calibration frequency */
#define RTCCALF0                                           (0x0100)              /* Real-time clock calibration frequency */
#define RTCCALF1                                           (0x0200)              /* Real-time clock calibration frequency */
#define RTCCALF_0                                          (0x0000)              /* No frequency output to RTCCLK pin */
#define RTCCALF_1                                          (0x0100)              /* 512 Hz */
#define RTCCALF_2                                          (0x0200)              /* 256 Hz */
#define RTCCALF_3                                          (0x0300)              /* 1 Hz */
#define RTCCALF__NONE                                      (0x0000)              /* No frequency output to RTCCLK pin */
#define RTCCALF__512                                       (0x0100)              /* 512 Hz */
#define RTCCALF__256                                       (0x0200)              /* 256 Hz */
#define RTCCALF__1                                         (0x0300)              /* 1 Hz */
/* RTCOCAL[RTCOCAL] Bits */
#define RTCOCAL_OFS                                        ( 0)                  /* RTCOCAL Offset */
#define RTCOCAL_M                                          (0x00ff)              /* Real-time clock offset error calibration */
/* RTCOCAL[RTCOCALS] Bits */
#define RTCOCALS_OFS                                       (15)                  /* RTCOCALS Offset */
#define RTCOCALS                                           (0x8000)              /* Real-time clock offset error calibration sign */
/* RTCTCMP[RTCTCMP] Bits */
#define RTCTCMP_OFS                                        ( 0)                  /* RTCTCMP Offset */
#define RTCTCMP_M                                          (0x00ff)              /* Real-time clock temperature compensation */
/* RTCTCMP[RTCTCOK] Bits */
#define RTCTCOK_OFS                                        (13)                  /* RTCTCOK Offset */
#define RTCTCOK                                            (0x2000)              /* Real-time clock temperature compensation write OK */
/* RTCTCMP[RTCTCRDY] Bits */
#define RTCTCRDY_OFS                                       (14)                  /* RTCTCRDY Offset */
#define RTCTCRDY                                           (0x4000)              /* Real-time clock temperature compensation ready */
/* RTCTCMP[RTCTCMPS] Bits */
#define RTCTCMPS_OFS                                       (15)                  /* RTCTCMPS Offset */
#define RTCTCMPS                                           (0x8000)              /* Real-time clock temperature compensation sign */
/* RTCPS0CTL[RT0PSIFG] Bits */
#define RT0PSIFG_OFS                                       ( 0)                  /* RT0PSIFG Offset */
#define RT0PSIFG                                           (0x0001)              /* Prescale timer 0 interrupt flag */
/* RTCPS0CTL[RT0PSIE] Bits */
#define RT0PSIE_OFS                                        ( 1)                  /* RT0PSIE Offset */
#define RT0PSIE                                            (0x0002)              /* Prescale timer 0 interrupt enable */
/* RTCPS0CTL[RT0IP] Bits */
#define RT0IP_OFS                                          ( 2)                  /* RT0IP Offset */
#define RT0IP_M                                            (0x001c)              /* Prescale timer 0 interrupt interval */
#define RT0IP0                                             (0x0004)              /* Prescale timer 0 interrupt interval */
#define RT0IP1                                             (0x0008)              /* Prescale timer 0 interrupt interval */
#define RT0IP2                                             (0x0010)              /* Prescale timer 0 interrupt interval */
#define RT0IP_0                                            (0x0000)              /* Divide by 2 */
#define RT0IP_1                                            (0x0004)              /* Divide by 4 */
#define RT0IP_2                                            (0x0008)              /* Divide by 8 */
#define RT0IP_3                                            (0x000c)              /* Divide by 16 */
#define RT0IP_4                                            (0x0010)              /* Divide by 32 */
#define RT0IP_5                                            (0x0014)              /* Divide by 64 */
#define RT0IP_6                                            (0x0018)              /* Divide by 128 */
#define RT0IP_7                                            (0x001c)              /* Divide by 256 */
#define RT0IP__2                                           (0x0000)              /* Divide by 2 */
#define RT0IP__4                                           (0x0004)              /* Divide by 4 */
#define RT0IP__8                                           (0x0008)              /* Divide by 8 */
#define RT0IP__16                                          (0x000c)              /* Divide by 16 */
#define RT0IP__32                                          (0x0010)              /* Divide by 32 */
#define RT0IP__64                                          (0x0014)              /* Divide by 64 */
#define RT0IP__128                                         (0x0018)              /* Divide by 128 */
#define RT0IP__256                                         (0x001c)              /* Divide by 256 */
/* RTCPS1CTL[RT1PSIFG] Bits */
#define RT1PSIFG_OFS                                       ( 0)                  /* RT1PSIFG Offset */
#define RT1PSIFG                                           (0x0001)              /* Prescale timer 1 interrupt flag */
/* RTCPS1CTL[RT1PSIE] Bits */
#define RT1PSIE_OFS                                        ( 1)                  /* RT1PSIE Offset */
#define RT1PSIE                                            (0x0002)              /* Prescale timer 1 interrupt enable */
/* RTCPS1CTL[RT1IP] Bits */
#define RT1IP_OFS                                          ( 2)                  /* RT1IP Offset */
#define RT1IP_M                                            (0x001c)              /* Prescale timer 1 interrupt interval */
#define RT1IP0                                             (0x0004)              /* Prescale timer 1 interrupt interval */
#define RT1IP1                                             (0x0008)              /* Prescale timer 1 interrupt interval */
#define RT1IP2                                             (0x0010)              /* Prescale timer 1 interrupt interval */
#define RT1IP_0                                            (0x0000)              /* Divide by 2 */
#define RT1IP_1                                            (0x0004)              /* Divide by 4 */
#define RT1IP_2                                            (0x0008)              /* Divide by 8 */
#define RT1IP_3                                            (0x000c)              /* Divide by 16 */
#define RT1IP_4                                            (0x0010)              /* Divide by 32 */
#define RT1IP_5                                            (0x0014)              /* Divide by 64 */
#define RT1IP_6                                            (0x0018)              /* Divide by 128 */
#define RT1IP_7                                            (0x001c)              /* Divide by 256 */
#define RT1IP__2                                           (0x0000)              /* Divide by 2 */
#define RT1IP__4                                           (0x0004)              /* Divide by 4 */
#define RT1IP__8                                           (0x0008)              /* Divide by 8 */
#define RT1IP__16                                          (0x000c)              /* Divide by 16 */
#define RT1IP__32                                          (0x0010)              /* Divide by 32 */
#define RT1IP__64                                          (0x0014)              /* Divide by 64 */
#define RT1IP__128                                         (0x0018)              /* Divide by 128 */
#define RT1IP__256                                         (0x001c)              /* Divide by 256 */
/* RTCPS[RT0PS] Bits */
#define RT0PS_OFS                                          ( 0)                  /* RT0PS Offset */
#define RT0PS_M                                            (0x00ff)              /* Prescale timer 0 counter value */
/* RTCPS[RT1PS] Bits */
#define RT1PS_OFS                                          ( 8)                  /* RT1PS Offset */
#define RT1PS_M                                            (0xff00)              /* Prescale timer 1 counter value */
/* RTCTIM0[SECONDS] Bits */
#define SECONDS_OFS                                        ( 0)                  /* Seconds Offset */
#define SECONDS_M                                          (0x003f)              /* Seconds (0 to 59) */
/* RTCTIM0[MINUTES] Bits */
#define MINUTES_OFS                                        ( 8)                  /* Minutes Offset */
#define MINUTES_M                                          (0x3f00)              /* Minutes (0 to 59) */
/* RTCTIM0_BCD[SECONDSLOWDIGIT] Bits */
#define SECONDSLOWDIGIT_OFS                                ( 0)                  /* SecondsLowDigit Offset */
#define SECONDSLOWDIGIT_M                                  (0x000f)              /* Seconds ? low digit (0 to 9) */
/* RTCTIM0_BCD[SECONDSHIGHDIGIT] Bits */
#define SECONDSHIGHDIGIT_OFS                               ( 4)                  /* SecondsHighDigit Offset */
#define SECONDSHIGHDIGIT_M                                 (0x0070)              /* Seconds ? high digit (0 to 5) */
/* RTCTIM0_BCD[MINUTESLOWDIGIT] Bits */
#define MINUTESLOWDIGIT_OFS                                ( 8)                  /* MinutesLowDigit Offset */
#define MINUTESLOWDIGIT_M                                  (0x0f00)              /* Minutes ? low digit (0 to 9) */
/* RTCTIM0_BCD[MINUTESHIGHDIGIT] Bits */
#define MINUTESHIGHDIGIT_OFS                               (12)                  /* MinutesHighDigit Offset */
#define MINUTESHIGHDIGIT_M                                 (0x7000)              /* Minutes ? high digit (0 to 5) */
/* RTCTIM1[HOURS] Bits */
#define HOURS_OFS                                          ( 0)                  /* Hours Offset */
#define HOURS_M                                            (0x001f)              /* Hours (0 to 23) */
/* RTCTIM1[DAYOFWEEK] Bits */
#define DAYOFWEEK_OFS                                      ( 8)                  /* DayofWeek Offset */
#define DAYOFWEEK_M                                        (0x0700)              /* Day of week (0 to 6) */
/* RTCTIM1_BCD[HOURSLOWDIGIT] Bits */
#define HOURSLOWDIGIT_OFS                                  ( 0)                  /* HoursLowDigit Offset */
#define HOURSLOWDIGIT_M                                    (0x000f)              /* Hours ? low digit (0 to 9) */
/* RTCTIM1_BCD[HOURSHIGHDIGIT] Bits */
#define HOURSHIGHDIGIT_OFS                                 ( 4)                  /* HoursHighDigit Offset */
#define HOURSHIGHDIGIT_M                                   (0x0030)              /* Hours ? high digit (0 to 2) */
/* RTCTIM1_BCD[DAYOFWEEK] Bits */
//#define DAYOFWEEK_OFS                                      ( 8)                  /* DayofWeek Offset */
//#define DAYOFWEEK_M                                        (0x0700)              /* Day of week (0 to 6) */
/* RTCDATE[DAY] Bits */
#define DAY_OFS                                            ( 0)                  /* Day Offset */
#define DAY_M                                              (0x001f)              /* Day of month (1 to 28, 29, 30, 31) */
/* RTCDATE[MONTH] Bits */
#define MONTH_OFS                                          ( 8)                  /* Month Offset */
#define MONTH_M                                            (0x0f00)              /* Month (1 to 12) */
/* RTCDATE_BCD[DAYLOWDIGIT] Bits */
#define DAYLOWDIGIT_OFS                                    ( 0)                  /* DayLowDigit Offset */
#define DAYLOWDIGIT_M                                      (0x000f)              /* Day of month ? low digit (0 to 9) */
/* RTCDATE_BCD[DAYHIGHDIGIT] Bits */
#define DAYHIGHDIGIT_OFS                                   ( 4)                  /* DayHighDigit Offset */
#define DAYHIGHDIGIT_M                                     (0x0030)              /* Day of month ? high digit (0 to 3) */
/* RTCDATE_BCD[MONTHLOWDIGIT] Bits */
#define MONTHLOWDIGIT_OFS                                  ( 8)                  /* MonthLowDigit Offset */
#define MONTHLOWDIGIT_M                                    (0x0f00)              /* Month ? low digit (0 to 9) */
/* RTCDATE_BCD[MONTHHIGHDIGIT] Bits */
#define MONTHHIGHDIGIT_OFS                                 (12)                  /* MonthHighDigit Offset */
#define MONTHHIGHDIGIT                                     (0x1000)              /* Month ? high digit (0 or 1) */
/* RTCYEAR[YEARLOWBYTE] Bits */
#define YEARLOWBYTE_OFS                                    ( 0)                  /* YearLowByte Offset */
#define YEARLOWBYTE_M                                      (0x00ff)              /* Year ? low byte. Valid values for Year are 0 to 4095. */
/* RTCYEAR[YEARHIGHBYTE] Bits */
#define YEARHIGHBYTE_OFS                                   ( 8)                  /* YearHighByte Offset */
#define YEARHIGHBYTE_M                                     (0x0f00)              /* Year ? high byte. Valid values for Year are 0 to 4095. */
/* RTCYEAR_BCD[YEAR] Bits */
#define YEAR_OFS                                           ( 0)                  /* Year Offset */
#define YEAR_M                                             (0x000f)              /* Year ? lowest digit (0 to 9) */
/* RTCYEAR_BCD[DECADE] Bits */
#define DECADE_OFS                                         ( 4)                  /* Decade Offset */
#define DECADE_M                                           (0x00f0)              /* Decade (0 to 9) */
/* RTCYEAR_BCD[CENTURYLOWDIGIT] Bits */
#define CENTURYLOWDIGIT_OFS                                ( 8)                  /* CenturyLowDigit Offset */
#define CENTURYLOWDIGIT_M                                  (0x0f00)              /* Century ? low digit (0 to 9) */
/* RTCYEAR_BCD[CENTURYHIGHDIGIT] Bits */
#define CENTURYHIGHDIGIT_OFS                               (12)                  /* CenturyHighDigit Offset */
#define CENTURYHIGHDIGIT_M                                 (0x7000)              /* Century ? high digit (0 to 4) */
/* RTCAMINHR[MINUTES] Bits */
//#define MINUTES_OFS                                        ( 0)                  /* Minutes Offset */
//#define MINUTES_M                                          (0x003f)              /* Minutes (0 to 59) */
/* RTCAMINHR[MINAE] Bits */
#define MINAE_OFS                                          ( 7)                  /* MINAE Offset */
#define MINAE                                              (0x0080)              /* Alarm enable */
/* RTCAMINHR[HOURS] Bits */
//#define HOURS_OFS                                          ( 8)                  /* Hours Offset */
//#define HOURS_M                                            (0x1f00)              /* Hours (0 to 23) */
/* RTCAMINHR[HOURAE] Bits */
#define HOURAE_OFS                                         (15)                  /* HOURAE Offset */
#define HOURAE                                             (0x8000)              /* Alarm enable */
/* RTCAMINHR_BCD[MINUTESLOWDIGIT] Bits */
//#define MINUTESLOWDIGIT_OFS                                ( 0)                  /* MinutesLowDigit Offset */
//#define MINUTESLOWDIGIT_M                                  (0x000f)              /* Minutes ? low digit (0 to 9) */
/* RTCAMINHR_BCD[MINUTESHIGHDIGIT] Bits */
//#define MINUTESHIGHDIGIT_OFS                               ( 4)                  /* MinutesHighDigit Offset */
//#define MINUTESHIGHDIGIT_M                                 (0x0070)              /* Minutes ? high digit (0 to 5) */
/* RTCAMINHR_BCD[MINAE] Bits */
//#define MINAE_OFS                                          ( 7)                  /* MINAE Offset */
//#define MINAE                                              (0x0080)              /* Alarm enable */
/* RTCAMINHR_BCD[HOURSLOWDIGIT] Bits */
//#define HOURSLOWDIGIT_OFS                                  ( 8)                  /* HoursLowDigit Offset */
//#define HOURSLOWDIGIT_M                                    (0x0f00)              /* Hours ? low digit (0 to 9) */
/* RTCAMINHR_BCD[HOURSHIGHDIGIT] Bits */
//#define HOURSHIGHDIGIT_OFS                                 (12)                  /* HoursHighDigit Offset */
//#define HOURSHIGHDIGIT_M                                   (0x3000)              /* Hours ? high digit (0 to 2) */
/* RTCAMINHR_BCD[HOURAE] Bits */
//#define HOURAE_OFS                                         (15)                  /* HOURAE Offset */
//#define HOURAE                                             (0x8000)              /* Alarm enable */
/* RTCADOWDAY[DAYOFWEEK] Bits */
//#define DAYOFWEEK_OFS                                      ( 0)                  /* DayofWeek Offset */
//#define DAYOFWEEK_M                                        (0x0007)              /* Day of week (0 to 6) */
/* RTCADOWDAY[DOWAE] Bits */
#define DOWAE_OFS                                          ( 7)                  /* DOWAE Offset */
#define DOWAE                                              (0x0080)              /* Alarm enable */
/* RTCADOWDAY[DAYOFMONTH] Bits */
#define DAYOFMONTH_OFS                                     ( 8)                  /* DayofMonth Offset */
#define DAYOFMONTH_M                                       (0x1f00)              /* Day of month (1 to 28, 29, 30, 31) */
/* RTCADOWDAY[DAYAE] Bits */
#define DAYAE_OFS                                          (15)                  /* DAYAE Offset */
#define DAYAE                                              (0x8000)              /* Alarm enable */
/* RTCADOWDAY_BCD[DAYOFWEEK] Bits */
//#define DAYOFWEEK_OFS                                      ( 0)                  /* DayofWeek Offset */
//#define DAYOFWEEK_M                                        (0x0007)              /* Day of week (0 to 6) */
/* RTCADOWDAY_BCD[DOWAE] Bits */
//#define DOWAE_OFS                                          ( 7)                  /* DOWAE Offset */
//#define DOWAE                                              (0x0080)              /* Alarm enable */
/* RTCADOWDAY_BCD[DAYLOWDIGIT] Bits */
//#define DAYLOWDIGIT_OFS                                    ( 8)                  /* DayLowDigit Offset */
//#define DAYLOWDIGIT_M                                      (0x0f00)              /* Day of month ? low digit (0 to 9) */
/* RTCADOWDAY_BCD[DAYHIGHDIGIT] Bits */
