arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
#define SCB_DFR0_MICROCONTROLLER_DEBUG_MODEL1              (0x00200000)          /*  */
#define SCB_DFR0_MICROCONTROLLER_DEBUG_MODEL2              (0x00400000)          /*  */
#define SCB_DFR0_MICROCONTROLLER_DEBUG_MODEL3              (0x00800000)          /*  */
#define SCB_DFR0_MICROCONTROLLER_DEBUG_MODEL_0             (0x00000000)          /* not supported */
#define SCB_DFR0_MICROCONTROLLER_DEBUG_MODEL_1             (0x00100000)          /* Microcontroller debug v1 (ITMv1, DWTv1, optional ETM) */
/* SCB_MMFR0[SCB_MMFR0_PMSA_SUPPORT] Bits */
#define SCB_MMFR0_PMSA_SUPPORT_OFS                         ( 4)                  /* PMSA_SUPPORT Offset */
#define SCB_MMFR0_PMSA_SUPPORT_M                           (0x000000f0)          /*  */
#define SCB_MMFR0_PMSA_SUPPORT0                            (0x00000010)          /*  */
#define SCB_MMFR0_PMSA_SUPPORT1                            (0x00000020)          /*  */
#define SCB_MMFR0_PMSA_SUPPORT2                            (0x00000040)          /*  */
#define SCB_MMFR0_PMSA_SUPPORT3                            (0x00000080)          /*  */
#define SCB_MMFR0_PMSA_SUPPORT_0                           (0x00000000)          /* not supported */
#define SCB_MMFR0_PMSA_SUPPORT_1                           (0x00000010)          /* IMPLEMENTATION DEFINED (N/A) */
#define SCB_MMFR0_PMSA_SUPPORT_2                           (0x00000020)          /* PMSA base (features as defined for ARMv6) (N/A) */
#define SCB_MMFR0_PMSA_SUPPORT_3                           (0x00000030)          /* PMSAv7 (base plus subregion support) */
/* SCB_MMFR0[SCB_MMFR0_CACHE_COHERENCE_SUPPORT] Bits */
#define SCB_MMFR0_CACHE_COHERENCE_SUPPORT_OFS              ( 8)                  /* CACHE_COHERENCE_SUPPORT Offset */
#define SCB_MMFR0_CACHE_COHERENCE_SUPPORT_M                (0x00000f00)          /*  */
#define SCB_MMFR0_CACHE_COHERENCE_SUPPORT0                 (0x00000100)          /*  */
#define SCB_MMFR0_CACHE_COHERENCE_SUPPORT1                 (0x00000200)          /*  */
#define SCB_MMFR0_CACHE_COHERENCE_SUPPORT2                 (0x00000400)          /*  */
#define SCB_MMFR0_CACHE_COHERENCE_SUPPORT3                 (0x00000800)          /*  */
#define SCB_MMFR0_CACHE_COHERENCE_SUPPORT_0                (0x00000000)          /* no shared support */
#define SCB_MMFR0_CACHE_COHERENCE_SUPPORT_1                (0x00000100)          /* partial-inner-shared coherency (coherency amongst some - but not all - of the entities within an inner-coherent domain) */
#define SCB_MMFR0_CACHE_COHERENCE_SUPPORT_2                (0x00000200)          /* full-inner-shared coherency (coherency amongst all of the entities within an inner-coherent domain) */
#define SCB_MMFR0_CACHE_COHERENCE_SUPPORT_3                (0x00000300)          /* full coherency (coherency amongst all of the entities) */
/* SCB_MMFR0[SCB_MMFR0_OUTER_NON_SHARABLE_SUPPORT] Bits */
#define SCB_MMFR0_OUTER_NON_SHARABLE_SUPPORT_OFS           (12)                  /* OUTER_NON_SHARABLE_SUPPORT Offset */
#define SCB_MMFR0_OUTER_NON_SHARABLE_SUPPORT_M             (0x0000f000)          /*  */
#define SCB_MMFR0_OUTER_NON_SHARABLE_SUPPORT0              (0x00001000)          /*  */
#define SCB_MMFR0_OUTER_NON_SHARABLE_SUPPORT1              (0x00002000)          /*  */
#define SCB_MMFR0_OUTER_NON_SHARABLE_SUPPORT2              (0x00004000)          /*  */
#define SCB_MMFR0_OUTER_NON_SHARABLE_SUPPORT3              (0x00008000)          /*  */
#define SCB_MMFR0_OUTER_NON_SHARABLE_SUPPORT_0             (0x00000000)          /* Outer non-sharable not supported */
#define SCB_MMFR0_OUTER_NON_SHARABLE_SUPPORT_1             (0x00001000)          /* Outer sharable supported */
/* SCB_MMFR0[SCB_MMFR0_AUILIARY_REGISTER_SUPPORT] Bits */
#define SCB_MMFR0_AUILIARY_REGISTER_SUPPORT_OFS            (20)                  /* AUXILIARY_REGISTER_SUPPORT Offset */
#define SCB_MMFR0_AUILIARY_REGISTER_SUPPORT_M              (0x00f00000)          /*  */
#define SCB_MMFR0_AUILIARY_REGISTER_SUPPORT0               (0x00100000)          /*  */
#define SCB_MMFR0_AUILIARY_REGISTER_SUPPORT1               (0x00200000)          /*  */
#define SCB_MMFR0_AUILIARY_REGISTER_SUPPORT2               (0x00400000)          /*  */
#define SCB_MMFR0_AUILIARY_REGISTER_SUPPORT3               (0x00800000)          /*  */
#define SCB_MMFR0_AUILIARY_REGISTER_SUPPORT_0              (0x00000000)          /* not supported */
#define SCB_MMFR0_AUILIARY_REGISTER_SUPPORT_1              (0x00100000)          /* Auxiliary control register */
/* SCB_MMFR2[SCB_MMFR2_WAIT_FOR_INTERRUPT_STALLING] Bits */
#define SCB_MMFR2_WAIT_FOR_INTERRUPT_STALLING_OFS          (24)                  /* WAIT_FOR_INTERRUPT_STALLING Offset */
#define SCB_MMFR2_WAIT_FOR_INTERRUPT_STALLING_M            (0x0f000000)          /*  */
#define SCB_MMFR2_WAIT_FOR_INTERRUPT_STALLING0             (0x01000000)          /*  */
#define SCB_MMFR2_WAIT_FOR_INTERRUPT_STALLING1             (0x02000000)          /*  */
#define SCB_MMFR2_WAIT_FOR_INTERRUPT_STALLING2             (0x04000000)          /*  */
#define SCB_MMFR2_WAIT_FOR_INTERRUPT_STALLING3             (0x08000000)          /*  */
#define SCB_MMFR2_WAIT_FOR_INTERRUPT_STALLING_0            (0x00000000)          /* not supported */
#define SCB_MMFR2_WAIT_FOR_INTERRUPT_STALLING_1            (0x01000000)          /* wait for interrupt supported */
/* SCB_ISAR0[SCB_ISAR0_BITCOUNT_INSTRS] Bits */
#define SCB_ISAR0_BITCOUNT_INSTRS_OFS                      ( 4)                  /* BITCOUNT_INSTRS Offset */
#define SCB_ISAR0_BITCOUNT_INSTRS_M                        (0x000000f0)          /*  */
#define SCB_ISAR0_BITCOUNT_INSTRS0                         (0x00000010)          /*  */
#define SCB_ISAR0_BITCOUNT_INSTRS1                         (0x00000020)          /*  */
#define SCB_ISAR0_BITCOUNT_INSTRS2                         (0x00000040)          /*  */
#define SCB_ISAR0_BITCOUNT_INSTRS3                         (0x00000080)          /*  */
#define SCB_ISAR0_BITCOUNT_INSTRS_0                        (0x00000000)          /* no bit-counting instructions present */
#define SCB_ISAR0_BITCOUNT_INSTRS_1                        (0x00000010)          /* adds CLZ */
/* SCB_ISAR0[SCB_ISAR0_BITFIELD_INSTRS] Bits */
#define SCB_ISAR0_BITFIELD_INSTRS_OFS                      ( 8)                  /* BITFIELD_INSTRS Offset */
#define SCB_ISAR0_BITFIELD_INSTRS_M                        (0x00000f00)          /*  */
#define SCB_ISAR0_BITFIELD_INSTRS0                         (0x00000100)          /*  */
#define SCB_ISAR0_BITFIELD_INSTRS1                         (0x00000200)          /*  */
#define SCB_ISAR0_BITFIELD_INSTRS2                         (0x00000400)          /*  */
#define SCB_ISAR0_BITFIELD_INSTRS3                         (0x00000800)          /*  */
#define SCB_ISAR0_BITFIELD_INSTRS_0                        (0x00000000)          /* no bitfield instructions present */
#define SCB_ISAR0_BITFIELD_INSTRS_1                        (0x00000100)          /* adds BFC, BFI, SBFX, UBFX */
/* SCB_ISAR0[SCB_ISAR0_CMPBRANCH_INSTRS] Bits */
#define SCB_ISAR0_CMPBRANCH_INSTRS_OFS                     (12)                  /* CMPBRANCH_INSTRS Offset */
#define SCB_ISAR0_CMPBRANCH_INSTRS_M                       (0x0000f000)          /*  */
#define SCB_ISAR0_CMPBRANCH_INSTRS0                        (0x00001000)          /*  */
#define SCB_ISAR0_CMPBRANCH_INSTRS1                        (0x00002000)          /*  */
#define SCB_ISAR0_CMPBRANCH_INSTRS2                        (0x00004000)          /*  */
#define SCB_ISAR0_CMPBRANCH_INSTRS3                        (0x00008000)          /*  */
#define SCB_ISAR0_CMPBRANCH_INSTRS_0                       (0x00000000)          /* no combined compare-and-branch instructions present */
#define SCB_ISAR0_CMPBRANCH_INSTRS_1                       (0x00001000)          /* adds CB{N}Z */
/* SCB_ISAR0[SCB_ISAR0_COPROC_INSTRS] Bits */
#define SCB_ISAR0_COPROC_INSTRS_OFS                        (16)                  /* COPROC_INSTRS Offset */
#define SCB_ISAR0_COPROC_INSTRS_M                          (0x000f0000)          /*  */
#define SCB_ISAR0_COPROC_INSTRS0                           (0x00010000)          /*  */
#define SCB_ISAR0_COPROC_INSTRS1                           (0x00020000)          /*  */
#define SCB_ISAR0_COPROC_INSTRS2                           (0x00040000)          /*  */
#define SCB_ISAR0_COPROC_INSTRS3                           (0x00080000)          /*  */
#define SCB_ISAR0_COPROC_INSTRS_0                          (0x00000000)          /* no coprocessor support, other than for separately attributed architectures such as CP15 or VFP */
#define SCB_ISAR0_COPROC_INSTRS_1                          (0x00010000)          /* adds generic CDP, LDC, MCR, MRC, STC */
#define SCB_ISAR0_COPROC_INSTRS_2                          (0x00020000)          /* adds generic CDP2, LDC2, MCR2, MRC2, STC2 */
#define SCB_ISAR0_COPROC_INSTRS_3                          (0x00030000)          /* adds generic MCRR, MRRC */
#define SCB_ISAR0_COPROC_INSTRS_4                          (0x00040000)          /* adds generic MCRR2, MRRC2 */
/* SCB_ISAR0[SCB_ISAR0_DEBUG_INSTRS] Bits */
#define SCB_ISAR0_DEBUG_INSTRS_OFS                         (20)                  /* DEBUG_INSTRS Offset */
#define SCB_ISAR0_DEBUG_INSTRS_M                           (0x00f00000)          /*  */
#define SCB_ISAR0_DEBUG_INSTRS0                            (0x00100000)          /*  */
#define SCB_ISAR0_DEBUG_INSTRS1                            (0x00200000)          /*  */
#define SCB_ISAR0_DEBUG_INSTRS2                            (0x00400000)          /*  */
#define SCB_ISAR0_DEBUG_INSTRS3                            (0x00800000)          /*  */
#define SCB_ISAR0_DEBUG_INSTRS_0                           (0x00000000)          /* no debug instructions present */
#define SCB_ISAR0_DEBUG_INSTRS_1                           (0x00100000)          /* adds BKPT */
/* SCB_ISAR0[SCB_ISAR0_DIVIDE_INSTRS] Bits */
#define SCB_ISAR0_DIVIDE_INSTRS_OFS                        (24)                  /* DIVIDE_INSTRS Offset */
#define SCB_ISAR0_DIVIDE_INSTRS_M                          (0x0f000000)          /*  */
#define SCB_ISAR0_DIVIDE_INSTRS0                           (0x01000000)          /*  */
#define SCB_ISAR0_DIVIDE_INSTRS1                           (0x02000000)          /*  */
#define SCB_ISAR0_DIVIDE_INSTRS2                           (0x04000000)          /*  */
#define SCB_ISAR0_DIVIDE_INSTRS3                           (0x08000000)          /*  */
#define SCB_ISAR0_DIVIDE_INSTRS_0                          (0x00000000)          /* no divide instructions present */
#define SCB_ISAR0_DIVIDE_INSTRS_1                          (0x01000000)          /* adds SDIV, UDIV (v1 quotient only result) */
/* SCB_ISAR1[SCB_ISAR1_ETEND_INSRS] Bits */
#define SCB_ISAR1_ETEND_INSRS_OFS                          (12)                  /* EXTEND_INSRS Offset */
#define SCB_ISAR1_ETEND_INSRS_M                            (0x0000f000)          /*  */
#define SCB_ISAR1_ETEND_INSRS0                             (0x00001000)          /*  */
#define SCB_ISAR1_ETEND_INSRS1                             (0x00002000)          /*  */
#define SCB_ISAR1_ETEND_INSRS2                             (0x00004000)          /*  */
#define SCB_ISAR1_ETEND_INSRS3                             (0x00008000)          /*  */
#define SCB_ISAR1_ETEND_INSRS_0                            (0x00000000)          /* no scalar (i.e. non-SIMD) sign/zero-extend instructions present */
#define SCB_ISAR1_ETEND_INSRS_1                            (0x00001000)          /* adds SXTB, SXTH, UXTB, UXTH */
#define SCB_ISAR1_ETEND_INSRS_2                            (0x00002000)          /* N/A */
/* SCB_ISAR1[SCB_ISAR1_IFTHEN_INSTRS] Bits */
#define SCB_ISAR1_IFTHEN_INSTRS_OFS                        (16)                  /* IFTHEN_INSTRS Offset */
#define SCB_ISAR1_IFTHEN_INSTRS_M                          (0x000f0000)          /*  */
#define SCB_ISAR1_IFTHEN_INSTRS0                           (0x00010000)          /*  */
#define SCB_ISAR1_IFTHEN_INSTRS1                           (0x00020000)          /*  */
#define SCB_ISAR1_IFTHEN_INSTRS2                           (0x00040000)          /*  */
#define SCB_ISAR1_IFTHEN_INSTRS3                           (0x00080000)          /*  */
#define SCB_ISAR1_IFTHEN_INSTRS_0                          (0x00000000)          /* IT instructions not present */
#define SCB_ISAR1_IFTHEN_INSTRS_1                          (0x00010000)          /* adds IT instructions (and IT bits in PSRs) */
/* SCB_ISAR1[SCB_ISAR1_IMMEDIATE_INSTRS] Bits */
#define SCB_ISAR1_IMMEDIATE_INSTRS_OFS                     (20)                  /* IMMEDIATE_INSTRS Offset */
#define SCB_ISAR1_IMMEDIATE_INSTRS_M                       (0x00f00000)          /*  */
#define SCB_ISAR1_IMMEDIATE_INSTRS0                        (0x00100000)          /*  */
#define SCB_ISAR1_IMMEDIATE_INSTRS1                        (0x00200000)          /*  */
#define SCB_ISAR1_IMMEDIATE_INSTRS2                        (0x00400000)          /*  */
#define SCB_ISAR1_IMMEDIATE_INSTRS3                        (0x00800000)          /*  */
#define SCB_ISAR1_IMMEDIATE_INSTRS_0                       (0x00000000)          /* no special immediate-generating instructions present */
#define SCB_ISAR1_IMMEDIATE_INSTRS_1                       (0x00100000)          /* adds ADDW, MOVW, MOVT, SUBW */
/* SCB_ISAR1[SCB_ISAR1_INTERWORK_INSTRS] Bits */
#define SCB_ISAR1_INTERWORK_INSTRS_OFS                     (24)                  /* INTERWORK_INSTRS Offset */
#define SCB_ISAR1_INTERWORK_INSTRS_M                       (0x0f000000)          /*  */
#define SCB_ISAR1_INTERWORK_INSTRS0                        (0x01000000)          /*  */
#define SCB_ISAR1_INTERWORK_INSTRS1                        (0x02000000)          /*  */
#define SCB_ISAR1_INTERWORK_INSTRS2                        (0x04000000)          /*  */
#define SCB_ISAR1_INTERWORK_INSTRS3                        (0x08000000)          /*  */
#define SCB_ISAR1_INTERWORK_INSTRS_0                       (0x00000000)          /* no interworking instructions supported */
#define SCB_ISAR1_INTERWORK_INSTRS_1                       (0x01000000)          /* adds BX (and T bit in PSRs) */
#define SCB_ISAR1_INTERWORK_INSTRS_2                       (0x02000000)          /* adds BLX, and PC loads have BX-like behavior */
#define SCB_ISAR1_INTERWORK_INSTRS_3                       (0x03000000)          /* N/A */
/* SCB_ISAR2[SCB_ISAR2_LOADSTORE_INSTRS] Bits */
#define SCB_ISAR2_LOADSTORE_INSTRS_OFS                     ( 0)                  /* LOADSTORE_INSTRS Offset */
#define SCB_ISAR2_LOADSTORE_INSTRS_M                       (0x0000000f)          /*  */
#define SCB_ISAR2_LOADSTORE_INSTRS0                        (0x00000001)          /*  */
#define SCB_ISAR2_LOADSTORE_INSTRS1                        (0x00000002)          /*  */
#define SCB_ISAR2_LOADSTORE_INSTRS2                        (0x00000004)          /*  */
#define SCB_ISAR2_LOADSTORE_INSTRS3                        (0x00000008)          /*  */
#define SCB_ISAR2_LOADSTORE_INSTRS_0                       (0x00000000)          /* no additional normal load/store instructions present */
#define SCB_ISAR2_LOADSTORE_INSTRS_1                       (0x00000001)          /* adds LDRD/STRD */
/* SCB_ISAR2[SCB_ISAR2_MEMHINT_INSTRS] Bits */
#define SCB_ISAR2_MEMHINT_INSTRS_OFS                       ( 4)                  /* MEMHINT_INSTRS Offset */
#define SCB_ISAR2_MEMHINT_INSTRS_M                         (0x000000f0)          /*  */
#define SCB_ISAR2_MEMHINT_INSTRS0                          (0x00000010)          /*  */
#define SCB_ISAR2_MEMHINT_INSTRS1                          (0x00000020)          /*  */
#define SCB_ISAR2_MEMHINT_INSTRS2                          (0x00000040)          /*  */
#define SCB_ISAR2_MEMHINT_INSTRS3                          (0x00000080)          /*  */
#define SCB_ISAR2_MEMHINT_INSTRS_0                         (0x00000000)          /* no memory hint instructions presen */
#define SCB_ISAR2_MEMHINT_INSTRS_1                         (0x00000010)          /* adds PLD */
#define SCB_ISAR2_MEMHINT_INSTRS_2                         (0x00000020)          /* adds PLD (ie a repeat on value 1) */
#define SCB_ISAR2_MEMHINT_INSTRS_3                         (0x00000030)          /* adds PLI */
/* SCB_ISAR2[SCB_ISAR2_MULTIACCESSINT_INSTRS] Bits */
#define SCB_ISAR2_MULTIACCESSINT_INSTRS_OFS                ( 8)                  /* MULTIACCESSINT_INSTRS Offset */
#define SCB_ISAR2_MULTIACCESSINT_INSTRS_M                  (0x00000f00)          /*  */
#define SCB_ISAR2_MULTIACCESSINT_INSTRS0                   (0x00000100)          /*  */
#define SCB_ISAR2_MULTIACCESSINT_INSTRS1                   (0x00000200)          /*  */
#define SCB_ISAR2_MULTIACCESSINT_INSTRS2                   (0x00000400)          /*  */
#define SCB_ISAR2_MULTIACCESSINT_INSTRS3                   (0x00000800)          /*  */
#define SCB_ISAR2_MULTIACCESSINT_INSTRS_0                  (0x00000000)          /* the (LDM/STM) instructions are non-interruptible */
#define SCB_ISAR2_MULTIACCESSINT_INSTRS_1                  (0x00000100)          /* the (LDM/STM) instructions are restartable */
#define SCB_ISAR2_MULTIACCESSINT_INSTRS_2                  (0x00000200)          /* the (LDM/STM) instructions are continuable */
/* SCB_ISAR2[SCB_ISAR2_MULT_INSTRS] Bits */
#define SCB_ISAR2_MULT_INSTRS_OFS                          (12)                  /* MULT_INSTRS Offset */
#define SCB_ISAR2_MULT_INSTRS_M                            (0x0000f000)          /*  */
#define SCB_ISAR2_MULT_INSTRS0                             (0x00001000)          /*  */
#define SCB_ISAR2_MULT_INSTRS1                             (0x00002000)          /*  */
#define SCB_ISAR2_MULT_INSTRS2                             (0x00004000)          /*  */
#define SCB_ISAR2_MULT_INSTRS3                             (0x00008000)          /*  */
#define SCB_ISAR2_MULT_INSTRS_0                            (0x00000000)          /* only MUL present */
#define SCB_ISAR2_MULT_INSTRS_1                            (0x00001000)          /* adds MLA */
#define SCB_ISAR2_MULT_INSTRS_2                            (0x00002000)          /* adds MLS */
/* SCB_ISAR2[SCB_ISAR2_MULTS_INSTRS] Bits */
#define SCB_ISAR2_MULTS_INSTRS_OFS                         (16)                  /* MULTS_INSTRS Offset */
#define SCB_ISAR2_MULTS_INSTRS_M                           (0x000f0000)          /*  */
#define SCB_ISAR2_MULTS_INSTRS0                            (0x00010000)          /*  */
#define SCB_ISAR2_MULTS_INSTRS1                            (0x00020000)          /*  */
#define SCB_ISAR2_MULTS_INSTRS2                            (0x00040000)          /*  */
#define SCB_ISAR2_MULTS_INSTRS3                            (0x00080000)          /*  */
#define SCB_ISAR2_MULTS_INSTRS_0                           (0x00000000)          /* no signed multiply instructions present */
#define SCB_ISAR2_MULTS_INSTRS_1                           (0x00010000)          /* adds SMULL, SMLAL */
#define SCB_ISAR2_MULTS_INSTRS_2                           (0x00020000)          /* N/A */
#define SCB_ISAR2_MULTS_INSTRS_3                           (0x00030000)          /* N/A */
/* SCB_ISAR2[SCB_ISAR2_MULTU_INSTRS] Bits */
#define SCB_ISAR2_MULTU_INSTRS_OFS                         (20)                  /* MULTU_INSTRS Offset */
#define SCB_ISAR2_MULTU_INSTRS_M                           (0x00f00000)          /*  */
#define SCB_ISAR2_MULTU_INSTRS0                            (0x00100000)          /*  */
#define SCB_ISAR2_MULTU_INSTRS1                            (0x00200000)          /*  */
#define SCB_ISAR2_MULTU_INSTRS2                            (0x00400000)          /*  */
#define SCB_ISAR2_MULTU_INSTRS3                            (0x00800000)          /*  */
#define SCB_ISAR2_MULTU_INSTRS_0                           (0x00000000)          /* no unsigned multiply instructions present */
#define SCB_ISAR2_MULTU_INSTRS_1                           (0x00100000)          /* adds UMULL, UMLAL */
#define SCB_ISAR2_MULTU_INSTRS_2                           (0x00200000)          /* N/A */
/* SCB_ISAR2[SCB_ISAR2_REVERSAL_INSTRS] Bits */
#define SCB_ISAR2_REVERSAL_INSTRS_OFS                      (28)                  /* REVERSAL_INSTRS Offset */
#define SCB_ISAR2_REVERSAL_INSTRS_M                        (0xf0000000)          /*  */
#define SCB_ISAR2_REVERSAL_INSTRS0                         (0x10000000)          /*  */
#define SCB_ISAR2_REVERSAL_INSTRS1                         (0x20000000)          /*  */
#define SCB_ISAR2_REVERSAL_INSTRS2                         (0x40000000)          /*  */
#define SCB_ISAR2_REVERSAL_INSTRS3                         (0x80000000)          /*  */
#define SCB_ISAR2_REVERSAL_INSTRS_0                        (0x00000000)          /* no reversal instructions present */
#define SCB_ISAR2_REVERSAL_INSTRS_1                        (0x10000000)          /* adds REV, REV16, REVSH */
#define SCB_ISAR2_REVERSAL_INSTRS_2                        (0x20000000)          /* adds RBIT */
/* SCB_ISAR3[SCB_ISAR3_SATRUATE_INSTRS] Bits */
#define SCB_ISAR3_SATRUATE_INSTRS_OFS                      ( 0)                  /* SATRUATE_INSTRS Offset */
#define SCB_ISAR3_SATRUATE_INSTRS_M                        (0x0000000f)          /*  */
#define SCB_ISAR3_SATRUATE_INSTRS0                         (0x00000001)          /*  */
#define SCB_ISAR3_SATRUATE_INSTRS1                         (0x00000002)          /*  */
#define SCB_ISAR3_SATRUATE_INSTRS2                         (0x00000004)          /*  */
#define SCB_ISAR3_SATRUATE_INSTRS3                         (0x00000008)          /*  */
#define SCB_ISAR3_SATRUATE_INSTRS_0                        (0x00000000)          /* no non-SIMD saturate instructions present */
#define SCB_ISAR3_SATRUATE_INSTRS_1                        (0x00000001)          /* N/A */
/* SCB_ISAR3[SCB_ISAR3_SIMD_INSTRS] Bits */
#define SCB_ISAR3_SIMD_INSTRS_OFS                          ( 4)                  /* SIMD_INSTRS Offset */
#define SCB_ISAR3_SIMD_INSTRS_M                            (0x000000f0)          /*  */
#define SCB_ISAR3_SIMD_INSTRS0                             (0x00000010)          /*  */
#define SCB_ISAR3_SIMD_INSTRS1                             (0x00000020)          /*  */
#define SCB_ISAR3_SIMD_INSTRS2                             (0x00000040)          /*  */
#define SCB_ISAR3_SIMD_INSTRS3                             (0x00000080)          /*  */
#define SCB_ISAR3_SIMD_INSTRS_0                            (0x00000000)          /* no SIMD instructions present */
#define SCB_ISAR3_SIMD_INSTRS_1                            (0x00000010)          /* adds SSAT, USAT (and the Q flag in the PSRs) */
#define SCB_ISAR3_SIMD_INSTRS_3                            (0x00000030)          /* N/A */
/* SCB_ISAR3[SCB_ISAR3_SVC_INSTRS] Bits */
#define SCB_ISAR3_SVC_INSTRS_OFS                           ( 8)                  /* SVC_INSTRS Offset */
#define SCB_ISAR3_SVC_INSTRS_M                             (0x00000f00)          /*  */
#define SCB_ISAR3_SVC_INSTRS0                              (0x00000100)          /*  */
#define SCB_ISAR3_SVC_INSTRS1                              (0x00000200)          /*  */
#define SCB_ISAR3_SVC_INSTRS2                              (0x00000400)          /*  */
#define SCB_ISAR3_SVC_INSTRS3                              (0x00000800)          /*  */
#define SCB_ISAR3_SVC_INSTRS_0                             (0x00000000)          /* no SVC (SWI) instructions present */
#define SCB_ISAR3_SVC_INSTRS_1                             (0x00000100)          /* adds SVC (SWI) */
/* SCB_ISAR3[SCB_ISAR3_SYNCPRIM_INSTRS] Bits */
#define SCB_ISAR3_SYNCPRIM_INSTRS_OFS                      (12)                  /* SYNCPRIM_INSTRS Offset */
#define SCB_ISAR3_SYNCPRIM_INSTRS_M                        (0x0000f000)          /*  */
#define SCB_ISAR3_SYNCPRIM_INSTRS0                         (0x00001000)          /*  */
