arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
#define SCB_ISAR3_SYNCPRIM_INSTRS1                         (0x00002000)          /*  */
#define SCB_ISAR3_SYNCPRIM_INSTRS2                         (0x00004000)          /*  */
#define SCB_ISAR3_SYNCPRIM_INSTRS3                         (0x00008000)          /*  */
#define SCB_ISAR3_SYNCPRIM_INSTRS_0                        (0x00000000)          /* no synchronization primitives present */
#define SCB_ISAR3_SYNCPRIM_INSTRS_1                        (0x00001000)          /* adds LDREX, STREX */
#define SCB_ISAR3_SYNCPRIM_INSTRS_2                        (0x00002000)          /* adds LDREXB, LDREXH, LDREXD, STREXB, STREXH, STREXD, CLREX(N/A) */
/* SCB_ISAR3[SCB_ISAR3_TABBRANCH_INSTRS] Bits */
#define SCB_ISAR3_TABBRANCH_INSTRS_OFS                     (16)                  /* TABBRANCH_INSTRS Offset */
#define SCB_ISAR3_TABBRANCH_INSTRS_M                       (0x000f0000)          /*  */
#define SCB_ISAR3_TABBRANCH_INSTRS0                        (0x00010000)          /*  */
#define SCB_ISAR3_TABBRANCH_INSTRS1                        (0x00020000)          /*  */
#define SCB_ISAR3_TABBRANCH_INSTRS2                        (0x00040000)          /*  */
#define SCB_ISAR3_TABBRANCH_INSTRS3                        (0x00080000)          /*  */
#define SCB_ISAR3_TABBRANCH_INSTRS_0                       (0x00000000)          /* no table-branch instructions present */
#define SCB_ISAR3_TABBRANCH_INSTRS_1                       (0x00010000)          /* adds TBB, TBH */
/* SCB_ISAR3[SCB_ISAR3_THUMBCOPY_INSTRS] Bits */
#define SCB_ISAR3_THUMBCOPY_INSTRS_OFS                     (20)                  /* THUMBCOPY_INSTRS Offset */
#define SCB_ISAR3_THUMBCOPY_INSTRS_M                       (0x00f00000)          /*  */
#define SCB_ISAR3_THUMBCOPY_INSTRS0                        (0x00100000)          /*  */
#define SCB_ISAR3_THUMBCOPY_INSTRS1                        (0x00200000)          /*  */
#define SCB_ISAR3_THUMBCOPY_INSTRS2                        (0x00400000)          /*  */
#define SCB_ISAR3_THUMBCOPY_INSTRS3                        (0x00800000)          /*  */
#define SCB_ISAR3_THUMBCOPY_INSTRS_0                       (0x00000000)          /* Thumb MOV(register) instruction does not allow low reg -> low reg */
#define SCB_ISAR3_THUMBCOPY_INSTRS_1                       (0x00100000)          /* adds Thumb MOV(register) low reg -> low reg and the CPY alias */
/* SCB_ISAR3[SCB_ISAR3_TRUENOP_INSTRS] Bits */
#define SCB_ISAR3_TRUENOP_INSTRS_OFS                       (24)                  /* TRUENOP_INSTRS Offset */
#define SCB_ISAR3_TRUENOP_INSTRS_M                         (0x0f000000)          /*  */
#define SCB_ISAR3_TRUENOP_INSTRS0                          (0x01000000)          /*  */
#define SCB_ISAR3_TRUENOP_INSTRS1                          (0x02000000)          /*  */
#define SCB_ISAR3_TRUENOP_INSTRS2                          (0x04000000)          /*  */
#define SCB_ISAR3_TRUENOP_INSTRS3                          (0x08000000)          /*  */
#define SCB_ISAR3_TRUENOP_INSTRS_0                         (0x00000000)          /* true NOP instructions not present - that is, NOP instructions with no register dependencies */
#define SCB_ISAR3_TRUENOP_INSTRS_1                         (0x01000000)          /* adds "true NOP", and the capability of additional "NOP compatible hints" */
/* SCB_ISAR4[SCB_ISAR4_UNPRIV_INSTRS] Bits */
#define SCB_ISAR4_UNPRIV_INSTRS_OFS                        ( 0)                  /* UNPRIV_INSTRS Offset */
#define SCB_ISAR4_UNPRIV_INSTRS_M                          (0x0000000f)          /*  */
#define SCB_ISAR4_UNPRIV_INSTRS0                           (0x00000001)          /*  */
#define SCB_ISAR4_UNPRIV_INSTRS1                           (0x00000002)          /*  */
#define SCB_ISAR4_UNPRIV_INSTRS2                           (0x00000004)          /*  */
#define SCB_ISAR4_UNPRIV_INSTRS3                           (0x00000008)          /*  */
#define SCB_ISAR4_UNPRIV_INSTRS_0                          (0x00000000)          /* no "T variant" instructions exist */
#define SCB_ISAR4_UNPRIV_INSTRS_1                          (0x00000001)          /* adds LDRBT, LDRT, STRBT, STRT */
#define SCB_ISAR4_UNPRIV_INSTRS_2                          (0x00000002)          /* adds LDRHT, LDRSBT, LDRSHT, STRHT */
/* SCB_ISAR4[SCB_ISAR4_WITHSHIFTS_INSTRS] Bits */
#define SCB_ISAR4_WITHSHIFTS_INSTRS_OFS                    ( 4)                  /* WITHSHIFTS_INSTRS Offset */
#define SCB_ISAR4_WITHSHIFTS_INSTRS_M                      (0x000000f0)          /*  */
#define SCB_ISAR4_WITHSHIFTS_INSTRS0                       (0x00000010)          /*  */
#define SCB_ISAR4_WITHSHIFTS_INSTRS1                       (0x00000020)          /*  */
#define SCB_ISAR4_WITHSHIFTS_INSTRS2                       (0x00000040)          /*  */
#define SCB_ISAR4_WITHSHIFTS_INSTRS3                       (0x00000080)          /*  */
#define SCB_ISAR4_WITHSHIFTS_INSTRS_0                      (0x00000000)          /* non-zero shifts only support MOV and shift instructions (see notes) */
#define SCB_ISAR4_WITHSHIFTS_INSTRS_1                      (0x00000010)          /* shifts of loads/stores over the range LSL 0-3 */
#define SCB_ISAR4_WITHSHIFTS_INSTRS_3                      (0x00000030)          /* adds other constant shift options. */
#define SCB_ISAR4_WITHSHIFTS_INSTRS_4                      (0x00000040)          /* adds register-controlled shift options. */
/* SCB_ISAR4[SCB_ISAR4_WRITEBACK_INSTRS] Bits */
#define SCB_ISAR4_WRITEBACK_INSTRS_OFS                     ( 8)                  /* WRITEBACK_INSTRS Offset */
#define SCB_ISAR4_WRITEBACK_INSTRS_M                       (0x00000f00)          /*  */
#define SCB_ISAR4_WRITEBACK_INSTRS0                        (0x00000100)          /*  */
#define SCB_ISAR4_WRITEBACK_INSTRS1                        (0x00000200)          /*  */
#define SCB_ISAR4_WRITEBACK_INSTRS2                        (0x00000400)          /*  */
#define SCB_ISAR4_WRITEBACK_INSTRS3                        (0x00000800)          /*  */
#define SCB_ISAR4_WRITEBACK_INSTRS_0                       (0x00000000)          /* only non-writeback addressing modes present, except that LDMIA/STMDB/PUSH/POP instructions support writeback addressing. */
#define SCB_ISAR4_WRITEBACK_INSTRS_1                       (0x00000100)          /* adds all currently-defined writeback addressing modes (ARMv7, Thumb-2) */
/* SCB_ISAR4[SCB_ISAR4_BARRIER_INSTRS] Bits */
#define SCB_ISAR4_BARRIER_INSTRS_OFS                       (16)                  /* BARRIER_INSTRS Offset */
#define SCB_ISAR4_BARRIER_INSTRS_M                         (0x000f0000)          /*  */
#define SCB_ISAR4_BARRIER_INSTRS0                          (0x00010000)          /*  */
#define SCB_ISAR4_BARRIER_INSTRS1                          (0x00020000)          /*  */
#define SCB_ISAR4_BARRIER_INSTRS2                          (0x00040000)          /*  */
#define SCB_ISAR4_BARRIER_INSTRS3                          (0x00080000)          /*  */
#define SCB_ISAR4_BARRIER_INSTRS_0                         (0x00000000)          /* no barrier instructions supported */
#define SCB_ISAR4_BARRIER_INSTRS_1                         (0x00010000)          /* adds DMB, DSB, ISB barrier instructions */
/* SCB_ISAR4[SCB_ISAR4_SYNCPRIM_INSTRS_FRAC] Bits */
#define SCB_ISAR4_SYNCPRIM_INSTRS_FRAC_OFS                 (20)                  /* SYNCPRIM_INSTRS_FRAC Offset */
#define SCB_ISAR4_SYNCPRIM_INSTRS_FRAC_M                   (0x00f00000)          /*  */
#define SCB_ISAR4_SYNCPRIM_INSTRS_FRAC0                    (0x00100000)          /*  */
#define SCB_ISAR4_SYNCPRIM_INSTRS_FRAC1                    (0x00200000)          /*  */
#define SCB_ISAR4_SYNCPRIM_INSTRS_FRAC2                    (0x00400000)          /*  */
#define SCB_ISAR4_SYNCPRIM_INSTRS_FRAC3                    (0x00800000)          /*  */
#define SCB_ISAR4_SYNCPRIM_INSTRS_FRAC_0                   (0x00000000)          /* no additional support */
#define SCB_ISAR4_SYNCPRIM_INSTRS_FRAC_3                   (0x00300000)          /* adds CLREX, LDREXB, STREXB, LDREXH, STREXH */
/* SCB_ISAR4[SCB_ISAR4_PSR_M_INSTRS] Bits */
#define SCB_ISAR4_PSR_M_INSTRS_OFS                         (24)                  /* PSR_M_INSTRS Offset */
#define SCB_ISAR4_PSR_M_INSTRS_M                           (0x0f000000)          /*  */
#define SCB_ISAR4_PSR_M_INSTRS0                            (0x01000000)          /*  */
#define SCB_ISAR4_PSR_M_INSTRS1                            (0x02000000)          /*  */
#define SCB_ISAR4_PSR_M_INSTRS2                            (0x04000000)          /*  */
#define SCB_ISAR4_PSR_M_INSTRS3                            (0x08000000)          /*  */
#define SCB_ISAR4_PSR_M_INSTRS_0                           (0x00000000)          /* instructions not present */
#define SCB_ISAR4_PSR_M_INSTRS_1                           (0x01000000)          /* adds CPS, MRS, and MSR instructions (M-profile forms) */
/* SCB_CPACR[SCB_CPACR_CP11] Bits */
#define SCB_CPACR_CP11_OFS                                 (22)                  /* CP11 Offset */
#define SCB_CPACR_CP11_M                                   (0x00c00000)          /*  */
/* SCB_CPACR[SCB_CPACR_CP10] Bits */
#define SCB_CPACR_CP10_OFS                                 (20)                  /* CP10 Offset */
#define SCB_CPACR_CP10_M                                   (0x00300000)          /*  */


//*****************************************************************************
// SCnSCB Bits
//*****************************************************************************
/* SCSCB_ICTR[SCNSCB_ICTR_INTLINESNUM] Bits */
#define SCNSCB_ICTR_INTLINESNUM_OFS                        ( 0)                  /* INTLINESNUM Offset */
#define SCNSCB_ICTR_INTLINESNUM_M                          (0x0000001f)          /*  */
/* SCSCB_ACTLR[SCNSCB_ACTLR_DISMCYCINT] Bits */
#define SCNSCB_ACTLR_DISMCYCINT_OFS                        ( 0)                  /* DISMCYCINT Offset */
#define SCNSCB_ACTLR_DISMCYCINT                            (0x00000001)          /*  */
/* SCSCB_ACTLR[SCNSCB_ACTLR_DISDEFWBUF] Bits */
#define SCNSCB_ACTLR_DISDEFWBUF_OFS                        ( 1)                  /* DISDEFWBUF Offset */
#define SCNSCB_ACTLR_DISDEFWBUF                            (0x00000002)          /*  */
/* SCSCB_ACTLR[SCNSCB_ACTLR_DISFOLD] Bits */
#define SCNSCB_ACTLR_DISFOLD_OFS                           ( 2)                  /* DISFOLD Offset */
#define SCNSCB_ACTLR_DISFOLD                               (0x00000004)          /*  */


