arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// SYSCTL Bits
//*****************************************************************************
/* SYSCTL_REBOOT_CTL[SYSCTL_REBOOT_CTL_REBOOT] Bits */
#define SYSCTL_REBOOT_CTL_REBOOT_OFS                       ( 0)                  /* REBOOT Offset */
#define SYSCTL_REBOOT_CTL_REBOOT                           (0x00000001)          /* Write 1 initiates a Reboot of the device */
/* SYSCTL_REBOOT_CTL[SYSCTL_REBOOT_CTL_WKEY] Bits */
#define SYSCTL_REBOOT_CTL_WKEY_OFS                         ( 8)                  /* WKEY Offset */
#define SYSCTL_REBOOT_CTL_WKEY_M                           (0x0000ff00)          /* Key to enable writes to bit 0 */
/* SYSCTL_NMI_CTLSTAT[SYSCTL_NMI_CTLSTAT_CS_SRC] Bits */
#define SYSCTL_NMI_CTLSTAT_CS_SRC_OFS                      ( 0)                  /* CS_SRC Offset */
#define SYSCTL_NMI_CTLSTAT_CS_SRC                          (0x00000001)          /* CS interrupt as a source of NMI */
/* SYSCTL_NMI_CTLSTAT[SYSCTL_NMI_CTLSTAT_PSS_SRC] Bits */
#define SYSCTL_NMI_CTLSTAT_PSS_SRC_OFS                     ( 1)                  /* PSS_SRC Offset */
#define SYSCTL_NMI_CTLSTAT_PSS_SRC                         (0x00000002)          /* PSS interrupt as a source of NMI */
/* SYSCTL_NMI_CTLSTAT[SYSCTL_NMI_CTLSTAT_PCM_SRC] Bits */
#define SYSCTL_NMI_CTLSTAT_PCM_SRC_OFS                     ( 2)                  /* PCM_SRC Offset */
#define SYSCTL_NMI_CTLSTAT_PCM_SRC                         (0x00000004)          /* PCM interrupt as a source of NMI */
/* SYSCTL_NMI_CTLSTAT[SYSCTL_NMI_CTLSTAT_PIN_SRC] Bits */
#define SYSCTL_NMI_CTLSTAT_PIN_SRC_OFS                     ( 3)                  /* PIN_SRC Offset */
#define SYSCTL_NMI_CTLSTAT_PIN_SRC                         (0x00000008)          /*  */
/* SYSCTL_NMI_CTLSTAT[SYSCTL_NMI_CTLSTAT_CS_FLG] Bits */
#define SYSCTL_NMI_CTLSTAT_CS_FLG_OFS                      (16)                  /* CS_FLG Offset */
#define SYSCTL_NMI_CTLSTAT_CS_FLG                          (0x00010000)          /* CS interrupt was the source of NMI */
/* SYSCTL_NMI_CTLSTAT[SYSCTL_NMI_CTLSTAT_PSS_FLG] Bits */
#define SYSCTL_NMI_CTLSTAT_PSS_FLG_OFS                     (17)                  /* PSS_FLG Offset */
#define SYSCTL_NMI_CTLSTAT_PSS_FLG                         (0x00020000)          /* PSS interrupt was the source of NMI */
/* SYSCTL_NMI_CTLSTAT[SYSCTL_NMI_CTLSTAT_PCM_FLG] Bits */
#define SYSCTL_NMI_CTLSTAT_PCM_FLG_OFS                     (18)                  /* PCM_FLG Offset */
#define SYSCTL_NMI_CTLSTAT_PCM_FLG                         (0x00040000)          /* PCM interrupt was the source of NMI */
/* SYSCTL_NMI_CTLSTAT[SYSCTL_NMI_CTLSTAT_PIN_FLG] Bits */
#define SYSCTL_NMI_CTLSTAT_PIN_FLG_OFS                     (19)                  /* PIN_FLG Offset */
#define SYSCTL_NMI_CTLSTAT_PIN_FLG                         (0x00080000)          /* RSTn/NMI pin was the source of NMI */
/* SYSCTL_WDTRESET_CTL[SYSCTL_WDTRESET_CTL_TIMEOUT] Bits */
#define SYSCTL_WDTRESET_CTL_TIMEOUT_OFS                    ( 0)                  /* TIMEOUT Offset */
#define SYSCTL_WDTRESET_CTL_TIMEOUT                        (0x00000001)          /* WDT timeout reset type */
/* SYSCTL_WDTRESET_CTL[SYSCTL_WDTRESET_CTL_VIOLATION] Bits */
#define SYSCTL_WDTRESET_CTL_VIOLATION_OFS                  ( 1)                  /* VIOLATION Offset */
#define SYSCTL_WDTRESET_CTL_VIOLATION                      (0x00000002)          /* WDT password violation reset type */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_T16_0] Bits */
#define SYSCTL_PERIHALT_CTL_T16_0_OFS                      ( 0)                  /* T16_0 Offset */
#define SYSCTL_PERIHALT_CTL_T16_0                          (0x00000001)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_T16_1] Bits */
#define SYSCTL_PERIHALT_CTL_T16_1_OFS                      ( 1)                  /* T16_1 Offset */
#define SYSCTL_PERIHALT_CTL_T16_1                          (0x00000002)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_T16_2] Bits */
#define SYSCTL_PERIHALT_CTL_T16_2_OFS                      ( 2)                  /* T16_2 Offset */
#define SYSCTL_PERIHALT_CTL_T16_2                          (0x00000004)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_T16_3] Bits */
#define SYSCTL_PERIHALT_CTL_T16_3_OFS                      ( 3)                  /* T16_3 Offset */
#define SYSCTL_PERIHALT_CTL_T16_3                          (0x00000008)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_T32_0] Bits */
#define SYSCTL_PERIHALT_CTL_T32_0_OFS                      ( 4)                  /* T32_0 Offset */
#define SYSCTL_PERIHALT_CTL_T32_0                          (0x00000010)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_EUA0] Bits */
#define SYSCTL_PERIHALT_CTL_EUA0_OFS                       ( 5)                  /* eUA0 Offset */
#define SYSCTL_PERIHALT_CTL_EUA0                           (0x00000020)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_EUA1] Bits */
#define SYSCTL_PERIHALT_CTL_EUA1_OFS                       ( 6)                  /* eUA1 Offset */
#define SYSCTL_PERIHALT_CTL_EUA1                           (0x00000040)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_EUA2] Bits */
#define SYSCTL_PERIHALT_CTL_EUA2_OFS                       ( 7)                  /* eUA2 Offset */
#define SYSCTL_PERIHALT_CTL_EUA2                           (0x00000080)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_EUA3] Bits */
#define SYSCTL_PERIHALT_CTL_EUA3_OFS                       ( 8)                  /* eUA3 Offset */
#define SYSCTL_PERIHALT_CTL_EUA3                           (0x00000100)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_EUB0] Bits */
#define SYSCTL_PERIHALT_CTL_EUB0_OFS                       ( 9)                  /* eUB0 Offset */
#define SYSCTL_PERIHALT_CTL_EUB0                           (0x00000200)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_EUB1] Bits */
#define SYSCTL_PERIHALT_CTL_EUB1_OFS                       (10)                  /* eUB1 Offset */
#define SYSCTL_PERIHALT_CTL_EUB1                           (0x00000400)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_EUB2] Bits */
#define SYSCTL_PERIHALT_CTL_EUB2_OFS                       (11)                  /* eUB2 Offset */
#define SYSCTL_PERIHALT_CTL_EUB2                           (0x00000800)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_EUB3] Bits */
#define SYSCTL_PERIHALT_CTL_EUB3_OFS                       (12)                  /* eUB3 Offset */
#define SYSCTL_PERIHALT_CTL_EUB3                           (0x00001000)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_ADC] Bits */
#define SYSCTL_PERIHALT_CTL_ADC_OFS                        (13)                  /* ADC Offset */
#define SYSCTL_PERIHALT_CTL_ADC                            (0x00002000)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_WDT] Bits */
#define SYSCTL_PERIHALT_CTL_WDT_OFS                        (14)                  /* WDT Offset */
#define SYSCTL_PERIHALT_CTL_WDT                            (0x00004000)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_PERIHALT_CTL[SYSCTL_PERIHALT_CTL_DMA] Bits */
#define SYSCTL_PERIHALT_CTL_DMA_OFS                        (15)                  /* DMA Offset */
#define SYSCTL_PERIHALT_CTL_DMA                            (0x00008000)          /* Freezes IP operation when CPU is halted */
/* SYSCTL_SRAM_BANKEN[SYSCTL_SRAM_BANKEN_BNK0_EN] Bits */
#define SYSCTL_SRAM_BANKEN_BNK0_EN_OFS                     ( 0)                  /* BNK0_EN Offset */
#define SYSCTL_SRAM_BANKEN_BNK0_EN                         (0x00000001)          /* SRAM Bank0 enable */
/* SYSCTL_SRAM_BANKEN[SYSCTL_SRAM_BANKEN_BNK1_EN] Bits */
#define SYSCTL_SRAM_BANKEN_BNK1_EN_OFS                     ( 1)                  /* BNK1_EN Offset */
#define SYSCTL_SRAM_BANKEN_BNK1_EN                         (0x00000002)          /* SRAM Bank1 enable */
/* SYSCTL_SRAM_BANKEN[SYSCTL_SRAM_BANKEN_BNK2_EN] Bits */
#define SYSCTL_SRAM_BANKEN_BNK2_EN_OFS                     ( 2)                  /* BNK2_EN Offset */
#define SYSCTL_SRAM_BANKEN_BNK2_EN                         (0x00000004)          /* SRAM Bank1 enable */
/* SYSCTL_SRAM_BANKEN[SYSCTL_SRAM_BANKEN_BNK3_EN] Bits */
#define SYSCTL_SRAM_BANKEN_BNK3_EN_OFS                     ( 3)                  /* BNK3_EN Offset */
#define SYSCTL_SRAM_BANKEN_BNK3_EN                         (0x00000008)          /* SRAM Bank1 enable */
/* SYSCTL_SRAM_BANKEN[SYSCTL_SRAM_BANKEN_BNK4_EN] Bits */
#define SYSCTL_SRAM_BANKEN_BNK4_EN_OFS                     ( 4)                  /* BNK4_EN Offset */
#define SYSCTL_SRAM_BANKEN_BNK4_EN                         (0x00000010)          /* SRAM Bank1 enable */
/* SYSCTL_SRAM_BANKEN[SYSCTL_SRAM_BANKEN_BNK5_EN] Bits */
#define SYSCTL_SRAM_BANKEN_BNK5_EN_OFS                     ( 5)                  /* BNK5_EN Offset */
#define SYSCTL_SRAM_BANKEN_BNK5_EN                         (0x00000020)          /* SRAM Bank1 enable */
/* SYSCTL_SRAM_BANKEN[SYSCTL_SRAM_BANKEN_BNK6_EN] Bits */
#define SYSCTL_SRAM_BANKEN_BNK6_EN_OFS                     ( 6)                  /* BNK6_EN Offset */
#define SYSCTL_SRAM_BANKEN_BNK6_EN                         (0x00000040)          /* SRAM Bank1 enable */
/* SYSCTL_SRAM_BANKEN[SYSCTL_SRAM_BANKEN_BNK7_EN] Bits */
#define SYSCTL_SRAM_BANKEN_BNK7_EN_OFS                     ( 7)                  /* BNK7_EN Offset */
#define SYSCTL_SRAM_BANKEN_BNK7_EN                         (0x00000080)          /* SRAM Bank1 enable */
/* SYSCTL_SRAM_BANKEN[SYSCTL_SRAM_BANKEN_SRAM_RDY] Bits */
#define SYSCTL_SRAM_BANKEN_SRAM_RDY_OFS                    (16)                  /* SRAM_RDY Offset */
#define SYSCTL_SRAM_BANKEN_SRAM_RDY                        (0x00010000)          /* SRAM ready */
/* SYSCTL_SRAM_BANKRET[SYSCTL_SRAM_BANKRET_BNK0_RET] Bits */
#define SYSCTL_SRAM_BANKRET_BNK0_RET_OFS                   ( 0)                  /* BNK0_RET Offset */
#define SYSCTL_SRAM_BANKRET_BNK0_RET                       (0x00000001)          /* Bank0 retention */
/* SYSCTL_SRAM_BANKRET[SYSCTL_SRAM_BANKRET_BNK1_RET] Bits */
#define SYSCTL_SRAM_BANKRET_BNK1_RET_OFS                   ( 1)                  /* BNK1_RET Offset */
#define SYSCTL_SRAM_BANKRET_BNK1_RET                       (0x00000002)          /* Bank1 retention */
/* SYSCTL_SRAM_BANKRET[SYSCTL_SRAM_BANKRET_BNK2_RET] Bits */
#define SYSCTL_SRAM_BANKRET_BNK2_RET_OFS                   ( 2)                  /* BNK2_RET Offset */
#define SYSCTL_SRAM_BANKRET_BNK2_RET                       (0x00000004)          /* Bank2 retention */
/* SYSCTL_SRAM_BANKRET[SYSCTL_SRAM_BANKRET_BNK3_RET] Bits */
#define SYSCTL_SRAM_BANKRET_BNK3_RET_OFS                   ( 3)                  /* BNK3_RET Offset */
#define SYSCTL_SRAM_BANKRET_BNK3_RET                       (0x00000008)          /* Bank3 retention */
/* SYSCTL_SRAM_BANKRET[SYSCTL_SRAM_BANKRET_BNK4_RET] Bits */
#define SYSCTL_SRAM_BANKRET_BNK4_RET_OFS                   ( 4)                  /* BNK4_RET Offset */
#define SYSCTL_SRAM_BANKRET_BNK4_RET                       (0x00000010)          /* Bank4 retention */
/* SYSCTL_SRAM_BANKRET[SYSCTL_SRAM_BANKRET_BNK5_RET] Bits */
#define SYSCTL_SRAM_BANKRET_BNK5_RET_OFS                   ( 5)                  /* BNK5_RET Offset */
#define SYSCTL_SRAM_BANKRET_BNK5_RET                       (0x00000020)          /* Bank5 retention */
/* SYSCTL_SRAM_BANKRET[SYSCTL_SRAM_BANKRET_BNK6_RET] Bits */
#define SYSCTL_SRAM_BANKRET_BNK6_RET_OFS                   ( 6)                  /* BNK6_RET Offset */
#define SYSCTL_SRAM_BANKRET_BNK6_RET                       (0x00000040)          /* Bank6 retention */
/* SYSCTL_SRAM_BANKRET[SYSCTL_SRAM_BANKRET_BNK7_RET] Bits */
#define SYSCTL_SRAM_BANKRET_BNK7_RET_OFS                   ( 7)                  /* BNK7_RET Offset */
#define SYSCTL_SRAM_BANKRET_BNK7_RET                       (0x00000080)          /* Bank7 retention */
/* SYSCTL_SRAM_BANKRET[SYSCTL_SRAM_BANKRET_SRAM_RDY] Bits */
#define SYSCTL_SRAM_BANKRET_SRAM_RDY_OFS                   (16)                  /* SRAM_RDY Offset */
#define SYSCTL_SRAM_BANKRET_SRAM_RDY                       (0x00010000)          /* SRAM ready */
/* SYSCTL_DIO_GLTFLT_CTL[SYSCTL_DIO_GLTFLT_CTL_GLTCH_EN] Bits */
#define SYSCTL_DIO_GLTFLT_CTL_GLTCH_EN_OFS                 ( 0)                  /* GLTCH_EN Offset */
#define SYSCTL_DIO_GLTFLT_CTL_GLTCH_EN                     (0x00000001)          /* Glitch filter enable */
/* SYSCTL_SECDATA_UNLOCK[SYSCTL_SECDATA_UNLOCK_UNLKEY] Bits */
#define SYSCTL_SECDATA_UNLOCK_UNLKEY_OFS                   ( 0)                  /* UNLKEY Offset */
#define SYSCTL_SECDATA_UNLOCK_UNLKEY_M                     (0x0000ffff)          /* Unlock key */
/* SYSCTL_MASTER_UNLOCK[SYSCTL_MASTER_UNLOCK_UNLKEY] Bits */
#define SYSCTL_MASTER_UNLOCK_UNLKEY_OFS                    ( 0)                  /* UNLKEY Offset */
#define SYSCTL_MASTER_UNLOCK_UNLKEY_M                      (0x0000ffff)          /* Unlock Key */
/* SYSCTL_RESET_REQ[SYSCTL_RESET_REQ_POR] Bits */
#define SYSCTL_RESET_REQ_POR_OFS                           ( 0)                  /* POR Offset */
#define SYSCTL_RESET_REQ_POR                               (0x00000001)          /* Generate POR */
/* SYSCTL_RESET_REQ[SYSCTL_RESET_REQ_REBOOT] Bits */
#define SYSCTL_RESET_REQ_REBOOT_OFS                        ( 1)                  /* REBOOT Offset */
#define SYSCTL_RESET_REQ_REBOOT                            (0x00000002)          /* Generate Reboot_Reset */
/* SYSCTL_RESET_REQ[SYSCTL_RESET_REQ_WKEY] Bits */
#define SYSCTL_RESET_REQ_WKEY_OFS                          ( 8)                  /* WKEY Offset */
#define SYSCTL_RESET_REQ_WKEY_M                            (0x0000ff00)          /* Write key */
/* SYSCTL_RESET_STATOVER[SYSCTL_RESET_STATOVER_SOFT] Bits */
#define SYSCTL_RESET_STATOVER_SOFT_OFS                     ( 0)                  /* SOFT Offset */
#define SYSCTL_RESET_STATOVER_SOFT                         (0x00000001)          /* Indicates if SOFT Reset is active */
/* SYSCTL_RESET_STATOVER[SYSCTL_RESET_STATOVER_HARD] Bits */
#define SYSCTL_RESET_STATOVER_HARD_OFS                     ( 1)                  /* HARD Offset */
#define SYSCTL_RESET_STATOVER_HARD                         (0x00000002)          /* Indicates if HARD Reset is active */
/* SYSCTL_RESET_STATOVER[SYSCTL_RESET_STATOVER_REBOOT] Bits */
#define SYSCTL_RESET_STATOVER_REBOOT_OFS                   ( 2)                  /* REBOOT Offset */
#define SYSCTL_RESET_STATOVER_REBOOT                       (0x00000004)          /* Indicates if Reboot Reset is active */
/* SYSCTL_RESET_STATOVER[SYSCTL_RESET_STATOVER_SOFT_OVER] Bits */
#define SYSCTL_RESET_STATOVER_SOFT_OVER_OFS                ( 8)                  /* SOFT_OVER Offset */
#define SYSCTL_RESET_STATOVER_SOFT_OVER                    (0x00000100)          /* SOFT_Reset overwrite request */
/* SYSCTL_RESET_STATOVER[SYSCTL_RESET_STATOVER_HARD_OVER] Bits */
#define SYSCTL_RESET_STATOVER_HARD_OVER_OFS                ( 9)                  /* HARD_OVER Offset */
#define SYSCTL_RESET_STATOVER_HARD_OVER                    (0x00000200)          /* HARD_Reset overwrite request */
/* SYSCTL_RESET_STATOVER[SYSCTL_RESET_STATOVER_RBT_OVER] Bits */
#define SYSCTL_RESET_STATOVER_RBT_OVER_OFS                 (10)                  /* RBT_OVER Offset */
#define SYSCTL_RESET_STATOVER_RBT_OVER                     (0x00000400)          /* Reboot Reset overwrite request */
/* SYSCTL_SYSTEM_STAT[SYSCTL_SYSTEM_STAT_DBG_SEC_ACT] Bits */
#define SYSCTL_SYSTEM_STAT_DBG_SEC_ACT_OFS                 ( 3)                  /* DBG_SEC_ACT Offset */
#define SYSCTL_SYSTEM_STAT_DBG_SEC_ACT                     (0x00000008)          /* Debug Security active */
/* SYSCTL_SYSTEM_STAT[SYSCTL_SYSTEM_STAT_JTAG_SWD_LOCK_ACT] Bits */
#define SYSCTL_SYSTEM_STAT_JTAG_SWD_LOCK_ACT_OFS           ( 4)                  /* JTAG_SWD_LOCK_ACT Offset */
#define SYSCTL_SYSTEM_STAT_JTAG_SWD_LOCK_ACT               (0x00000010)          /* Indicates if JTAG and SWD Lock is active */
/* SYSCTL_SYSTEM_STAT[SYSCTL_SYSTEM_STAT_IP_PROT_ACT] Bits */
#define SYSCTL_SYSTEM_STAT_IP_PROT_ACT_OFS                 ( 5)                  /* IP_PROT_ACT Offset */
#define SYSCTL_SYSTEM_STAT_IP_PROT_ACT                     (0x00000020)          /* Indicates if IP protection is active */

/* Pre-defined bitfield values */
#define SYSCTL_REBOOT_CTL_WKEY_VAL                         (0x00006900)          /* Key value to enable writes to bit 0 */
                                                                                /* cleared */

//*****************************************************************************
// SYSTICK Bits
//*****************************************************************************
/* SYSTICK_STCSR[SYSTICK_STCSR_ENABLE] Bits */
#define SYSTICK_STCSR_ENABLE_OFS                           ( 0)                  /* ENABLE Offset */
#define SYSTICK_STCSR_ENABLE                               (0x00000001)          /*  */
/* SYSTICK_STCSR[SYSTICK_STCSR_TICKINT] Bits */
#define SYSTICK_STCSR_TICKINT_OFS                          ( 1)                  /* TICKINT Offset */
#define SYSTICK_STCSR_TICKINT                              (0x00000002)          /*  */
/* SYSTICK_STCSR[SYSTICK_STCSR_CLKSOURCE] Bits */
#define SYSTICK_STCSR_CLKSOURCE_OFS                        ( 2)                  /* CLKSOURCE Offset */
#define SYSTICK_STCSR_CLKSOURCE                            (0x00000004)          /*  */
/* SYSTICK_STCSR[SYSTICK_STCSR_COUNTFLAG] Bits */
#define SYSTICK_STCSR_COUNTFLAG_OFS                        (16)                  /* COUNTFLAG Offset */
#define SYSTICK_STCSR_COUNTFLAG                            (0x00010000)          /*  */
/* SYSTICK_STRVR[SYSTICK_STRVR_RELOAD] Bits */
#define SYSTICK_STRVR_RELOAD_OFS                           ( 0)                  /* RELOAD Offset */
#define SYSTICK_STRVR_RELOAD_M                             (0x00ffffff)          /*  */
/* SYSTICK_STCVR[SYSTICK_STCVR_CURRENT] Bits */
#define SYSTICK_STCVR_CURRENT_OFS                          ( 0)                  /* CURRENT Offset */
#define SYSTICK_STCVR_CURRENT_M                            (0x00ffffff)          /*  */
/* SYSTICK_STCR[SYSTICK_STCR_TENMS] Bits */
#define SYSTICK_STCR_TENMS_OFS                             ( 0)                  /* TENMS Offset */
#define SYSTICK_STCR_TENMS_M                               (0x00ffffff)          /*  */
/* SYSTICK_STCR[SYSTICK_STCR_SKEW] Bits */
#define SYSTICK_STCR_SKEW_OFS                              (30)                  /* SKEW Offset */
#define SYSTICK_STCR_SKEW                                  (0x40000000)          /*  */
/* SYSTICK_STCR[SYSTICK_STCR_NOREF] Bits */
#define SYSTICK_STCR_NOREF_OFS                             (31)                  /* NOREF Offset */
#define SYSTICK_STCR_NOREF                                 (0x80000000)          /*  */


