arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// TIMER_A1 Bits
//*****************************************************************************
/* TA1CTL[TAIFG] Bits */
//#define TAIFG_OFS                                          ( 0)                  /* TAIFG Offset */
//#define TAIFG                                              (0x0001)              /* TimerA interrupt flag */
/* TA1CTL[TAIE] Bits */
//#define TAIE_OFS                                           ( 1)                  /* TAIE Offset */
//#define TAIE                                               (0x0002)              /* TimerA interrupt enable */
/* TA1CTL[TACLR] Bits */
//#define TACLR_OFS                                          ( 2)                  /* TACLR Offset */
//#define TACLR                                              (0x0004)              /* TimerA clear */
/* TA1CTL[MC] Bits */
//#define MC_OFS                                             ( 4)                  /* MC Offset */
//#define MC_M                                               (0x0030)              /* Mode control */
//#define MC0                                                (0x0010)              /* Mode control */
//#define MC1                                                (0x0020)              /* Mode control */
//#define MC_0                                               (0x0000)              /* Stop mode: Timer is halted */
//#define MC_1                                               (0x0010)              /* Up mode: Timer counts up to TAxCCR0 */
//#define MC_2                                               (0x0020)              /* Continuous mode: Timer counts up to 0FFFFh */
//#define MC_3                                               (0x0030)              /* Up/down mode: Timer counts up to TAxCCR0 then down to 0000h */
//#define MC__STOP                                           (0x0000)              /* Stop mode: Timer is halted */
//#define MC__UP                                             (0x0010)              /* Up mode: Timer counts up to TAxCCR0 */
//#define MC__CONTINUOUS                                     (0x0020)              /* Continuous mode: Timer counts up to 0FFFFh */
//#define MC__UPDOWN                                         (0x0030)              /* Up/down mode: Timer counts up to TAxCCR0 then down to 0000h */
/* TA1CTL[ID] Bits */
//#define ID_OFS                                             ( 6)                  /* ID Offset */
//#define ID_M                                               (0x00c0)              /* Input divider */
//#define ID0                                                (0x0040)              /* Input divider */
//#define ID1                                                (0x0080)              /* Input divider */
//#define ID_0                                               (0x0000)              /* /1 */
//#define ID_1                                               (0x0040)              /* /2 */
//#define ID_2                                               (0x0080)              /* /4 */
//#define ID_3                                               (0x00c0)              /* /8 */
//#define ID__1                                              (0x0000)              /* /1 */
//#define ID__2                                              (0x0040)              /* /2 */
//#define ID__4                                              (0x0080)              /* /4 */
//#define ID__8                                              (0x00c0)              /* /8 */
/* TA1CTL[TASSEL] Bits */
//#define TASSEL_OFS                                         ( 8)                  /* TASSEL Offset */
//#define TASSEL_M                                           (0x0300)              /* TimerA clock source select */
//#define TASSEL0                                            (0x0100)              /* TimerA clock source select */
//#define TASSEL1                                            (0x0200)              /* TimerA clock source select */
//#define TASSEL_0                                           (0x0000)              /* TAxCLK */
//#define TASSEL_1                                           (0x0100)              /* ACLK */
//#define TASSEL_2                                           (0x0200)              /* SMCLK */
//#define TASSEL_3                                           (0x0300)              /* INCLK */
//#define TASSEL__TACLK                                      (0x0000)              /* TAxCLK */
//#define TASSEL__ACLK                                       (0x0100)              /* ACLK */
//#define TASSEL__SMCLK                                      (0x0200)              /* SMCLK */
//#define TASSEL__INCLK                                      (0x0300)              /* INCLK */
/* TA1CCTL[CCIFG] Bits */
//#define CCIFG_OFS                                          ( 0)                  /* CCIFG Offset */
//#define CCIFG                                              (0x0001)              /* Capture/compare interrupt flag */
/* TA1CCTL[COV] Bits */
//#define COV_OFS                                            ( 1)                  /* COV Offset */
//#define COV                                                (0x0002)              /* Capture overflow */
/* TA1CCTL[OUT] Bits */
//#define OUT_OFS                                            ( 2)                  /* OUT Offset */
//#define OUT                                                (0x0004)              /* Output */
/* TA1CCTL[CCI] Bits */
//#define CCI_OFS                                            ( 3)                  /* CCI Offset */
//#define CCI                                                (0x0008)              /* Capture/compare input */
/* TA1CCTL[CCIE] Bits */
//#define CCIE_OFS                                           ( 4)                  /* CCIE Offset */
//#define CCIE                                               (0x0010)              /* Capture/compare interrupt enable */
/* TA1CCTL[OUTMOD] Bits */
//#define OUTMOD_OFS                                         ( 5)                  /* OUTMOD Offset */
//#define OUTMOD_M                                           (0x00e0)              /* Output mode */
//#define OUTMOD0                                            (0x0020)              /* Output mode */
//#define OUTMOD1                                            (0x0040)              /* Output mode */
//#define OUTMOD2                                            (0x0080)              /* Output mode */
//#define OUTMOD_0                                           (0x0000)              /* OUT bit value */
//#define OUTMOD_1                                           (0x0020)              /* Set */
//#define OUTMOD_2                                           (0x0040)              /* Toggle/reset */
//#define OUTMOD_3                                           (0x0060)              /* Set/reset */
//#define OUTMOD_4                                           (0x0080)              /* Toggle */
//#define OUTMOD_5                                           (0x00a0)              /* Reset */
//#define OUTMOD_6                                           (0x00c0)              /* Toggle/set */
//#define OUTMOD_7                                           (0x00e0)              /* Reset/set */
/* TA1CCTL[CAP] Bits */
//#define CAP_OFS                                            ( 8)                  /* CAP Offset */
//#define CAP                                                (0x0100)              /* Capture mode */
/* TA1CCTL[SCCI] Bits */
//#define SCCI_OFS                                           (10)                  /* SCCI Offset */
//#define SCCI                                               (0x0400)              /* Synchronized capture/compare input */
/* TA1CCTL[SCS] Bits */
//#define SCS_OFS                                            (11)                  /* SCS Offset */
//#define SCS                                                (0x0800)              /* Synchronize capture source */
/* TA1CCTL[CCIS] Bits */
//#define CCIS_OFS                                           (12)                  /* CCIS Offset */
//#define CCIS_M                                             (0x3000)              /* Capture/compare input select */
//#define CCIS0                                              (0x1000)              /* Capture/compare input select */
//#define CCIS1                                              (0x2000)              /* Capture/compare input select */
//#define CCIS_0                                             (0x0000)              /* CCIxA */
//#define CCIS_1                                             (0x1000)              /* CCIxB */
//#define CCIS_2                                             (0x2000)              /* GND */
//#define CCIS_3                                             (0x3000)              /* VCC */
//#define CCIS__CCIA                                         (0x0000)              /* CCIxA */
//#define CCIS__CCIB                                         (0x1000)              /* CCIxB */
//#define CCIS__GND                                          (0x2000)              /* GND */
//#define CCIS__VCC                                          (0x3000)              /* VCC */
/* TA1CCTL[CM] Bits */
//#define CM_OFS                                             (14)                  /* CM Offset */
//#define CM_M                                               (0xc000)              /* Capture mode */
//#define CM0                                                (0x4000)              /* Capture mode */
//#define CM1                                                (0x8000)              /* Capture mode */
//#define CM_0                                               (0x0000)              /* No capture */
//#define CM_1                                               (0x4000)              /* Capture on rising edge */
//#define CM_2                                               (0x8000)              /* Capture on falling edge */
//#define CM_3                                               (0xc000)              /* Capture on both rising and falling edges */
//#define CM__NONE                                           (0x0000)              /* No capture */
//#define CM__RISING                                         (0x4000)              /* Capture on rising edge */
//#define CM__FALLING                                        (0x8000)              /* Capture on falling edge */
//#define CM__BOTH                                           (0xc000)              /* Capture on both rising and falling edges */
/* TA1EX0[TAIDEX] Bits */
//#define TAIDEX_OFS                                         ( 0)                  /* TAIDEX Offset */
//#define TAIDEX_M                                           (0x0007)              /* Input divider expansion */
//#define TAIDEX0                                            (0x0001)              /* Input divider expansion */
//#define TAIDEX1                                            (0x0002)              /* Input divider expansion */
//#define TAIDEX2                                            (0x0004)              /* Input divider expansion */
//#define TAIDEX_0                                           (0x0000)              /* Divide by 1 */
//#define TAIDEX_1                                           (0x0001)              /* Divide by 2 */
//#define TAIDEX_2                                           (0x0002)              /* Divide by 3 */
//#define TAIDEX_3                                           (0x0003)              /* Divide by 4 */
//#define TAIDEX_4                                           (0x0004)              /* Divide by 5 */
//#define TAIDEX_5                                           (0x0005)              /* Divide by 6 */
//#define TAIDEX_6                                           (0x0006)              /* Divide by 7 */
//#define TAIDEX_7                                           (0x0007)              /* Divide by 8 */
//#define TAIDEX__1                                          (0x0000)              /* Divide by 1 */
//#define TAIDEX__2                                          (0x0001)              /* Divide by 2 */
//#define TAIDEX__3                                          (0x0002)              /* Divide by 3 */
//#define TAIDEX__4                                          (0x0003)              /* Divide by 4 */
//#define TAIDEX__5                                          (0x0004)              /* Divide by 5 */
//#define TAIDEX__6                                          (0x0005)              /* Divide by 6 */
//#define TAIDEX__7                                          (0x0006)              /* Divide by 7 */
//#define TAIDEX__8                                          (0x0007)              /* Divide by 8 */


