arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
//*****************************************************************************
// TIMER_A3 Bits
//*****************************************************************************
/* TA3CTL[TAIFG] Bits */
//#define TAIFG_OFS                                          ( 0)                  /* TAIFG Offset */
//#define TAIFG                                              (0x0001)              /* TimerA interrupt flag */
/* TA3CTL[TAIE] Bits */
//#define TAIE_OFS                                           ( 1)                  /* TAIE Offset */
//#define TAIE                                               (0x0002)              /* TimerA interrupt enable */
/* TA3CTL[TACLR] Bits */
//#define TACLR_OFS                                          ( 2)                  /* TACLR Offset */
//#define TACLR                                              (0x0004)              /* TimerA clear */
/* TA3CTL[MC] Bits */
//#define MC_OFS                                             ( 4)                  /* MC Offset */
//#define MC_M                                               (0x0030)              /* Mode control */
//#define MC0                                                (0x0010)              /* Mode control */
//#define MC1                                                (0x0020)              /* Mode control */
//#define MC_0                                               (0x0000)              /* Stop mode: Timer is halted */
//#define MC_1                                               (0x0010)              /* Up mode: Timer counts up to TAxCCR0 */
//#define MC_2                                               (0x0020)              /* Continuous mode: Timer counts up to 0FFFFh */
//#define MC_3                                               (0x0030)              /* Up/down mode: Timer counts up to TAxCCR0 then down to 0000h */
//#define MC__STOP                                           (0x0000)              /* Stop mode: Timer is halted */
//#define MC__UP                                             (0x0010)              /* Up mode: Timer counts up to TAxCCR0 */
//#define MC__CONTINUOUS                                     (0x0020)              /* Continuous mode: Timer counts up to 0FFFFh */
//#define MC__UPDOWN                                         (0x0030)              /* Up/down mode: Timer counts up to TAxCCR0 then down to 0000h */
/* TA3CTL[ID] Bits */
//#define ID_OFS                                             ( 6)                  /* ID Offset */
//#define ID_M                                               (0x00c0)              /* Input divider */
//#define ID0                                                (0x0040)              /* Input divider */
//#define ID1                                                (0x0080)              /* Input divider */
//#define ID_0                                               (0x0000)              /* /1 */
//#define ID_1                                               (0x0040)              /* /2 */
//#define ID_2                                               (0x0080)              /* /4 */
//#define ID_3                                               (0x00c0)              /* /8 */
//#define ID__1                                              (0x0000)              /* /1 */
//#define ID__2                                              (0x0040)              /* /2 */
//#define ID__4                                              (0x0080)              /* /4 */
//#define ID__8                                              (0x00c0)              /* /8 */
/* TA3CTL[TASSEL] Bits */
//#define TASSEL_OFS                                         ( 8)                  /* TASSEL Offset */
//#define TASSEL_M                                           (0x0300)              /* TimerA clock source select */
//#define TASSEL0                                            (0x0100)              /* TimerA clock source select */
//#define TASSEL1                                            (0x0200)              /* TimerA clock source select */
//#define TASSEL_0                                           (0x0000)              /* TAxCLK */
//#define TASSEL_1                                           (0x0100)              /* ACLK */
//#define TASSEL_2                                           (0x0200)              /* SMCLK */
//#define TASSEL_3                                           (0x0300)              /* INCLK */
//#define TASSEL__TACLK                                      (0x0000)              /* TAxCLK */
//#define TASSEL__ACLK                                       (0x0100)              /* ACLK */
//#define TASSEL__SMCLK                                      (0x0200)              /* SMCLK */
//#define TASSEL__INCLK                                      (0x0300)              /* INCLK */
/* TA3CCTL[CCIFG] Bits */
//#define CCIFG_OFS                                          ( 0)                  /* CCIFG Offset */
//#define CCIFG                                              (0x0001)              /* Capture/compare interrupt flag */
/* TA3CCTL[COV] Bits */
//#define COV_OFS                                            ( 1)                  /* COV Offset */
//#define COV                                                (0x0002)              /* Capture overflow */
/* TA3CCTL[OUT] Bits */
//#define OUT_OFS                                            ( 2)                  /* OUT Offset */
//#define OUT                                                (0x0004)              /* Output */
/* TA3CCTL[CCI] Bits */
//#define CCI_OFS                                            ( 3)                  /* CCI Offset */
//#define CCI                                                (0x0008)              /* Capture/compare input */
/* TA3CCTL[CCIE] Bits */
//#define CCIE_OFS                                           ( 4)                  /* CCIE Offset */
//#define CCIE                                               (0x0010)              /* Capture/compare interrupt enable */
/* TA3CCTL[OUTMOD] Bits */
//#define OUTMOD_OFS                                         ( 5)                  /* OUTMOD Offset */
//#define OUTMOD_M                                           (0x00e0)              /* Output mode */
//#define OUTMOD0                                            (0x0020)              /* Output mode */
//#define OUTMOD1                                            (0x0040)              /* Output mode */
//#define OUTMOD2                                            (0x0080)              /* Output mode */
//#define OUTMOD_0                                           (0x0000)              /* OUT bit value */
//#define OUTMOD_1                                           (0x0020)              /* Set */
//#define OUTMOD_2                                           (0x0040)              /* Toggle/reset */
//#define OUTMOD_3                                           (0x0060)              /* Set/reset */
//#define OUTMOD_4                                           (0x0080)              /* Toggle */
//#define OUTMOD_5                                           (0x00a0)              /* Reset */
//#define OUTMOD_6                                           (0x00c0)              /* Toggle/set */
//#define OUTMOD_7                                           (0x00e0)              /* Reset/set */
/* TA3CCTL[CAP] Bits */
//#define CAP_OFS                                            ( 8)                  /* CAP Offset */
//#define CAP                                                (0x0100)              /* Capture mode */
/* TA3CCTL[SCCI] Bits */
//#define SCCI_OFS                                           (10)                  /* SCCI Offset */
//#define SCCI                                               (0x0400)              /* Synchronized capture/compare input */
/* TA3CCTL[SCS] Bits */
//#define SCS_OFS                                            (11)                  /* SCS Offset */
//#define SCS                                                (0x0800)              /* Synchronize capture source */
/* TA3CCTL[CCIS] Bits */
//#define CCIS_OFS                                           (12)                  /* CCIS Offset */
//#define CCIS_M                                             (0x3000)              /* Capture/compare input select */
//#define CCIS0                                              (0x1000)              /* Capture/compare input select */
//#define CCIS1                                              (0x2000)              /* Capture/compare input select */
//#define CCIS_0                                             (0x0000)              /* CCIxA */
//#define CCIS_1                                             (0x1000)              /* CCIxB */
//#define CCIS_2                                             (0x2000)              /* GND */
//#define CCIS_3                                             (0x3000)              /* VCC */
//#define CCIS__CCIA                                         (0x0000)              /* CCIxA */
//#define CCIS__CCIB                                         (0x1000)              /* CCIxB */
//#define CCIS__GND                                          (0x2000)              /* GND */
//#define CCIS__VCC                                          (0x3000)              /* VCC */
/* TA3CCTL[CM] Bits */
//#define CM_OFS                                             (14)                  /* CM Offset */
//#define CM_M                                               (0xc000)              /* Capture mode */
//#define CM0                                                (0x4000)              /* Capture mode */
//#define CM1                                                (0x8000)              /* Capture mode */
//#define CM_0                                               (0x0000)              /* No capture */
//#define CM_1                                               (0x4000)              /* Capture on rising edge */
//#define CM_2                                               (0x8000)              /* Capture on falling edge */
//#define CM_3                                               (0xc000)              /* Capture on both rising and falling edges */
//#define CM__NONE                                           (0x0000)              /* No capture */
//#define CM__RISING                                         (0x4000)              /* Capture on rising edge */
//#define CM__FALLING                                        (0x8000)              /* Capture on falling edge */
//#define CM__BOTH                                           (0xc000)              /* Capture on both rising and falling edges */
/* TA3EX0[TAIDEX] Bits */
//#define TAIDEX_OFS                                         ( 0)                  /* TAIDEX Offset */
//#define TAIDEX_M                                           (0x0007)              /* Input divider expansion */
//#define TAIDEX0                                            (0x0001)              /* Input divider expansion */
//#define TAIDEX1                                            (0x0002)              /* Input divider expansion */
//#define TAIDEX2                                            (0x0004)              /* Input divider expansion */
//#define TAIDEX_0                                           (0x0000)              /* Divide by 1 */
//#define TAIDEX_1                                           (0x0001)              /* Divide by 2 */
//#define TAIDEX_2                                           (0x0002)              /* Divide by 3 */
//#define TAIDEX_3                                           (0x0003)              /* Divide by 4 */
//#define TAIDEX_4                                           (0x0004)              /* Divide by 5 */
//#define TAIDEX_5                                           (0x0005)              /* Divide by 6 */
//#define TAIDEX_6                                           (0x0006)              /* Divide by 7 */
//#define TAIDEX_7                                           (0x0007)              /* Divide by 8 */
//#define TAIDEX__1                                          (0x0000)              /* Divide by 1 */
//#define TAIDEX__2                                          (0x0001)              /* Divide by 2 */
//#define TAIDEX__3                                          (0x0002)              /* Divide by 3 */
//#define TAIDEX__4                                          (0x0003)              /* Divide by 4 */
//#define TAIDEX__5                                          (0x0004)              /* Divide by 5 */
//#define TAIDEX__6                                          (0x0005)              /* Divide by 6 */
//#define TAIDEX__7                                          (0x0006)              /* Divide by 7 */
//#define TAIDEX__8                                          (0x0007)              /* Divide by 8 */


//*****************************************************************************
// TLV Bits
//*****************************************************************************


//*****************************************************************************
// WDT_A Bits
//*****************************************************************************
/* WDTCTL[WDTIS] Bits */
#define WDTIS_OFS                                          ( 0)                  /* WDTIS Offset */
#define WDTIS_M                                            (0x0007)              /* Watchdog timer interval select */
#define WDTIS0                                             (0x0001)              /* Watchdog timer interval select */
#define WDTIS1                                             (0x0002)              /* Watchdog timer interval select */
#define WDTIS2                                             (0x0004)              /* Watchdog timer interval select */
#define WDTIS_0                                            (0x0000)              /* Watchdog clock source / (2^(31)) (18:12:16 at 32.768 kHz) */
#define WDTIS_1                                            (0x0001)              /* Watchdog clock source /(2^(27)) (01:08:16 at 32.768 kHz) */
#define WDTIS_2                                            (0x0002)              /* Watchdog clock source /(2^(23)) (00:04:16 at 32.768 kHz) */
#define WDTIS_3                                            (0x0003)              /* Watchdog clock source /(2^(19)) (00:00:16 at 32.768 kHz) */
#define WDTIS_4                                            (0x0004)              /* Watchdog clock source /(2^(15)) (1 s at 32.768 kHz) */
#define WDTIS_5                                            (0x0005)              /* Watchdog clock source / (2^(13)) (250 ms at 32.768 kHz) */
#define WDTIS_6                                            (0x0006)              /* Watchdog clock source / (2^(9)) (15.625 ms at 32.768 kHz) */
#define WDTIS_7                                            (0x0007)              /* Watchdog clock source / (2^(6)) (1.95 ms at 32.768 kHz) */
/* WDTCTL[WDTCNTCL] Bits */
#define WDTCNTCL_OFS                                       ( 3)                  /* WDTCNTCL Offset */
#define WDTCNTCL                                           (0x0008)              /* Watchdog timer counter clear */
/* WDTCTL[WDTTMSEL] Bits */
#define WDTTMSEL_OFS                                       ( 4)                  /* WDTTMSEL Offset */
#define WDTTMSEL                                           (0x0010)              /* Watchdog timer mode select */
/* WDTCTL[WDTSSEL] Bits */
#define WDTSSEL_OFS                                        ( 5)                  /* WDTSSEL Offset */
#define WDTSSEL_M                                          (0x0060)              /* Watchdog timer clock source select */
#define WDTSSEL0                                           (0x0020)              /* Watchdog timer clock source select */
#define WDTSSEL1                                           (0x0040)              /* Watchdog timer clock source select */
#define WDTSSEL_0                                          (0x0000)              /* SMCLK */
#define WDTSSEL_1                                          (0x0020)              /* ACLK */
#define WDTSSEL_2                                          (0x0040)              /* VLOCLK */
#define WDTSSEL_3                                          (0x0060)              /* BCLK */
#define WDTSSEL__SMCLK                                     (0x0000)              /* SMCLK */
#define WDTSSEL__ACLK                                      (0x0020)              /* ACLK */
#define WDTSSEL__VLOCLK                                    (0x0040)              /* VLOCLK */
#define WDTSSEL__BCLK                                      (0x0060)              /* BCLK */
/* WDTCTL[WDTHOLD] Bits */
#define WDTHOLD_OFS                                        ( 7)                  /* WDTHOLD Offset */
#define WDTHOLD                                            (0x0080)              /* Watchdog timer hold */
/* WDTCTL[WDTPW] Bits */
#define WDTPW_OFS                                          ( 8)                  /* WDTPW Offset */
#define WDTPW_M                                            (0xff00)              /* Watchdog timer password */

/* Pre-defined bitfield values */
#define WDTPW                                              (0x5A00)              /* WDT Key Value for WDT write access */

//*****************************************************************************
// BSL
//*****************************************************************************
#define BSL_DEFAULT_PARAM                                  (0xFC48FFFF)          /* I2C slave address = 0x48, Interface selection = Auto */
#define BSL_API_TABLE_ADDR                                 (0x00202000)          /* Address of BSL API table */
#define BSL_ENTRY_FUNCTION                                 (*((uint32_t *)BSL_API_TABLE_ADDR))

#define BSL_AUTO_INTERFACE                                 (0x0000E0000)         /* Auto detect interface */
#define BSL_UART_INTERFACE                                 (0x0000C0000)         /* UART interface */
#define BSL_SPI_INTERFACE                                  (0x0000A0000)         /* SPI interface */
#define BSL_I2C_INTERFACE                                  (0x000080000)         /* I2C interface */

#define BSL_INVOKE(x)                                      ((void (*)())BSL_ENTRY_FUNCTION)((uint32_t) x) /* Invoke the BSL with paramters */

//*****************************************************************************
// ULP Advisor
//*****************************************************************************
#ifdef __TMS470__
#pragma ULP_PORT_CONFIG(1,DIR={0x40004C04,8},OUT={0x40004C02,8},SEL1={0x40004C0A,8},SEL2={0x40004C0C,8})
#pragma ULP_PORT_CONFIG(2,DIR={0x40004C05,8},OUT={0x40004C03,8},SEL1={0x40004C0B,8},SEL2={0x40004C0D,8})
#pragma ULP_PORT_CONFIG(3,DIR={0x40004C24,8},OUT={0x40004C22,8},SEL1={0x40004C2A,8},SEL2={0x40004C2C,8})
#pragma ULP_PORT_CONFIG(4,DIR={0x40004C25,8},OUT={0x40004C23,8},SEL1={0x40004C2B,8},SEL2={0x40004C2D,8})
#pragma ULP_PORT_CONFIG(5,DIR={0x40004C44,8},OUT={0x40004C42,8},SEL1={0x40004C4A,8},SEL2={0x40004C4C,8})
#pragma ULP_PORT_CONFIG(6,DIR={0x40004C45,8},OUT={0x40004C43,8},SEL1={0x40004C4B,8},SEL2={0x40004C4D,8})
#pragma ULP_PORT_CONFIG(7,DIR={0x40004C64,8},OUT={0x40004C62,8},SEL1={0x40004C6A,8},SEL2={0x40004C6C,8})
#pragma ULP_PORT_CONFIG(8,DIR={0x40004C65,8},OUT={0x40004C63,8},SEL1={0x40004C6B,8},SEL2={0x40004C6D,8})
#pragma ULP_PORT_CONFIG(9,DIR={0x40004C84,8},OUT={0x40004C82,8},SEL1={0x40004C8A,8},SEL2={0x40004C8C,8})
#pragma ULP_PORT_CONFIG(10,DIR={0x40004C85,8},OUT={0x40004C83,8},SEL1={0x40004C8B,8},SEL2={0x40004C8D,8})
#endif

//*****************************************************************************
// NVIC interrupts
//*****************************************************************************

// System exceptions
#define FAULT_NMI                                          ( 2)                  /* NMI fault */
#define FAULT_HARD                                         ( 3)                  /* Hard fault */
#define FAULT_MPU                                          ( 4)                  /* MPU fault */
#define FAULT_BUS                                          ( 5)                  /* Bus fault */
#define FAULT_USAGE                                        ( 6)                  /* Usage fault */
#define FAULT_SVCALL                                       (11)                  /* SVCall */
#define FAULT_DEBUG                                        (12)                  /* Debug monitor */
#define FAULT_PENDSV                                       (14)                  /* PendSV */
#define FAULT_SYSTICK                                      (15)                  /* System Tick */

