arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r.h
// External interrupts
#define INT_PSS                                            (16)                  /* PSS IRQ */
#define INT_CS                                             (17)                  /* CS IRQ */
#define INT_PCM                                            (18)                  /* PCM IRQ */
#define INT_WDT_A                                          (19)                  /* WDT_A IRQ */
#define INT_FPU                                            (20)                  /* FPU IRQ */
#define INT_FLCTL                                          (21)                  /* FLCTL IRQ */
#define INT_COMP_E0                                        (22)                  /* COMP_E0 IRQ */
#define INT_COMP_E1                                        (23)                  /* COMP_E1 IRQ */
#define INT_TA0_0                                          (24)                  /* TA0_0 IRQ */
#define INT_TA0_N                                          (25)                  /* TA0_N IRQ */
#define INT_TA1_0                                          (26)                  /* TA1_0 IRQ */
#define INT_TA1_N                                          (27)                  /* TA1_N IRQ */
#define INT_TA2_0                                          (28)                  /* TA2_0 IRQ */
#define INT_TA2_N                                          (29)                  /* TA2_N IRQ */
#define INT_TA3_0                                          (30)                  /* TA3_0 IRQ */
#define INT_TA3_N                                          (31)                  /* TA3_N IRQ */
#define INT_EUSCIA0                                        (32)                  /* EUSCIA0 IRQ */
#define INT_EUSCIA1                                        (33)                  /* EUSCIA1 IRQ */
#define INT_EUSCIA2                                        (34)                  /* EUSCIA2 IRQ */
#define INT_EUSCIA3                                        (35)                  /* EUSCIA3 IRQ */
#define INT_EUSCIB0                                        (36)                  /* EUSCIB0 IRQ */
#define INT_EUSCIB1                                        (37)                  /* EUSCIB1 IRQ */
#define INT_EUSCIB2                                        (38)                  /* EUSCIB2 IRQ */
#define INT_EUSCIB3                                        (39)                  /* EUSCIB3 IRQ */
#define INT_ADC14                                          (40)                  /* ADC14 IRQ */
#define INT_T32_INT1                                       (41)                  /* T32_INT1 IRQ */
#define INT_T32_INT2                                       (42)                  /* T32_INT2 IRQ */
#define INT_T32_INTC                                       (43)                  /* T32_INTC IRQ */
#define INT_AES256                                         (44)                  /* AES256 IRQ */
#define INT_RTC_C                                          (45)                  /* RTC_C IRQ */
#define INT_DMA_ERR                                        (46)                  /* DMA_ERR IRQ */
#define INT_DMA_INT3                                       (47)                  /* DMA_INT3 IRQ */
#define INT_DMA_INT2                                       (48)                  /* DMA_INT2 IRQ */
#define INT_DMA_INT1                                       (49)                  /* DMA_INT1 IRQ */
#define INT_DMA_INT0                                       (50)                  /* DMA_INT0 IRQ */
#define INT_PORT1                                          (51)                  /* PORT1 IRQ */
#define INT_PORT2                                          (52)                  /* PORT2 IRQ */
#define INT_PORT3                                          (53)                  /* PORT3 IRQ */
#define INT_PORT4                                          (54)                  /* PORT4 IRQ */
#define INT_PORT5                                          (55)                  /* PORT5 IRQ */
#define INT_PORT6                                          (56)                  /* PORT6 IRQ */

// Highest interrupt available
#define NUM_INTERRUPTS                                     (56)

#endif // __MSP432P401R_H__

